[
  {
    "slug": "alarb",
    "الاسم": "معيار الاستدلال القانوني العربي (ALARB)",
    "الاسم_الأصلي": "ALARB: An Arabic Legal Argument Reasoning Benchmark",
    "درجة_الجودة": 82,
    "تقدير_الجودة": "ممتاز",
    "الملخص": "مجموعة بيانات متخصصة في الاستدلال القانوني العربي تضم أكثر من 13 ألف قضية من المحاكم التجارية السعودية. تتميز بهيكل غني يشمل وقائع القضية وتسبيب المحكمة والأنظمة المطبقة والحكم النهائي، مما يجعلها مرجعاً مهماً لتقييم قدرات النماذج اللغوية الكبيرة في الاستدلال القانوني متعدد الخطوات. البيانات مستخرجة من قضايا حقيقية وتتسم بجودة لغوية عالية وتنظيم محكم، مع وجود بعض التحديات المتعلقة بالخصوصية وتركّز النطاق على المحاكم التجارية فقط.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 10,
      "معاينة_العينات": [
        "وقائع: اتفق أطراف الدعوى على توريد عمالة بثمن 69,129.60 ريال، أقر وكيل المدعى عليها بالمبلغ وتم الصلح. الحكم: إثبات الصلح وإلزام المدعى عليها بالسداد في موعد أقصاه 30/10/2023.",
        "وقائع: دعوى تعويض عن أتعاب محاماة ناشئة عن قضية سابقة بحكم قطعي بمبلغ 481,003 ريال. المدعية تطالب بـ 100,000 ريال أتعاب محاماة. الحكم: التعويض عن أضرار التقاضي.",
        "وقائع: تعاقد لتنفيذ أعمال تشطيبات في مركز الملك عبدالله المالي بمقابل 742,131 ريال. الحكم: إلزام المدعى عليها بسداد المبلغ مع 70,000 ريال أتعاب محاماة."
      ],
      "مشاكل_مكتشفة": [
        "المخاطر الأخلاقية متوسطة حيث تتضمن البيانات قضايا تجارية حقيقية قد تحتوي على معلومات حساسة كأسماء شركات ومبالغ مالية",
        "النطاق محدود بالمحاكم التجارية السعودية فقط دون شمول أنواع أخرى من المحاكم أو الدول العربية",
        "الورقة البحثية منشورة كمسودة أولية (preprint) على arXiv ولم تخضع بعد لمراجعة أقران كاملة في مجلة محكّمة",
        "بعض القوانين المذكورة في حقل applicable_laws طويلة جداً وقد تحتوي على نصوص كاملة للمواد القانونية مما قد يؤثر على كفاءة المعالجة"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "النصوص العربية سليمة لغوياً وخالية من التشوه، مكتوبة بالعربية الفصحى القانونية الرسمية",
      "هيكل البيانات منظم ومتسق: كل قضية تتضمن وقائع مرقمة وتسبيب متسلسل وأنظمة مطبقة وحكم نهائي",
      "التسبيب القانوني مفصّل ومتعدد الخطوات مما يجعلها مثالية لاختبار الاستدلال القانوني",
      "ربط كل قضية بالمواد النظامية المطبقة مع نص المادة الكامل يوفر سياقاً قانونياً غنياً",
      "حجم مناسب (أكثر من 13 ألف قضية) مع تقسيم واضح للتدريب والاختبار (12,000/1,330)",
      "البيانات مستخرجة من قضايا حقيقية وليست مصطنعة مما يعكس التعقيد الواقعي للاستدلال القانوني",
      "ترخيص مفتوح (Apache-2.0) يسمح بالاستخدام الأكاديمي والتجاري",
      "متاحة بسهولة عبر HuggingFace بصيغة Parquet مع دعم مكتبات متعددة"
    ],
    "نقاط_الضعف": [
      "مقتصرة على المحاكم التجارية السعودية دون تمثيل أنواع أخرى من القضايا أو الأنظمة القانونية العربية",
      "مخاطر أخلاقية متوسطة بسبب احتوائها على بيانات قضايا حقيقية قد تتضمن معلومات تعريفية",
      "الورقة البحثية لم تخضع لمراجعة أقران كاملة بعد (منشورة كمسودة أولية على arXiv)",
      "لا توجد معلومات واضحة عن عملية التحقق من جودة البيانات أو اتفاق المُعلِّقين",
      "حقل الأنظمة المطبقة (applicable_laws) قد يكون فارغاً في بعض القضايا (0-16 عنصر)"
    ],
    "الاستخدامات_الموصى_بها": [
      "تقييم قدرات النماذج اللغوية الكبيرة في الاستدلال القانوني العربي",
      "التنبؤ بأحكام المحاكم التجارية بناءً على وقائع القضية",
      "إكمال سلاسل الاستدلال القانوني متعدد الخطوات",
      "تحديد الأنظمة والمواد القانونية المطبقة على قضية معينة",
      "الضبط الدقيق للنماذج اللغوية لتحسين أدائها في المجال القانوني العربي",
      "البحث الأكاديمي في معالجة اللغة القانونية العربية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 95,
      "التوثيق": 75,
      "السلامة_الأخلاقية": 60,
      "الترخيص": 95,
      "قابلية_إعادة_الإنتاج": 70,
      "المراجعة_العلمية": 55,
      "جودة_البيانات": 88
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/HarethahMo/ALARB",
      "https://arxiv.org/abs/2510.00694",
      "https://arxiv.org/pdf/2510.00694"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2025,
    "Tasks": [
      "question answering"
    ],
    "Form": "text",
    "Volume": 13344.0,
    "Unit": "documents",
    "License": "Apache-2.0",
    "HF Link": "https://huggingface.co/datasets/HarethahMo/ALARB",
    "Paper Link": "https://arxiv.org/pdf/2510.00694",
    "Domain": [
      "web pages"
    ],
    "Authors": [
      "Harethah AbuShairah",
      "Somayah AlHarbi",
      "Abdulaziz AlHussein",
      "Sameer Alsabea",
      "Omar Shaqaqi",
      "Hebah AlShamlan",
      "Omar Knio",
      "George Turkiyyah"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "preprint"
  },
  {
    "slug": "arabculture",
    "الاسم": "الثقافة العربية",
    "الاسم_الأصلي": "ArabCulture",
    "درجة_الجودة": 78,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات متخصصة في الاستدلال المنطقي المبني على المعرفة الثقافية العربية، تغطي ١٣ دولة عربية عبر أربع مناطق جغرافية (الخليج، الشام، شمال أفريقيا، وادي النيل). تتكون من ٣٤٨٢ سؤال اختيار من متعدد (٣ خيارات) كتبها متحدثون أصليون من كل دولة، وتشمل ١٢ مجالاً من الحياة اليومية مع ٥٢ موضوعاً فرعياً تتراوح بين عادات الطعام والأعراس والأمثال الشعبية. البيانات ذات جودة جيدة بشكل عام مع تنوع ثقافي ملحوظ، لكنها تعاني من بعض المشاكل مثل وجود عبارات قصيرة جداً وخلط طفيف بين اللهجة والفصحى، إضافة إلى عدد محدود من الخيارات المكررة. الورقة البحثية المرافقة قُبلت في مؤتمر ACL 2025 المرموق.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 3482,
      "معاينة_العينات": [
        "الجزائر: تفضل مريم اكل فطور صباح مشبع و لذيذ لبدأ يومها — الخيارات: أ) تحضر مريم ندويشات و مملحات مصحوبة بعصير، ب) تفضل مريم تحضير العصير و معجنات بالشكولاتة، ج) تحضر مريم قهوة بالحليب وترافقه بكرواسون — الإجابة: ج",
        "مصر: يقوم أحمد بتحضير الفول للإفطار — الخيارات: أ) يتم تناول الفول مع الأرز، ب) يتم تناول الفول بالخبز، ج) يتم تناول الفول مع الفواكه — الإجابة: ب",
        "اليمن: يتناول عبدالله شيئا حارا مع وجبة الصبوح — الخيارات: أ) يتناول عبدالله السحاوق مع وجبة الصبوح، ب) يتناول عبدالله العشار مع وجبة الصبوح، ج) يتناول عبدالله الكاتشب مع وجبة الصبوح — الإجابة: أ"
      ],
      "مشاكل_مكتشفة": [
        "وجود ١٤٤ عبارة قصيرة جداً (أقل من ٢٠ حرفاً) قد تفتقر إلى سياق كافٍ مثل: 'تم دفن الميت' و'عرس ليلة تدبارو عام'",
        "وجود ٨ أسئلة تحتوي خيارات متكررة (نسختان من نفس الخيار) مما يجعل التمييز بينها مستحيلاً",
        "عينتان تحتويان على حروف لاتينية مدمجة في النص العربي مثل 'vs' في عينات فلسطين و'l' في عينة الجزائر",
        "خلط بين اللهجة المحلية والعربية الفصحى رغم أن الوصف يدّعي استخدام العربية الفصحى الحديثة — عينات الجزائر مثلاً تستخدم ألفاظاً دارجة مثل 'ياخد' و'ندويشات' و'مملحات'",
        "البيانات متاحة فقط في تقسيم الاختبار (test) دون وجود تقسيمات تدريب أو تحقق، مما يحدّ من استخدامها في التدريب",
        "وجود تكرار طفيف في العبارات الأساسية (عبارتان متكررتان من أصل ٣٤٨٢)"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "تغطية جغرافية واسعة تشمل ١٣ دولة عربية عبر ٤ مناطق مختلفة مع توزيع متوازن نسبياً (٢٣٩-٢٩٠ عينة لكل دولة)",
      "توزيع متوازن للإجابات الصحيحة بين الخيارات الثلاثة (أ: ٣٤.٣٪، ب: ٣٤.٣٪، ج: ٣١.٤٪) مما يقلل التحيز الموضعي",
      "تنوع موضوعي غني يشمل ٥٢ موضوعاً فرعياً تغطي جوانب متعددة من الحياة اليومية العربية",
      "بيانات أصلية كُتبت من الصفر بواسطة متحدثين أصليين وليست مترجمة آلياً من الإنجليزية",
      "هيكل بيانات غني يتضمن معلومات وصفية مفيدة مثل مدى الصلة بالدولة والمنطقة وتوصيات الحذف",
      "الورقة البحثية قُبلت في مؤتمر ACL 2025 مما يدل على مراجعة علمية دقيقة",
      "لم تُعلَّم أي عينة بالحذف (should_discard=No لكل العينات) مما يدل على عملية تنقيح مسبقة"
    ],
    "نقاط_الضعف": [
      "حجم البيانات محدود نسبياً (٣٤٨٢ عينة فقط) وهو صغير مقارنة بمجموعات الاستدلال المنطقي الأخرى",
      "غياب تقسيمات التدريب والتحقق — يتوفر فقط تقسيم الاختبار مما يحدّ من إمكانية استخدام البيانات في تدريب النماذج",
      "وجود خلط بين اللهجات المحلية والعربية الفصحى رغم ادعاء الوصف أن البيانات بالعربية الفصحى الحديثة",
      "بعض العبارات قصيرة جداً ولا توفر سياقاً كافياً للاستدلال المنطقي",
      "عدد قليل من الأسئلة يحتوي خيارات متكررة مما يُضعف صلاحية التقييم",
      "الترخيص غير تجاري (CC BY-NC-SA 4.0) مما يحدّ من الاستخدام في التطبيقات التجارية",
      "نسبة كبيرة من الأسئلة (٥٩.٩٪) ذات صلة بدول أخرى أيضاً مما قد يُضعف خصوصية الأسئلة ثقافياً لبلد بعينه"
    ],
    "الاستخدامات_الموصى_بها": [
      "تقييم قدرة نماذج اللغة الكبيرة على فهم الثقافة العربية المتنوعة في وضع التقييم الصفري",
      "المقارنة المرجعية بين النماذج اللغوية في مهام الاستدلال المنطقي الثقافي العربي",
      "دراسة التباينات الثقافية بين الدول العربية في مجالات الحياة اليومية",
      "تطوير نماذج لغوية أكثر وعياً بالتنوع الثقافي في العالم العربي",
      "البحث الأكاديمي في مجال معالجة اللغة العربية الطبيعية مع التركيز على البُعد الثقافي"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 90,
      "التوثيق": 75,
      "السلامة_الأخلاقية": 90,
      "الترخيص": 65,
      "قابلية_إعادة_الإنتاج": 60,
      "المراجعة_العلمية": 85,
      "جودة_البيانات": 72
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/MBZUAI/ArabCulture",
      "https://arxiv.org/abs/2502.12788",
      "https://arxiv.org/pdf/2502.12788"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2025,
    "Tasks": [
      "commonsense reasoning",
      "multiple choice question answering"
    ],
    "Form": "text",
    "Volume": 3482.0,
    "Unit": "sentences",
    "License": "CC BY-NC-SA 4.0",
    "HF Link": "https://huggingface.co/datasets/MBZUAI/ArabCulture",
    "Paper Link": "https://arxiv.org/pdf/2502.12788",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Abdelrahman Sadallah",
      "Junior Cedric Tonga",
      "Khalid Almubarak",
      "Saeed Almheiri",
      "Farah Atif",
      "Chatrine Qwaider",
      "Karima Kadaoui",
      "Sara Shatnawi",
      "Yaser Alesh",
      "Fajri Koto"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "preprint"
  },
  {
    "slug": "arabic_machine_generated_text_dataset",
    "الاسم": "مجموعة بيانات النصوص العربية المولّدة آلياً",
    "الاسم_الأصلي": "Arabic Machine-Generated Text Dataset",
    "درجة_الجودة": 78,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات تحتوي على ملخصات أكاديمية عربية أصلية مقترنة بنسخ مولّدة آلياً بواسطة أربعة نماذج لغوية كبيرة (ALLaM وJais وLlama وGPT-4) باستخدام ثلاث استراتيجيات توليد مختلفة (التنقيح، التوليد من العنوان فقط، والتوليد من العنوان والمحتوى). تضم حوالي 8,388 وثيقة موزعة على ثلاثة تقسيمات، وتُستخدم لأبحاث كشف النصوص المولّدة آلياً والتحليل الأسلوبي. النصوص العربية سليمة لغوياً بشكل عام مع بعض الملاحظات البسيطة على مخرجات بعض النماذج، وتمثل مورداً قيّماً لأبحاث معالجة اللغة العربية الطبيعية في مجال لا يزال شحيح الموارد.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 12,
      "معاينة_العينات": [
        "original_abstract: كثيرا ما ارتبطت المصادر التاريخية في الأندلس خاصة منها كتب التراجم والفهرسات والبرامج وغيرها بدراسة حياة العلماء والرواة والقضاة والساسة... | allam: يتناول هذا البحث موضوع التعليم بين النساء الأندلسيات...",
        "original_abstract: يعد العامل الثقافي احد ابرز الاسباب التي يعزى لها سقوط الدولة الموحدية... | jais: كان العامل الثقافي من بين الأسباب الرئيسية التي أدت إلى سقوط الدولة الموحدية...",
        "original_abstract: شكلت تلك الجهود والمساعي الرائدة التي قام بها قادة الثورة خلال مرحلتها الأولى (1954-1956)... | openai: جهود قادة الثورة الجزائرية خلال المرحلة الأولى كانت حاسمة في البحث عن مصادر التسليح..."
      ],
      "مشاكل_مكتشفة": [
        "النصوص الأصلية نفسها تتكرر عبر التقسيمات الثلاثة (حوالي 2,822 نصاً مشتركاً بين تقسيمي by_polishing وfrom_title)، وهذا متوقع حسب تصميم المجموعة لكنه قد يُربك المستخدمين",
        "بعض مخرجات نموذج Jais تحتوي على تعليقات وصفية مثل 'للأسف، النص المقدم غير واضح وغير قابل للقراءة' بدلاً من توليد ملخص فعلي في تقسيم from_title_and_content",
        "الترخيص غير محدد (unknown) مما يحد من وضوح الاستخدام القانوني",
        "لا يوجد تقسيم اختبار منفصل مما يصعّب المقارنة المعيارية المباشرة",
        "التوثيق على HuggingFace محدود ولا يتضمن شرحاً مفصلاً لمنهجية جمع البيانات الأصلية"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "تغطية أربعة نماذج لغوية كبيرة متنوعة (ALLaM وJais وLlama وGPT-4) مما يتيح دراسات مقارنة شاملة",
      "ثلاث استراتيجيات توليد مختلفة (تنقيح، من العنوان، من العنوان والمحتوى) تعكس سيناريوهات استخدام واقعية",
      "لا يوجد تكرار داخل أي تقسيم ولا حقول فارغة على الإطلاق عبر جميع الأعمدة الخمسة",
      "النصوص الأصلية ملخصات أكاديمية عربية سليمة لغوياً ومتنوعة الموضوعات (تاريخ، سياسة، تربية، دين)",
      "حجم معقول (8,388 وثيقة) يكفي لتدريب وتقييم نماذج الكشف",
      "متاحة مجاناً على HuggingFace بصيغة Parquet سهلة التحميل والاستخدام",
      "مدعومة بورقة بحثية تتضمن تحليلاً أسلوبياً معمقاً ونتائج كشف عالية الدقة (99.9% F1-score)"
    ],
    "نقاط_الضعف": [
      "الترخيص غير محدد مما يخلق غموضاً قانونياً حول إعادة الاستخدام",
      "الورقة البحثية منشورة كمسودة على arXiv ولم تخضع لمراجعة أقران رسمية بعد",
      "لا يوجد تقسيم اختبار منفصل، مما يتطلب من المستخدمين إنشاء تقسيماتهم الخاصة",
      "البيانات مقتصرة على الملخصات الأكاديمية ولا تشمل نصوص وسائل التواصل الاجتماعي المذكورة في الورقة",
      "بعض مخرجات Jais تحتوي على تعليقات وصفية بدلاً من نص مولّد فعلي",
      "متوسط طول نصوص Jais المولّدة أقصر بكثير من النصوص الأصلية (435 حرفاً مقابل 741 للأصلية في تقسيم by_polishing)"
    ],
    "الاستخدامات_الموصى_بها": [
      "تدريب وتقييم نماذج كشف النصوص العربية المولّدة بالذكاء الاصطناعي",
      "التحليل الأسلوبي المقارن بين النصوص البشرية والمولّدة آلياً باللغة العربية",
      "دراسة خصائص مخرجات النماذج اللغوية الكبيرة المختلفة عند التعامل مع اللغة العربية",
      "أبحاث سلامة المعلومات ومكافحة التضليل في المحتوى العربي الأكاديمي",
      "دراسات التعميم عبر النماذج والمجالات في مهام كشف النصوص المولّدة"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 90,
      "التوثيق": 55,
      "السلامة_الأخلاقية": 85,
      "الترخيص": 25,
      "قابلية_إعادة_الإنتاج": 65,
      "المراجعة_العلمية": 45,
      "جودة_البيانات": 80
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/KFUPM-JRCAI/arabic-generated-abstracts",
      "https://arxiv.org/abs/2505.23276"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2025,
    "Tasks": [
      "AI-generated text detection"
    ],
    "Form": "text",
    "Volume": 8388.0,
    "Unit": "documents",
    "License": "unknown",
    "HF Link": "https://huggingface.co/datasets/KFUPM-JRCAI/arabic-generated-abstracts",
    "Paper Link": "https://arxiv.org/pdf/2505.23276",
    "Domain": [
      "web pages"
    ],
    "Authors": [
      "Maged S. Al-Shaibani",
      "Moataz Ahmed"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "preprint"
  },
  {
    "slug": "arabic_text_diacritization",
    "الاسم": "تشكيل النصوص العربية",
    "الاسم_الأصلي": "Arabic Text Diacritization",
    "درجة_الجودة": 78,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات متخصصة في تشكيل النصوص العربية، تتكون من 55,000 سطر (حوالي 2.3 مليون كلمة) مستخرجة من مدونة تشكيلة. تتضمن كل عينة حقلين: النص العربي بدون تشكيل والنص نفسه مع التشكيل الكامل. البيانات مأخوذة بشكل أساسي من نصوص فقهية ودينية وتراثية عربية فصحى. الجودة التقنية للتشكيل جيدة مع تطابق تام بين النص الأصلي والمشكل في جميع العينات المفحوصة (100 عينة)، لكن التنوع في المجالات محدود حيث يغلب المحتوى الديني والفقهي، مما يحد من قابلية التعميم على نصوص عربية حديثة أو عامة.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 500,
      "معاينة_العينات": [
        "text: 'ولو جمع ثم علم ترك ركن من الأولى بطلتا ويعيدهما جامعا' -> diaritized: 'وَلَوْ جَمَعَ ثُمَّ عَلِمَ تَرْكَ رُكْنٍ مِنْ الْأُولَى بَطَلَتَا وَيُعِيدُهُمَا جَامِعًا'",
        "text: 'قال أبو زيد أهل تهامة يؤنثون العضد وبنو تميم يذكرون' -> diaritized: 'قَالَ أَبُو زَيْدٍ أَهْلُ تِهَامَةَ يُؤَنِّثُونَ الْعَضُدَ وَبَنُو تَمِيمٍ يُذَكِّرُونَ'",
        "text: 'بمنزلة أهل الذمة إذا دخلوا قرية من قرى أهل الحرب ثم ظفر المسلمون بها' -> diaritized: 'بِمَنْزِلَةِ أَهْلِ الذِّمَّةِ إذَا دَخَلُوا قَرْيَةً مِنْ قُرَى أَهْلِ الْحَرْبِ ثُمَّ ظَفِرَ الْمُسْلِمُونَ بِهَا'"
      ],
      "مشاكل_مكتشفة": [
        "المحتوى يغلب عليه الطابع الديني والفقهي التراثي، مما يحد من تنوع المجالات",
        "وجود 22 نصاً قصيراً جداً (أقل من 20 حرفاً) من أصل 500 عينة، بعضها مجرد إشارات مرجعية مثل 'وكذلك( 1 / 61 )'",
        "اسم حقل التشكيل مكتوب بخطأ إملائي في الإنجليزية: 'diaritized' بدلاً من 'diacritized'",
        "الوصف على HuggingFace مختصر جداً ولا يوفر معلومات كافية عن المنهجية أو مصدر البيانات"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "تطابق تام بين النص غير المشكل والنص المشكل بعد إزالة التشكيل في جميع العينات المفحوصة (100 عينة بدون أي خطأ)",
      "لا توجد تكرارات في 500 عينة مفحوصة",
      "لا توجد نصوص فارغة في أي من الحقلين",
      "نسبة التشكيل متسقة عبر العينات (36-41%)، مما يدل على تشكيل منهجي وشامل",
      "تقسيم واضح ومنظم إلى تدريب (50,000) وتحقق (2,500) واختبار (2,500)",
      "ترخيص MIT مفتوح يسمح بالاستخدام الحر",
      "ورقة بحثية منشورة في مؤتمر علمي (ICCAIS 2019) توثق المنهجية",
      "البيانات متاحة على HuggingFace وGitHub مما يسهل الوصول إليها",
      "حجم مناسب للمهمة (55,000 سطر، 2.3 مليون كلمة)"
    ],
    "نقاط_الضعف": [
      "تنوع محدود في المجالات: المحتوى يغلب عليه النصوص الفقهية والدينية التراثية (من مدونة تشكيلة)، مما يحد من قابلية التعميم",
      "بعض العينات قصيرة جداً وتحتوي على إشارات مرجعية فقط مثل أرقام الصفحات والأجزاء",
      "التوثيق على HuggingFace مختصر جداً - لا يوفر بطاقة بيانات شاملة",
      "خطأ إملائي في اسم الحقل 'diaritized' قد يسبب إرباكاً للمستخدمين",
      "لا يشمل نصوصاً عربية حديثة أو صحفية أو علمية أو محادثاتية",
      "حجم البيانات متوسط مقارنة بمجموعات بيانات التشكيل الأكبر"
    ],
    "الاستخدامات_الموصى_بها": [
      "تدريب وتقييم نماذج التشكيل التلقائي للنصوص العربية الفصحى",
      "قياس أداء أنظمة التشكيل المختلفة باستخدام معيار مرجعي موحد",
      "البحث في تطبيقات معالجة اللغة العربية الطبيعية المتعلقة بالتشكيل",
      "تطوير أنظمة تحويل النص إلى كلام للنصوص الدينية والتراثية",
      "التدريب الأولي لنماذج التشكيل مع الحاجة لبيانات إضافية من مجالات أخرى للتعميم"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 92,
      "التوثيق": 55,
      "السلامة_الأخلاقية": 90,
      "الترخيص": 95,
      "قابلية_إعادة_الإنتاج": 80,
      "المراجعة_العلمية": 72,
      "جودة_البيانات": 75
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/arabic_text_diacritization",
      "https://github.com/AliOsm/arabic-text-diacritization",
      "https://arxiv.org/abs/1905.01965"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2019,
    "Tasks": [
      "diacritization"
    ],
    "Form": "text",
    "Volume": 55000.0,
    "Unit": "sentences",
    "License": "MIT License",
    "HF Link": "https://hf.co/datasets/arbml/arabic_text_diacritization",
    "Paper Link": "https://arxiv.org/pdf/1905.01965.pdf",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Ali Fadel",
      "Ibraheem Tuffaha",
      "Bara’ Al-Jawarneh",
      "Mahmoud Al-Ayyoub"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  },
  {
    "slug": "arab_states_analogy_dataset_(asad)",
    "الاسم": "مجموعة بيانات تناظرات الدول العربية (ASAD)",
    "الاسم_الأصلي": "Arab States Analogy Dataset (ASAD)",
    "درجة_الجودة": 75,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات تناظرات لغوية عربية مبنية يدوياً تتضمن 1520 تناظراً مستخلصاً من 20 دولة عربية، موزعة على أربع مجموعات فرعية: البلد-العاصمة، البلد-القارة، البلد-العملة، والبلد-الجنسية، بواقع 380 تناظراً لكل مجموعة. تُستخدم لتقييم نماذج تضمين الكلمات العربية وليست مجموعة تدريب. البيانات دقيقة لغوياً وخالية من الأخطاء بنسبة 100% بعد الفحص الآلي لجميع العينات، لكنها محدودة الحجم والنطاق كونها تقتصر على معلومات جغرافية-سياسية بسيطة تتعلق بالدول العربية فقط. نُشرت في مؤتمر ArabicNLP 2023 وهي متاحة مجاناً بترخيص MIT.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 1520,
      "معاينة_العينات": [
        "{'example1': 'الجزائر', 'example2': 'الجزائر', 'query': 'المنامة', 'answer': 'البحرين'} — تناظر عاصمة-بلد",
        "{'example1': 'الجزائر', 'example2': 'أفريقيا', 'query': 'البحرين', 'answer': 'آسيا'} — تناظر بلد-قارة",
        "{'example1': 'الجزائر', 'example2': 'الدينار', 'query': 'البحرين', 'answer': 'الدينار'} — تناظر بلد-عملة"
      ],
      "مشاكل_مكتشفة": [
        "حجم المجموعة صغير جداً (1520 عينة فقط) مما يحد من قدرتها التقييمية",
        "تغطي 20 دولة عربية فقط من أصل 22 — تم استبعاد الإمارات وجزر القمر لأن أسماء عواصمها مركبة من كلمتين",
        "البيانات تكرارية بنيوياً: كل مجموعة فرعية هي جداء ديكارتي لنفس العلاقات بين 20 دولة (20×19=380 تركيبة)",
        "العملات مبسطة إلى الاسم العام فقط (مثل 'الدينار') دون تمييز بين الدينار الجزائري والبحريني والعراقي وغيرها",
        "حقل الوحدة في البيانات الوصفية يذكر 'sentences' بينما البيانات هي أزواج كلمات وليست جملاً"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "دقة لغوية عالية: لا توجد أخطاء إملائية أو مشاكل ترميز في أي من العينات الـ1520 بعد الفحص الكامل",
      "صحة واقعية كاملة: جميع العلاقات (عاصمة-بلد، بلد-قارة، بلد-عملة، بلد-جنسية) تم التحقق منها وهي صحيحة 100%",
      "لا يوجد تكرار على مستوى الصفوف — كل صف فريد",
      "بنية منظمة وواضحة بأربعة أعمدة بسيطة تسهل الاستخدام البرمجي",
      "متاحة على منصتين (HuggingFace وGitHub) بصيغ متعددة (CSV وParquet ونص خام)",
      "ترخيص MIT المفتوح يتيح الاستخدام الحر",
      "مدعومة بورقة بحثية منشورة في مؤتمر محكّم (ArabicNLP 2023)"
    ],
    "نقاط_الضعف": [
      "حجم صغير جداً (1520 عينة) لا يكفي لتقييم شامل لنماذج التضمين",
      "نطاق ضيق جداً: تقتصر على معلومات جغرافية-سياسية أساسية عن الدول العربية فقط",
      "لا تغطي علاقات دلالية متنوعة كالمرادفات والأضداد والعلاقات المجردة",
      "البنية التكرارية (الجداء الديكارتي) تجعل البيانات متوقعة وقد تضخم نتائج التقييم",
      "استبعاد دولتين عربيتين بسبب قيود تقنية (أسماء عواصم مركبة) يعكس محدودية التصميم",
      "العملات غير مميزة — عدة دول تشترك في نفس اسم العملة مما يقلل من صعوبة التمييز",
      "لا يوجد تقسيم إلى مجموعات تدريب واختبار وتحقق",
      "الوصف في البيانات الوصفية يصف الوحدة بأنها 'sentences' وهذا غير دقيق"
    ],
    "الاستخدامات_الموصى_بها": [
      "تقييم أولي سريع لنماذج تضمين الكلمات العربية على مفردات الدول العربية",
      "مقارنة أداء نماذج Word2Vec وFastText وغيرها على التناظرات العربية الجغرافية",
      "استخدام تعليمي لشرح مفهوم تناظرات الكلمات في معالجة اللغة العربية",
      "جزء من مجموعة تقييم أوسع إلى جانب مجموعات بيانات تناظرات أخرى أكثر تنوعاً"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 95,
      "التوثيق": 70,
      "السلامة_الأخلاقية": 95,
      "الترخيص": 95,
      "قابلية_إعادة_الإنتاج": 90,
      "المراجعة_العلمية": 75,
      "جودة_البيانات": 70
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/SaiedAlshahrani/ASAD",
      "https://github.com/SaiedAlshahrani/performance-implications/tree/main/Word-Representation-Evals/ASAD",
      "https://aclanthology.org/2023.arabicnlp-1.19/",
      "https://raw.githubusercontent.com/SaiedAlshahrani/performance-implications/main/Word-Representation-Evals/ASAD/README.md"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2023,
    "Tasks": [
      "embedding evaluation"
    ],
    "Form": "text",
    "Volume": 1520.0,
    "Unit": "sentences",
    "License": "MIT License",
    "HF Link": "https://hf.co/datasets/SaiedAlshahrani/ASAD",
    "Paper Link": "https://aclanthology.org/2023.arabicnlp-1.19.pdf",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Saied Alshahrani",
      "Norah Alshahrani",
      "Soumyabrata Dey",
      "Jeanna Matthews"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  },
  {
    "slug": "arabic_speech_corpus",
    "الاسم": "مجموعة الكلام العربي",
    "الاسم_الأصلي": "Arabic Speech Corpus",
    "درجة_الجودة": 75,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات صوتية للعربية الفصحى الحديثة تتألف من 1913 مقطعاً صوتياً (1813 للتدريب و100 للاختبار) بإجمالي 4.1 ساعة تقريباً، سُجّلت بلهجة دمشقية في استوديو احترافي بواسطة متحدث واحد. تتضمن نسخاً إملائية بنظام Buckwalter ونسخاً صوتية (فونيتية) وملفات TextGrid لتحديد حدود الفونيمات. المجموعة مصممة أساساً لتخليق الكلام العربي وتُعدّ من أوائل المجموعات المفتوحة المصدر في هذا المجال، لكنها محدودة الحجم (4 ساعات فقط) ومقتصرة على متحدث واحد بلهجة واحدة، والنصوص مكتوبة بنظام Buckwalter اللاتيني وليس بالخط العربي المباشر.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "direct_link",
      "عدد_العينات_المفحوصة": 30,
      "معاينة_العينات": [
        "\"ARA NORM 0002.wav\" \"waraj~aHa Alt~aqoriyru Al~a*iy >aEad~ahu maEohadu >aboHaA^i haDabapi Alt~ibiti fiy Alo>akaAdiymiy~api AlS~iyniy~api liloEuluwmi\"",
        "\"ARA NORM 0005.wav\" \"bayonahaA nahoraA yaluw wayaAnogotsiy - fiy AlS~iyno\" (phonetic: sil b a' y n a h aa n a' h r aa y a' l uu0 w a y aa n G t s ii0 sil f i0 SS II0' n sil)",
        "\"ARA NORM 0009.wav\" \"yaxotalifu AlohaAtifu Alz~akiy~u Eani AlohaAtifi Alt~aqoliydiy~i fiy >an~ahu yuqad~imu EadadAF mino waZaA}ifi AloHawosabapi AlomutaTaw~irapi\""
      ],
      "مشاكل_مكتشفة": [
        "النصوص مكتوبة بنظام Buckwalter اللاتيني وليس بالخط العربي، مما يصعّب القراءة المباشرة والاستخدام في بعض التطبيقات",
        "خطأ إملائي في اسم ملف النسخ الصوتية: phonetic-transcipt.txt بدلاً من phonetic-transcript.txt",
        "بعض ملفات lab في مجموعة الاختبار تحتوي علامات sil داخل النص بينما ملفات التدريب لا تحتويها، مما يشير لعدم اتساق في أسلوب التعليق بين المجموعتين",
        "اختلاف طفيف في كثافة علامات Buckwalter بين مجموعتي التدريب (0.514) والاختبار (0.418)، مما يعني اختلافاً في مستوى التشكيل",
        "فرق بسيط بين محتوى ملف lab الأول ونسخته الإملائية في كلمة واحدة (Al~aTHiy مقابل Al~a*iy)، قد يكون بسبب تحديث لاحق",
        "مجموعة البيانات مقتصرة على متحدث واحد، مما يحدّ من تنوع الأصوات"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "تسجيل احترافي في استوديو بجودة صوت عالية: 48000 هرتز، 16 بت، أحادي القناة",
      "تعليقات توضيحية متعددة المستويات: إملائية وصوتية وعلى مستوى الفونيم مع حدود زمنية في ملفات TextGrid",
      "لا يوجد تكرار في النصوص: جميع الـ 1813 نصاً فريدة",
      "تغطية صوتية مدروسة علمياً باستخدام طرق جشعة (greedy) لتحسين التغطية الصوتية مع تقليل حجم المجموعة",
      "تقسيم واضح لمجموعات التدريب والاختبار (1813/100)",
      "ترخيص مفتوح CC BY 4.0 يسمح بالاستخدام التجاري",
      "مدعومة بأطروحة دكتوراه من جامعة ساوثهامبتون تشرح المنهجية بالتفصيل",
      "متاحة للتحميل المباشر المجاني من الموقع الرسمي وعبر HuggingFace"
    ],
    "نقاط_الضعف": [
      "حجم صغير نسبياً: حوالي 4.1 ساعة فقط، وهو غير كافٍ لتدريب نماذج التعرف على الكلام الحديثة",
      "متحدث واحد فقط بلهجة دمشقية، مما يحدّ من تعميم النماذج المبنية عليها",
      "النصوص بنظام Buckwalter اللاتيني وليست بالخط العربي، مما يتطلب تحويلاً إضافياً",
      "عدم وجود نص عربي أصلي بالخط العربي ضمن البيانات",
      "عدم اتساق بسيط في بنية ملفات lab بين مجموعتي التدريب والاختبار (وجود علامات sil في بعض ملفات الاختبار)",
      "مكتبة datasets في HuggingFace لا تدعم التحميل مباشرة بسبب استخدام سكريبت قديم",
      "لم تُنشر في مجلة أو مؤتمر محكّم، بل هي جزء من أطروحة دكتوراه",
      "خطأ إملائي في اسم ملف النسخ الصوتية يدل على قصور في مراجعة الجودة"
    ],
    "الاستخدامات_الموصى_بها": [
      "تخليق الكلام بالعربية الفصحى الحديثة (TTS) — الاستخدام الأساسي المصمم لأجله",
      "تدريب نماذج تحويل النص إلى كلام أحادية المتحدث",
      "البحث في صوتيات العربية الفصحى وعلم الأصوات العربي",
      "التقسيم الصوتي والمحاذاة على مستوى الفونيم",
      "يمكن استخدامها كمجموعة بيانات تكميلية لتدريب نماذج التعرف على الكلام مع مجموعات أكبر",
      "تعليم ودراسة نظام Buckwalter للتحويل الصوتي العربي"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 70,
      "التوثيق": 80,
      "السلامة_الأخلاقية": 90,
      "الترخيص": 90,
      "قابلية_إعادة_الإنتاج": 75,
      "المراجعة_العلمية": 55,
      "جودة_البيانات": 72
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/halabi2016/arabic_speech_corpus",
      "http://en.arabicspeechcorpus.com/",
      "https://eprints.soton.ac.uk/409695/",
      "https://ota.bodleian.ox.ac.uk/repository/xmlui/bitstream/handle/20.500.12024/2561/arabic-speech-corpus-report.pdf?sequence=3",
      "http://en.arabicspeechcorpus.com/arabic-speech-corpus.zip"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2015,
    "Tasks": [
      "speech recognition"
    ],
    "Form": "audio",
    "Volume": 4.0,
    "Unit": "hours",
    "License": "CC BY 4.0",
    "HF Link": "https://hf.co/datasets/halabi2016/arabic_speech_corpus",
    "Paper Link": "https://ota.bodleian.ox.ac.uk/repository/xmlui/bitstream/handle/20.500.12024/2561/arabic-speech-corpus-report.pdf?sequence=3",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Nawar Halabi"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "preprint"
  },
  {
    "slug": "2m_belebele",
    "الاسم": "2M-BELEBELE",
    "الاسم_الأصلي": "2M-BELEBELE: Highly Multilingual Speech and American Sign Language Comprehension Dataset",
    "درجة_الجودة": 72,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات متعددة اللغات واسعة النطاق تمتد على 74 لغة منطوقة بالإضافة إلى لغة الإشارة الأمريكية، مبنية على مجموعات BELEBELE وFLEURS وFLORES-200. تتضمن أسئلة فهم قراءة متعددة الخيارات مقترنة ببيانات صوتية. الجزء العربي متاح فقط باللهجة المصرية (arz_Arab) وليس بالعربية الفصحى المعاصرة، وهو ما يتناقض مع الوصف الوارد في البيانات الوصفية الذي يشير إلى أن اللهجة هي العربية الفصحى. جودة النصوص العربية المصرية جيدة بشكل عام، والأسئلة مصاغة بشكل واضح مع إجابات منطقية، لكن البيانات الصوتية تجعل التحميل بطيئاً وتستهلك ذاكرة كبيرة.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 50,
      "معاينة_العينات": [
        "سؤال: حسب القطعة، إيه النصيحة اللي مش مظبوطة في طرق العزف على الأكورديون؟ | الفقرة: اتأكد أن ايدك مسترخية على قد ما تقدر واستمر في ضرب كل النغمات بطريقة صحيحة... | الإجابة الصحيحة: 1",
        "سؤال: لما تيجي تعزف على الأكورديون، إيه اللي ممكن يساعدك في رفع الصوت؟ | الخيارات: سرعة أكتر، قوة أكبر، اضغط بشويش، قلل حركة صوابعك | الإجابة الصحيحة: 1",
        "سؤال: ليه الصور مالهاش حواف على التلفزيون؟ | الفقرة: من المشاكل المنتشرة لما بتحاول تحويل فيلم إلى تنسيق DVD هو المسح الضوئي الزائد... | الإجابة الصحيحة: 2"
      ],
      "مشاكل_مكتشفة": [
        "البيانات الوصفية تشير إلى أن اللهجة هي العربية الفصحى (Modern Standard Arabic) لكن البيانات الفعلية باللهجة المصرية (arz_Arab) فقط",
        "لا يوجد إعداد للعربية الفصحى (arb_Arab) في مجموعة البيانات رغم ادعاء الوصف",
        "البيانات الصوتية كبيرة الحجم مما يسبب مشاكل في الذاكرة عند التحميل الكامل",
        "لا يوجد سوى تقسيم اختبار (test) واحد دون تقسيمات تدريب أو تحقق",
        "بعض النصوص تحتوي على أخطاء طفيفة في الترجمة مثل عبارة 'سبحان الله' في سياق غير مناسب عن الصين القديمة",
        "توزيع الإجابات الصحيحة في أول 50 عينة غير متوازن تماماً (1:9، 2:16، 3:17، 4:8)"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "تغطية لغوية واسعة جداً تشمل 74 لغة منطوقة ولغة الإشارة الأمريكية",
      "بنية بيانات غنية تتضمن الفقرة المصدر والسؤال والإجابات المتعددة والبيانات الصوتية",
      "النصوص العربية المصرية مكتوبة بشكل طبيعي وسلس مع أسئلة فهم واضحة",
      "كل عينة مرتبطة بمقطع صوتي مطابق (100% من العينات المفحوصة لديها صوت مطابق)",
      "مبنية على مشاريع مرجعية موثوقة (FLORES-200 وFLEURS وBELEBELE)",
      "ترخيص مفتوح (CC BY-SA 4.0) يسمح بالاستخدام التجاري",
      "الأسئلة تتطلب فهماً حقيقياً للنص وليست سطحية"
    ],
    "نقاط_الضعف": [
      "غياب العربية الفصحى المعاصرة (arb_Arab) من مجموعة البيانات رغم ادعاء البيانات الوصفية",
      "حجم البيانات صغير نسبياً (حوالي 900 سؤال لكل لغة) مما يحد من استخدامها في التدريب",
      "لا يوجد سوى تقسيم اختبار واحد دون بيانات تدريب أو تحقق",
      "مشاكل تقنية في التحميل بسبب حجم البيانات الصوتية الكبير",
      "الورقة البحثية منشورة كمسودة أولية (preprint) على arXiv ولم تخضع لمراجعة أقران كاملة",
      "توزيع الإجابات الصحيحة غير متوازن في العينات المفحوصة",
      "بعض الترجمات تحتوي على عبارات غير مناسبة للسياق"
    ],
    "الاستخدامات_الموصى_بها": [
      "تقييم نماذج فهم الكلام المنطوق باللهجة العربية المصرية",
      "اختبار قدرات نماذج اللغة في فهم القراءة متعدد الخيارات",
      "البحث في مجال معالجة اللغات المنطوقة متعددة اللغات",
      "المقارنة بين أداء الفهم القرائي والفهم السمعي عبر اللغات",
      "تقييم أداء نماذج التعرف على الكلام في سياقات فهم النصوص"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 60,
      "التوثيق": 70,
      "السلامة_الأخلاقية": 85,
      "الترخيص": 90,
      "قابلية_إعادة_الإنتاج": 70,
      "المراجعة_العلمية": 55,
      "جودة_البيانات": 72
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/facebook/2M-Belebele",
      "https://arxiv.org/abs/2412.08274",
      "https://github.com/facebookresearch/belebele"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2024,
    "Tasks": [
      "speech recognition"
    ],
    "Form": "audio",
    "Volume": 2000.0,
    "Unit": "sentences",
    "License": "CC BY-SA 4.0",
    "HF Link": "https://huggingface.co/datasets/facebook/2M-Belebele",
    "Paper Link": "https://arxiv.org/pdf/2412.08274",
    "Domain": [
      "public datasets"
    ],
    "Authors": [
      "Marta R. Costa-jussà",
      "Bokai Yu",
      "Pierre Andrews",
      "Belen Alastruey",
      "Necati Cihan Camgoz",
      "Joe Chuang",
      "Jean Maillard",
      "Christophe Ropers",
      "Arina Turkantenko",
      "Carleigh Wood"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "preprint"
  },
  {
    "slug": "apcd2",
    "الاسم": "مجموعة بيانات الشعر العربي الشاملة - الإصدار الثاني",
    "الاسم_الأصلي": "APCD2 (Arabic Poem Comprehensive Dataset v2)",
    "درجة_الجودة": 72,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات ضخمة تحتوي على حوالي 1.66 مليون بيت شعري عربي مصنّف حسب البحور الشعرية الستة عشر بالإضافة إلى النثر (17 تصنيفاً). البيانات مُشكّلة جزئياً (حوالي 83% من العينات تحتوي على تشكيل) وتتميز بنصوص عربية سليمة وخالية من الأحرف الأجنبية. تعاني المجموعة من عدم توازن واضح في توزيع البحور حيث يهيمن بحرا الطويل والكامل، كما أن بعض البحور النادرة كالمقتضب والمضارع شبه غائبة. نُشرت مع ورقة بحثية في مجلة جامعة الملك سعود لعلوم الحاسب والمعلومات وحققت دقة تصنيف 97.27%، مما يجعلها مرجعاً مهماً لأبحاث تصنيف الشعر العربي وتشكيله.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 1000,
      "معاينة_العينات": [
        "افتَرَسَتها الخُطُوبُ فافتَرَعَت وَغَيَّرَت رَوض حُسنِها الغِيَر | التصنيف: 12 (المنسرح)",
        "السُحُرُ يَعبد لَحظُهُ وَالظَرف يَخ دم لَفظَهُ بِغَرائب الأَنباءِ | التصنيف: 14 (الكامل)",
        "فَزَزُّوهُ مِن وَقتِ الصَّباحِ إِلى المَسا وَناكوهُ مِن وَقتِ المَساءِ إِلى الصُّبحِ | التصنيف: 3 (الطويل)"
      ],
      "مشاكل_مكتشفة": [
        "عدم توازن حاد في توزيع البحور: الطويل 23.4% والكامل 21.1% بينما المضارع 0.1% فقط",
        "التصنيف 9 (المقتضب) غائب تماماً في أول 1000 عينة رغم وجوده في قائمة التصنيفات",
        "بعض الأبيات تحتوي على فصل كلمات غير طبيعي مثل 'يَخ دم' بدلاً من 'يَخدم' و'ملي ك' بدلاً من 'مليك'",
        "التشكيل غير متسق: 83% من العينات مُشكّلة و17% بدون تشكيل، دون تمييز واضح بين النوعين",
        "لا يوجد تقسيم اختبار منفصل في نسخة HuggingFace رغم أن GitHub يوفر ملفات تدريب واختبار منفصلة",
        "الترخيص غير محدد مما يخلق غموضاً في إمكانية الاستخدام التجاري"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "حجم ضخم يتجاوز 1.66 مليون بيت شعري، وهو من أكبر مجموعات البيانات في هذا المجال",
      "النصوص العربية سليمة وصحيحة لغوياً في جميع العينات المفحوصة (1000 عينة)",
      "لا يوجد أي تكرار في العينات المفحوصة (1000 عينة فريدة بالكامل)",
      "لا توجد أحرف أجنبية أو رموز مشوهة في أي من العينات",
      "نسبة عالية من الأبيات المُشكّلة (حوالي 83%) مما يفيد في أبحاث التشكيل",
      "تغطية شاملة لـ 16 بحراً شعرياً بالإضافة إلى النثر",
      "أطوال الأبيات متسقة مع طبيعة البحور الشعرية (الطويل أطول من الهزج مثلاً)",
      "مدعومة بورقة بحثية محكّمة في مجلة علمية معتمدة",
      "متاحة على منصتي HuggingFace وGitHub مما يسهل الوصول إليها"
    ],
    "نقاط_الضعف": [
      "عدم توازن شديد في توزيع البحور يؤثر على أداء النماذج مع البحور النادرة",
      "فصل الكلمات في بعض الأبيات بشكل غير طبيعي (تقطيع عروضي مُدرج في النص)",
      "الترخيص غير محدد مما يعيق الاستخدام التجاري والأكاديمي",
      "التشكيل غير متسق عبر المجموعة بدون حقل يميز النصوص المُشكّلة من غيرها",
      "البيانات بسيطة البنية (حقلان فقط: النص والتصنيف) بدون بيانات وصفية إضافية كاسم الشاعر أو العصر",
      "نسخة HuggingFace تفتقد لتقسيم التدريب/الاختبار الموجود في GitHub",
      "لا توجد بطاقة بيانات تفصيلية على HuggingFace تشرح منهجية الجمع والتوثيق"
    ],
    "الاستخدامات_الموصى_بها": [
      "تصنيف البحور الشعرية العربية باستخدام التعلم العميق",
      "تدريب نماذج التشكيل التلقائي للنصوص العربية خاصة الشعر",
      "دراسة الأنماط اللغوية والإيقاعية في الشعر العربي الكلاسيكي",
      "بناء أنظمة توليد الشعر العربي المقيد بالبحر",
      "أبحاث معالجة اللغة العربية الكلاسيكية وتحليل النصوص الأدبية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 85,
      "التوثيق": 55,
      "السلامة_الأخلاقية": 90,
      "الترخيص": 25,
      "قابلية_إعادة_الإنتاج": 70,
      "المراجعة_العلمية": 80,
      "جودة_البيانات": 72
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/APCDv2",
      "https://github.com/Gheith-Abandah/classify-arabic-poetry",
      "https://www.sciencedirect.com/science/article/pii/S1319157820305784"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2020,
    "Tasks": [
      "meter classification"
    ],
    "Form": "text",
    "Volume": 1831770.0,
    "Unit": "sentences",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/arbml/APCDv2",
    "Paper Link": "https://www.sciencedirect.com/science/article/pii/S1319157820305784/pdfft?md5=07be922e052bf43933bdb7bea5189718&pid=1-s2.0-S1319157820305784-main.pdf",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Gheith A. Abandah",
      "Mohammed Z. Khedher",
      "Mohammad R. Abdel-Majeed",
      "Hamdi M Mansour",
      "Salma F Hulliel",
      "Lara M Bisharata"
    ],
    "Dialect": "Classical Arabic",
    "Access": "Free",
    "Venue Type": "journal"
  },
  {
    "slug": "apcd",
    "الاسم": "مجموعة بيانات الشعر العربي الكلاسيكي",
    "الاسم_الأصلي": "APCD - Arabic Poetry Classical Dataset",
    "درجة_الجودة": 72,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات ضخمة للشعر العربي الكلاسيكي تحتوي على أكثر من 1.8 مليون بيت شعري مصنّف حسب البحر الشعري والعصر والشاعر والقافية. تم جمعها عبر الزحف من مواقع أدبية عربية مثل الموسوعة الشعرية والديوان، وتُستخدم أساساً في تصنيف البحور الشعرية آلياً. النصوص العربية سليمة ومشكّلة بشكل جيد في معظمها، لكن توجد مشاكل محدودة مثل قيم مفقودة في حقل الشطر الأول لبعض الأبيات وعدم اتساق في التشكيل بين الأبيات. تُعدّ من أكبر مجموعات بيانات الشعر العربي المتاحة مجاناً.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 5000,
      "معاينة_العينات": [
        "{'era': 'قبل الإسلام', 'poet': 'عمرو بنِ قُمَيئَة', 'meter': 'الطويل', 'bayt': 'خَليلَيَّ لا تَستَعجِلا أَن تَزَوَّدا    وَأَن تَجمَعا شَملي وَتَنتَظِرا غَدا'}",
        "{'era': 'العباسي', 'poet': 'المُتَنَبّي', 'meter': 'البسيط', 'bayt': 'ما أَوجُهُ الحَضَرِ المُستَحسَناتُ بِهِ    كَأَوجُهِ البَدَوِيّاتِ الرَعابيبِ'}",
        "{'era': 'العباسي', 'poet': 'المُتَنَبّي', 'meter': 'الطويل', 'bayt': 'هُوَ البَينُ حَتّى ما تَأَنّى الحَزائِقُ    وَيا قَلبِ حَتّى أَنتَ مِمَّن أُفارِقُ'}"
      ],
      "مشاكل_مكتشفة": [
        "وجود 20 حالة من أصل 5000 (0.4%) حيث حقل الشطر الأول يحتوي على قيمة nan بدلاً من النص، وهي أبيات مشطورة (شطر واحد فقط)",
        "عدم اتساق التشكيل بين الأبيات كما أشار المؤلفون أنفسهم - بعض الأبيات مشكّلة بالكامل وبعضها جزئياً أو بدون تشكيل",
        "في أول 5000 سجل ظهرت 11 بحراً فقط من أصل 16 بحراً، مما يشير إلى عدم توازن في توزيع البحور",
        "تنوع محدود في الشعراء ضمن أول 5000 سجل (4 شعراء فقط)، مما يدل على أن البيانات مرتبة حسب الشاعر وليست مخلوطة عشوائياً",
        "الترخيص غير محدد مما يثير قلقاً حول حقوق الاستخدام"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "حجم ضخم جداً يتجاوز 1.8 مليون بيت شعري، مما يجعلها من أكبر مجموعات بيانات الشعر العربي",
      "بنية منظمة وواضحة مع حقول مفيدة: البحر، العصر، الشاعر، الديوان، القافية، الشطر الأول، الشطر الثاني، البيت الكامل",
      "النصوص العربية سليمة لغوياً ومشكّلة في معظم الأبيات المفحوصة",
      "نسبة التكرار منخفضة جداً (بيت واحد مكرر من أصل 5000 عينة)",
      "لا توجد حقول فارغة تماماً - جميع الحقول الأساسية ممتلئة باستثناء حالات الشطر الأول في الأبيات المشطورة",
      "متاحة مجاناً عبر HuggingFace بصيغة Parquet سهلة الاستخدام",
      "تغطي فترات زمنية متعددة من الشعر العربي (من الجاهلية إلى العصر الحديث)"
    ],
    "نقاط_الضعف": [
      "الترخيص غير محدد مما يجعل الاستخدام التجاري غير واضح الشرعية",
      "عدم اتساق التشكيل بين الأبيات يقلل من فائدتها في مهام تعتمد على التشكيل",
      "وجود قيم nan في حقل الشطر الأول لبعض الأبيات المشطورة دون معالجة واضحة",
      "الورقة البحثية منشورة كمسودة على arXiv فقط ولم تخضع لمراجعة الأقران في مجلة أو مؤتمر محكّم",
      "لا يوجد تقسيم للبيانات إلى مجموعات تدريب واختبار وتحقق",
      "البيانات مرتبة حسب الشاعر وليست مخلوطة عشوائياً، مما قد يؤثر على التدريب إذا لم يتم خلطها",
      "التوثيق محدود على صفحة HuggingFace ولا يتضمن تفاصيل كافية عن عملية التنظيف والتحقق"
    ],
    "الاستخدامات_الموصى_بها": [
      "تصنيف البحور الشعرية العربية آلياً باستخدام التعلم العميق",
      "توليد الشعر العربي الكلاسيكي باستخدام نماذج اللغة",
      "دراسات لسانية حاسوبية عن خصائص الشعر العربي وتطوره عبر العصور",
      "بناء أنظمة استرجاع المعلومات والبحث في النصوص الشعرية",
      "تحليل الأنماط الأسلوبية للشعراء العرب عبر مختلف العصور الأدبية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 90,
      "التوثيق": 55,
      "السلامة_الأخلاقية": 85,
      "الترخيص": 30,
      "قابلية_إعادة_الإنتاج": 60,
      "المراجعة_العلمية": 40,
      "جودة_البيانات": 75
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/APCD",
      "https://hci-lab.github.io/LearningMetersPoems/",
      "https://arxiv.org/abs/1905.05700"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2019,
    "Tasks": [
      "meter classification"
    ],
    "Form": "text",
    "Volume": 1831770.0,
    "Unit": "sentences",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/arbml/APCD",
    "Paper Link": "https://arxiv.org/pdf/1905.05700.pdf",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Waleed A. Yousefa",
      "Omar M. Ibrahime",
      "Taha M. Madboulya",
      "Moustafa A. Mahmoud"
    ],
    "Dialect": "Classical Arabic",
    "Access": "Free",
    "Venue Type": "preprint"
  },
  {
    "slug": "arabic_ala_lc__romanization",
    "الاسم": "الرومنة العربية وفق معيار ALA-LC",
    "الاسم_الأصلي": "Arabic ALA LC Romanization",
    "درجة_الجودة": 72,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات متوازية تضم حوالي 600 ألف إدخال ببليوغرافي عربي مع مقابلاتها المرومنة وفق معيار جمعية المكتبات الأمريكية ومكتبة الكونغرس (ALA-LC). جُمعت البيانات من سجلات فهارس مكتبات جامعية أمريكية بتنسيق MARC، وتُستخدم لتدريب نماذج الرومنة التلقائية للنصوص العربية غير المشكّلة. النصوص العربية في مجملها سليمة ومقروءة، لكن يوجد نسبة تكرار ملحوظة في الإدخالات المتكررة طبيعياً مثل أسماء دور النشر وأرقام الطبعات، كما أن بعض حقول النص العربي تحتوي على نصوص لاتينية بدلاً من العربية. البيانات مناسبة لمهام الترجمة الحرفية والرومنة التلقائية وهي الأولى من نوعها في هذا المجال.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 5000,
      "معاينة_العينات": [
        "sentID: 7 | ar: طوسى، نصىر الدىن محمد بن محمد، | rom: Ṭūsī, Naṣīr al-Dīn Muḥammad ibn Muḥammad, | tag: 100 | source: umich",
        "sentID: 8 | ar: الرساله المعىنية / | rom: al-Risālah al-muʻīnīyah / | tag: 245 | source: umich",
        "sentID: 14 | ar: الحديد والصلب قاعدة الصناعات الثقيلة. | rom: al-Ḥadīd wa-al-ṣulb qāʻidat al-ṣināʻāt al-thaqīlah | tag: 245 | source: umich"
      ],
      "مشاكل_مكتشفة": [
        "نسبة تكرار عالية: حوالي 32% من العينات المفحوصة (1624 من 5000) تنتمي لأزواج مكررة، خاصة إدخالات مثل 'الطبعة 1.' التي تكررت 445 مرة",
        "بعض حقول النص العربي (ar) تحتوي على نصوص لاتينية بدلاً من عربية (35 حالة من 5000)، مثل: 'Maṭbaʻat al-Yarmūk' و's. n.]'",
        "اختلافات طفيفة بين حقلي ar وar_raw تتعلق بالمسافات وعلامات الترقيم (5 حالات من 5000)",
        "النص العربي في بعض الإدخالات يستخدم رسماً قديماً مثل 'نصىر الدىن' بدلاً من 'نصير الدين' مع الياء بدون نقط",
        "جميع العينات المفحوصة (20000) كانت من مصدر واحد (umich) رغم أن الورقة تذكر 3 مصادر"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "مجموعة بيانات فريدة من نوعها: أول مجموعة بيانات متوازية عربية-رومنة للإدخالات الببليوغرافية",
      "حجم كبير يبلغ حوالي 600 ألف إدخال مما يوفر بيانات كافية للتدريب والتقييم",
      "بنية منظمة بحقول بيانات وصفية غنية تشمل معرّفات الجمل والسجلات والعلامات والمصادر",
      "تقسيم واضح إلى مجموعات تدريب (480 ألف) وتحقق (60 ألف) واختبار (59800)",
      "النصوص العربية في معظمها سليمة نحوياً ومقروءة بوضوح",
      "مدعومة بورقة بحثية محكّمة نُشرت في ورشة عمل WANLP المرموقة",
      "متاحة مجاناً على كل من GitHub وHugging Face مما يسهل الوصول إليها"
    ],
    "نقاط_الضعف": [
      "نسبة التكرار مرتفعة بشكل ملحوظ خاصة في الإدخالات الشائعة كأسماء دور النشر وأرقام الطبعات",
      "بعض حقول النص العربي تحتوي على نصوص لاتينية مما يمثل تلوثاً في البيانات",
      "الترخيص غير محدد (unknown) مما يعيق الاستخدام التجاري والأكاديمي",
      "النطاق محصور في الإدخالات الببليوغرافية فقط مما يحد من قابلية التعميم على نصوص عربية أخرى",
      "الرسم الإملائي العربي في بعض الإدخالات قديم أو غير معياري (مثل الياء بدون نقط)",
      "في العينات المفحوصة على HuggingFace ظهر مصدر واحد فقط (umich) رغم ذكر 3 مصادر في الورقة"
    ],
    "الاستخدامات_الموصى_بها": [
      "تدريب نماذج الرومنة التلقائية للنصوص العربية وفق معيار ALA-LC",
      "بناء أنظمة الترجمة الحرفية بين العربية واللاتينية",
      "تطوير أدوات مساعدة لأمناء المكتبات في فهرسة الكتب العربية",
      "دراسة التحويل الصوتي والصرفي للأسماء العربية إلى اللاتينية",
      "تدريب نماذج تسلسل إلى تسلسل (Seq2Seq) لمهام التحويل النصي"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 90,
      "التوثيق": 70,
      "السلامة_الأخلاقية": 90,
      "الترخيص": 30,
      "قابلية_إعادة_الإنتاج": 75,
      "المراجعة_العلمية": 75,
      "جودة_البيانات": 65
    },
    "المصادر_المفتوحة": [
      "https://hf.co/datasets/arbml/ALA_LC_Romanization",
      "https://github.com/CAMeL-Lab/Arabic_ALA-LC_Romanization",
      "https://aclanthology.org/2021.wanlp-1.23/",
      "https://aclanthology.org/2021.wanlp-1.23.pdf"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2021,
    "Tasks": [
      "machine translation"
    ],
    "Form": "text",
    "Volume": 107439.0,
    "Unit": "sentences",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/arbml/ALA_LC_Romanization",
    "Paper Link": "https://aclanthology.org/2021.wanlp-1.23.pdf",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Fadhl Eryani",
      "Nizar Habash"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "workshop"
  },
  {
    "slug": "arabic_common_voice",
    "الاسم": "الصوت المشترك العربي",
    "الاسم_الأصلي": "Arabic Common Voice",
    "درجة_الجودة": 72,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات صوتية مفتوحة المصدر من مشروع Common Voice التابع لموزيلا، تحتوي على حوالي 85 ساعة من التسجيلات الصوتية العربية المُتحقق منها عبر التعهيد الجماعي. تتضمن المجموعة أكثر من 43,000 عينة مُصدّق عليها مع نصوصها المكتوبة، وتُستخدم أساساً لتدريب أنظمة التعرف التلقائي على الكلام. الجمل العربية سليمة لغوياً في معظمها ومتنوعة الموضوعات، لكن لوحظت بعض مشاكل في اتجاه الكتابة (علامات الترقيم في بداية الجملة بدلاً من نهايتها) وقلة تنوع المتحدثين في بعض الأقسام، مع غياب شبه تام لمعلومات اللهجة.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 500,
      "معاينة_العينات": [
        "{'sentence': 'محصول الطماطم جودته عالية.', 'up_votes': 2, 'down_votes': 1, 'age': 'twenties', 'gender': 'male_masculine', 'locale': 'ar'}",
        "{'sentence': 'يمكنني أن أقفز.', 'up_votes': 2, 'down_votes': 0, 'age': 'twenties', 'gender': 'male_masculine', 'locale': 'ar'}",
        "{'sentence': '.كان ذلك صعب التصديق', 'up_votes': 2, 'down_votes': 0, 'age': 'twenties', 'gender': 'male_masculine', 'locale': 'ar'}"
      ],
      "مشاكل_مكتشفة": [
        "وجود 8 جمل من أصل 500 (1.6%) تبدأ بعلامة ترقيم في البداية بدلاً من النهاية، مما يشير إلى خلل في معالجة اتجاه النص من اليمين لليسار (مثل: '.كان ذلك صعب التصديق' و '.ستمطر الليلة')",
        "قلة تنوع المتحدثين: في أول 500 عينة تدريبية، لم يُرصد سوى 5 متحدثين فريدين فقط، مما يعني تركيز عالٍ على عدد محدود من الأصوات",
        "غياب تام لمعلومات اللهجة (حقل accent فارغ في 100% من العينات المفحوصة)",
        "21.8% من العينات تفتقر لمعلومات الجنس والعمر (حقول فارغة)",
        "عدم توازن واضح بين الجنسين: 58.4% ذكور مقابل 19.8% إناث و21.8% غير محدد",
        "الجمل قصيرة نسبياً ومترجمة في كثير منها وليست من نصوص عربية أصيلة (مثل: 'أريد أن أذهب إلى اليابان' و 'أين رأيت نانسي؟')"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "النصوص العربية سليمة نحوياً وإملائياً في الغالبية العظمى من العينات المفحوصة",
      "نظام تصويت جماعي للتحقق من جودة التسجيلات (up_votes و down_votes)، ولم تُلاحظ أي عينة ذات أصوات سلبية أكثر من الإيجابية في العينات المفحوصة",
      "لا توجد جمل فارغة أو مكررة في العينات الـ 500 المفحوصة",
      "تقسيم واضح للبيانات إلى مجموعات تدريب واختبار وتحقق (14,227 و 7,622 و 7,517 عينة على التوالي)",
      "ترخيص CC0 مفتوح بالكامل يسمح بالاستخدام التجاري والبحثي دون قيود",
      "تنوع جيد في موضوعات الجمل: أسئلة، أوامر، جمل وصفية، جمل خبرية",
      "مشروع مدعوم مؤسسياً من موزيلا مع استمرارية في التطوير والإصدارات"
    ],
    "نقاط_الضعف": [
      "مشاكل في اتجاه الكتابة العربية: بعض الجمل تبدأ بنقطة بسبب خلل في معالجة RTL",
      "تركيز عالٍ على عدد محدود من المتحدثين في أقسام معينة (5 متحدثين فقط في أول 500 عينة تدريبية)",
      "غياب تام لمعلومات اللهجات العربية رغم أن الحقل موجود في البيانات",
      "نقص في البيانات الديموغرافية: 21.8% من العينات بدون معلومات جنس أو عمر",
      "عدم توازن واضح بين الجنسين في التسجيلات",
      "الوصول للنسخة الأصلية يتطلب مصادقة (gated dataset) مما يحد من سهولة الوصول المباشر",
      "كثير من الجمل تبدو مترجمة من لغات أخرى وليست نصوصاً عربية أصيلة",
      "حجم البيانات العربية (85 ساعة مُتحقق منها) محدود نسبياً مقارنة باللغات الرئيسية في المشروع",
      "الورقة البحثية لا تتضمن تجارب أو نتائج خاصة بالعربية"
    ],
    "الاستخدامات_الموصى_بها": [
      "تدريب نماذج التعرف التلقائي على الكلام العربي (ASR) كنقطة انطلاق أو للتعلم بالنقل",
      "تطوير وتقييم أنظمة تحويل الكلام إلى نص للعربية الفصحى الحديثة",
      "أبحاث معالجة الإشارات الصوتية وتحديد هوية اللغة",
      "تدريب نماذج تحويل النص إلى كلام (TTS) مع الحاجة لتصفية إضافية",
      "قياس الأداء المقارن (benchmarking) لأنظمة الكلام العربية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 55,
      "التوثيق": 70,
      "السلامة_الأخلاقية": 85,
      "الترخيص": 95,
      "قابلية_إعادة_الإنتاج": 75,
      "المراجعة_العلمية": 75,
      "جودة_البيانات": 65
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/legacy-datasets/common_voice",
      "https://huggingface.co/datasets/MohamedRashad/common-voice-18-arabic",
      "https://arxiv.org/abs/1912.06670",
      "https://huggingface.co/api/datasets/legacy-datasets/common_voice",
      "https://datacollective.mozillafoundation.org/datasets?q=common+voice",
      "https://commonvoice.mozilla.org/en/datasets"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2020,
    "Tasks": [
      "speech recognition"
    ],
    "Form": "audio",
    "Volume": 85.0,
    "Unit": "hours",
    "License": "CC0",
    "HF Link": "https://hf.co/datasets/legacy-datasets/common_voice",
    "Paper Link": "https://arxiv.org/pdf/1912.06670.pdf",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Rosana Ardila",
      "Megan Branson",
      "Kelly Davis",
      "Michael Henretty",
      "Michael Kohler",
      "Josh Meyer",
      "Reuben Morais",
      "Lindsay Saunders",
      "Francis M. Tyers",
      "Gregor Weber"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Upon-Request",
    "Venue Type": "conference"
  },
  {
    "slug": "arabic_img2md",
    "الاسم": "arabic-img2md",
    "الاسم_الأصلي": "arabic-img2md",
    "درجة_الجودة": 72,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات تضم حوالي 15,200 زوج من صور صفحات كتب عربية مع نصوصها المقابلة بصيغة Markdown، مصممة لتدريب نماذج التعرف الضوئي على الحروف العربية. تم إنشاؤها عبر جمع محتوى HTML من موقع هنداوي للنشر وتحويله إلى ملفات PDF ثم استخراج نص Markdown. النصوص العربية في العينات المفحوصة سليمة لغوياً ومتنوعة المحتوى تشمل الأدب والشعر والدين والتاريخ والنقد، مع وجود تشكيل في كثير من النصوص. تعد هذه المجموعة مورداً قيماً لأبحاث التعرف الضوئي على النصوص العربية رغم اقتصار مصدرها على ناشر واحد.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 100,
      "معاينة_العينات": [
        "image: صورة RGB بحجم (1400, 1867) | markdown: ثُمَّ جَلَسَ لِيُرَاقِبَ زَوْجَةَ بوب وايت وَهِيَ تَلْتَقِطُ فَرَاشَاتِ الْمَلْفُوفِ الْبَيْضَاءَ الَّتِي يَعْلَمُ أَنَّهَا سَتَبِيضُ وَسَيَخْرُجُ مِنَ الْبَيْضِ دِيدَانٌ؛ وَمِنْ ثَمَّ يَفْسُدُ الْمَلْفُوفُ...",
        "image: صورة RGB بحجم (1400, 1867) | markdown: #### الفصل الثاني * Aldrich, JohnH. WhyParties? TheOrigin and Transformation of Political Parties in America. Chicago: University of Chicago Press, 1995...",
        "image: صورة RGB بحجم (1400, 1867) | markdown: أخيرًا بعد عشر ساعات أو يزيد دخلنا «بفلو»، وهي من كبريات المدن مظهرها صناعي بحت، وهنا غيَّرنا القطار فسرنا إزاء نهر نياجرا الذي يفوق نيلنا اتساعًا..."
      ],
      "مشاكل_مكتشفة": [
        "اقتصار المصدر على ناشر واحد فقط (هنداوي) مما يحد من تنوع الأنماط البصرية والتخطيطات",
        "نسبة قليلة فقط من العينات (21%) تحتوي على تنسيق Markdown فعلي مثل العناوين والقوائم، بينما الأغلبية نص عادي",
        "بعض المراجع الإنجليزية في العينات تفتقر للمسافات بين الكلمات مثل: WhyParties? TheOrigin",
        "البيانات مولّدة اصطناعياً من تحويل HTML إلى PDF ثم Markdown وليست من مسح ضوئي حقيقي لكتب مطبوعة",
        "لا توجد إجراءات مراقبة جودة أو تحقق يدوي موثقة في الورقة البحثية"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "النصوص العربية سليمة لغوياً وواضحة مع وجود تشكيل دقيق في كثير من العينات",
      "تنوع جيد في المحتوى: أدب وشعر ودين وتاريخ ونقد أدبي ومراجع أكاديمية",
      "أحجام الصور متسقة ومناسبة للتدريب (1240-1400 عرض × 1650-1867 ارتفاع)",
      "متاحة مجاناً على HuggingFace بصيغة Parquet مع دعم التحميل المتدفق",
      "مصحوبة بورقة بحثية ونماذج مدربة وشفرة مصدرية مفتوحة",
      "تقسيم واضح إلى مجموعة تدريب (13,700) واختبار (1,520)",
      "حجم مناسب للمهمة المستهدفة مع نتائج تقييم كمية مقدمة في الورقة"
    ],
    "نقاط_الضعف": [
      "مصدر واحد فقط (هنداوي) مما يحد من قابلية التعميم على وثائق عربية أخرى",
      "البيانات اصطناعية وليست من مسح ضوئي حقيقي، مما قد يقلل فعاليتها مع الوثائق الممسوحة فعلياً",
      "غياب إجراءات مراقبة الجودة والتحقق اليدوي الموثقة",
      "أغلب العينات نص عادي دون تنسيق Markdown غني، رغم أن اسم المجموعة يشير إلى img2md",
      "الورقة البحثية منشورة كـ preprint على arXiv فقط ولم تخضع لمراجعة أقران رسمية",
      "مشاكل في التصاق الكلمات الإنجليزية ببعضها في بعض العينات",
      "ترخيص GPL-3.0 قد يكون مقيداً لبعض الاستخدامات التجارية"
    ],
    "الاستخدامات_الموصى_بها": [
      "تدريب نماذج التعرف الضوئي على الحروف العربية وضبطها الدقيق",
      "تطوير أنظمة تحويل صور الوثائق العربية إلى نصوص منسقة بصيغة Markdown",
      "البحث الأكاديمي في مجال معالجة الوثائق العربية ومحولات الرؤية",
      "إنشاء خطوط أساس لتقييم أداء نماذج OCR العربية",
      "استخراج النصوص من الكتب العربية الرقمية ذات التخطيط المشابه لكتب هنداوي"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 90,
      "التوثيق": 60,
      "السلامة_الأخلاقية": 80,
      "الترخيص": 65,
      "قابلية_إعادة_الإنتاج": 75,
      "المراجعة_العلمية": 45,
      "جودة_البيانات": 70
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/MohamedRashad/arabic-img2md",
      "https://arxiv.org/abs/2411.17835",
      "https://arxiv.org/html/2411.17835"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2024,
    "Tasks": [
      "optical character recognition"
    ],
    "Form": "images",
    "Volume": 15216.0,
    "Unit": "images",
    "License": "GPL-3.0",
    "HF Link": "https://huggingface.co/datasets/MohamedRashad/arabic-img2md",
    "Paper Link": "https://arxiv.org/pdf/2411.17835",
    "Domain": [
      "books"
    ],
    "Authors": [
      "Mohamed A. Rashad"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "preprint"
  },
  {
    "slug": "arabic_punctuation_dataset",
    "الاسم": "مجموعة بيانات علامات الترقيم العربية",
    "الاسم_الأصلي": "Arabic Punctuation Dataset (APD)",
    "درجة_الجودة": 72,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات كبيرة ومتخصصة في علامات الترقيم للغة العربية الفصحى الحديثة، تتألف من ثلاثة مكونات: فصول كتب مُعلَّمة يدوياً (ABC)، وترجمات كتب كاملة من الإنجليزية إلى العربية (CBT)، وجمل مُشوَّشة من مدوَّنة الأمم المتحدة المتوازية (SSAC-UNPC). تحتوي على نحو 312 مليون كلمة في 12 مليون جملة تقريباً، وتعتمد على مبدأ 'المُسنَد والمُسنَد إليه' النحوي لتحديد حدود الجمل. جودة النصوص العربية المفحوصة من مكون CBT عالية جداً مع تشكيل جزئي دقيق، لكن الوصول الكامل إلى جميع المكونات الثلاثة عبر HuggingFace غير متاح حالياً مما يُضعف سهولة الاستخدام.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 100,
      "معاينة_العينات": [
        "لؤلؤة الحب — أفصَحَ الواعظُ قائلًا إن اللؤلؤ أبهى مِن أشدِّ الأحجار البَلُّورية لمعانًا؛ إذ يُخلق من رحمِ معاناةٍ يلقاها مخلوقٌ حي. لا يَسعني التعليق على ذلك الأمر لأنني لا أَستشعِر شيئًا من سحرِ اللؤلؤ...",
        "يعقوب بن زبدي — ممالك العالم — في يومٍ من أيام الربيع وقف يسوع في ساحة المدينة في أورشليم وشرَع يُخاطِب الجموع عن ملكوت السماء. فاتَّهم الكَتَبة والفريسيين بإقامتهم فِخاخًا وحفْرِهم حُفَرًا...",
        "بيلاطس البُنطي — في الطقوس والخُرافات الشرقيَّة — قد حدَّثتْني امرأتي عنه غير مرَّةٍ قبل أن أحضروه إليَّ، ولكنَّني لم أهتم للأمر. إن امرأتي كثيرة الأحلام..."
      ],
      "مشاكل_مكتشفة": [
        "مجموعتان من أصل ثلاث (ABC وSSAC_UNPC) غير متاحتين عبر HuggingFace — تُرجع خطأ 401 عند محاولة الوصول",
        "المكون المتاح (CBT) يحتوي على 1,089 وثيقة فقط وهو جزء صغير من إجمالي 12 مليون جملة المُعلن عنها",
        "البيانات على HuggingFace تحتوي حقلاً واحداً فقط (Document) — نصوص كاملة دون تقسيم إلى جمل أو تعليقات ترقيم منفصلة، مما يتطلب معالجة إضافية لاستخراج الجمل",
        "لا يوجد تقسيم اختبار (test split) في البيانات المتاحة",
        "عناوين الفصول وأسماء المؤلفين مدمجة داخل النص دون فصل واضح عن المحتوى الرئيسي",
        "مكون CBT يعتمد بشكل أساسي على نصوص أدبية مترجمة من الإنجليزية، مما قد يجعل أنماط الترقيم متأثرة بقواعد الإنجليزية وليس العربية الأصيلة",
        "لا توجد بيانات وصفية (metadata card) على صفحة HuggingFace لمجموعة CBT"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "نصوص عربية فصحى عالية الجودة مع تشكيل جزئي دقيق ولغة سليمة نحوياً وإملائياً",
      "حجم ضخم جداً (312 مليون كلمة في 12 مليون جملة) يجعلها من أكبر مجموعات بيانات الترقيم العربية",
      "منهجية علمية صارمة تعتمد على مبدأ نحوي واضح (المُسنَد والمُسنَد إليه) لتحديد حدود الجمل",
      "اتفاق عالٍ بين المُعلِّقين (معامل كابا = 0.89) يدل على موثوقية التعليقات",
      "ورقة بحثية منشورة في مجلة علمية محكَّمة (Data in Brief) مع توثيق شامل للمنهجية",
      "تنوع المصادر بين كتب أصلية وترجمات ووثائق أممية",
      "ترخيص مفتوح (CC BY 4.0) يسمح بالاستخدام الحر"
    ],
    "نقاط_الضعف": [
      "ثلثا البيانات (ABC وSSAC_UNPC) غير متاحتين عبر HuggingFace مما يُصعّب الوصول البرمجي المباشر",
      "المكون المتاح (CBT) يتكون من ترجمات أدبية فقط مما يحدّ من تنوع أنماط الترقيم",
      "البيانات مُخزَّنة كنصوص كاملة وليس كجمل مُعلَّمة منفصلة، مما يتطلب معالجة مسبقة كبيرة",
      "غياب تقسيم اختبار معياري يُصعّب المقارنة العادلة بين النماذج",
      "اعتماد مكون CBT على الترجمات يعني تأثر أنماط الترقيم بقواعد اللغة الإنجليزية",
      "البيانات الكاملة متاحة فقط عبر Mendeley Data وليس عبر منصات تعلم الآلة الشائعة"
    ],
    "الاستخدامات_الموصى_بها": [
      "تدريب نماذج التنبؤ بعلامات الترقيم في النصوص العربية",
      "تحديد حدود الجمل في النصوص العربية غير المُرقَّمة",
      "تحسين أنظمة التعرف التلقائي على الكلام عبر إضافة الترقيم للنص المُنتَج",
      "دراسات لسانيات المدوَّنات حول أنماط الترقيم في العربية الفصحى الحديثة",
      "تحسين مخرجات الترجمة الآلية من حيث وضع علامات الترقيم"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 50,
      "التوثيق": 85,
      "السلامة_الأخلاقية": 90,
      "الترخيص": 95,
      "قابلية_إعادة_الإنتاج": 65,
      "المراجعة_العلمية": 90,
      "جودة_البيانات": 75
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/CBT",
      "https://data.mendeley.com/datasets/2pkxckwgs3/1",
      "https://pmc.ncbi.nlm.nih.gov/articles/PMC10859254/",
      "https://pubmed.ncbi.nlm.nih.gov/38348323/"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2024,
    "Tasks": [
      "punctuation detection"
    ],
    "Form": "text",
    "Volume": 12183000.0,
    "Unit": "sentences",
    "License": "CC BY 4.0",
    "HF Link": "https://hf.co/datasets/arbml/CBT,https://hf.co/datasets/arbml/ABC,https://hf.co/datasets/arbml/SSAC_UNPC",
    "Paper Link": "https://www.sciencedirect.com/science/article/pii/S2352340924000908",
    "Domain": [
      "books"
    ],
    "Authors": [],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "journal"
  },
  {
    "slug": "arabic_speech_commands_dataset",
    "الاسم": "مجموعة بيانات أوامر الكلام العربية",
    "الاسم_الأصلي": "Arabic Speech Commands Dataset",
    "درجة_الجودة": 72,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات صوتية عربية مصممة لمهام التعرف على الكلمات المفتاحية المنطوقة، تحتوي على 12,000 تسجيل صوتي مدة كل منها ثانية واحدة بمعدل عينات 16 كيلوهرتز، مقسمة على 40 كلمة مفتاحية وجُمعت من 30 مشاركاً. البيانات متوازنة تماماً (300 عينة لكل كلمة) ومنشورة مع ورقة بحثية محكّمة في مجلة Engineering Applications of Artificial Intelligence حققت أفضل دقة 98% باستخدام شبكة عصبية التفافية مع معاملات MFCC. تعاني نسخة HuggingFace من نقص تقسيم التحقق (9,600 عينة فقط بدل 12,000) وعدم تضمين الملفات الصوتية الفعلية، لكن البيانات الأصلية الكاملة متاحة على GitHub وZenodo.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 9600,
      "معاينة_العينات": [
        "{'file': 'dataset/backward/00000030_NO_01.wav', 'label': 32} — مسار ملف صوتي لكلمة backward مع رقم التصنيف",
        "{'file': 'dataset/cancel/00000030_NO_01.wav', 'label': 31} — مسار ملف صوتي لكلمة cancel مع رقم التصنيف",
        "{'file': 'dataset/zoom in/00000030_NO_01.wav', 'label': 21} — مسار ملف صوتي لعبارة zoom in مع رقم التصنيف"
      ],
      "مشاكل_مكتشفة": [
        "نسخة HuggingFace تحتوي على مسارات الملفات فقط (67.8 كيلوبايت) وليس الملفات الصوتية الفعلية، مما يجعلها غير صالحة للاستخدام المباشر دون تحميل البيانات من GitHub أو Zenodo",
        "تقسيم التحقق (validation) المذكور في التوثيق (20%) غير موجود على HuggingFace — يوجد فقط train (7,200) وtest (2,400) بمجموع 9,600 بدل 12,000",
        "أسماء المجلدات والتصنيفات بالإنجليزية فقط (backward, cancel, start...) رغم أن الكلمات المنطوقة بالعربية — لا يوجد ربط نصي مباشر بالكلمات العربية في البيانات الوصفية",
        "التصنيفات عبارة عن أرقام (0-39) بدون خريطة واضحة للكلمات العربية المقابلة ضمن البيانات نفسها",
        "عدد المساهمين محدود (30 شخصاً فقط) مما يقلل من التنوع الصوتي واللهجي"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "توزيع متوازن تماماً: كل تصنيف من التصنيفات الأربعين يحتوي على نفس العدد بالضبط من العينات (180 في التدريب، 60 في الاختبار)",
      "تسمية منتظمة ومنهجية للملفات باستخدام نمط ثابت: [معرف_المساهم]_NO_[رقم_الجولة].wav",
      "فصل تسجيلات كل مساهم في مجموعة فرعية واحدة فقط لمنع تسرب البيانات بين التدريب والاختبار",
      "ورقة بحثية محكّمة في مجلة علمية مرموقة (EAAI) مع نتائج مرجعية قابلة للمقارنة",
      "ترخيص مفتوح (CC BY 4.0) يسمح بالاستخدام والتعديل وإعادة التوزيع",
      "توفر البيانات على منصات متعددة (GitHub وZenodo وHuggingFace) مع DOI ثابت",
      "تضمين تسجيلات ضوضاء خلفية (~49 ميجابايت) لأغراض تعزيز البيانات",
      "دقة عالية محققة (98%) مما يدل على جودة التسجيلات واتساقها"
    ],
    "نقاط_الضعف": [
      "نسخة HuggingFace لا تتضمن الملفات الصوتية الفعلية — فقط مسارات نصية وأرقام تصنيفات",
      "عدد المشاركين محدود جداً (30 شخصاً) مما يحد من تنوع الأصوات واللهجات والأعمار",
      "حجم البيانات صغير نسبياً (3 ساعات فقط، 12,000 تسجيل) مقارنة بمجموعة Google Speech Commands الأصلية",
      "الكلمات المفتاحية مكتوبة بالإنجليزية في هيكل البيانات دون ربط مباشر بالنطق العربي في البيانات الوصفية",
      "لا يوجد تقسيم تحقق (validation) في نسخة HuggingFace رغم ذكره في التوثيق",
      "مدة كل تسجيل ثانية واحدة فقط، مما يحد من استخدامها في مهام التعرف على الكلام المتصل",
      "جدول الكلمات العربية الأربعين ومقابلاتها مضمّن كصورة (keywords.jpg) وليس كبيانات نصية قابلة للقراءة الآلية"
    ],
    "الاستخدامات_الموصى_بها": [
      "تدريب نماذج كشف الكلمات المفتاحية العربية المنطوقة للأجهزة المحدودة الموارد",
      "البحث الأكاديمي في مجال التعرف على الكلام العربي ومقارنة أداء النماذج المختلفة",
      "تطوير أنظمة التحكم الصوتي البسيطة باللغة العربية",
      "تعليم أساسيات معالجة الإشارات الصوتية والتعلم العميق للصوت",
      "المقارنة المعيارية مع مجموعات بيانات أخرى مثل Google Speech Commands"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 65,
      "التوثيق": 75,
      "السلامة_الأخلاقية": 85,
      "الترخيص": 95,
      "قابلية_إعادة_الإنتاج": 80,
      "المراجعة_العلمية": 85,
      "جودة_البيانات": 70
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/Speech_Commands_Dataset",
      "https://github.com/abdulkaderghandoura/arabic-speech-commands-dataset",
      "https://zenodo.org/records/4662481",
      "https://www.sciencedirect.com/science/article/pii/S0952197621001147"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2021,
    "Tasks": [
      "speech recognition"
    ],
    "Form": "audio",
    "Volume": 3.0,
    "Unit": "hours",
    "License": "CC BY 4.0",
    "HF Link": "https://hf.co/datasets/arbml/Speech_Commands_Dataset",
    "Paper Link": "https://www.sciencedirect.com/science/article/pii/S0952197621001147",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Abdulkader Ghandoura",
      "Farouk Hjabo",
      "Oumayma Al Dakkak"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "journal"
  },
  {
    "slug": "aslad_190k",
    "الاسم": "مجموعة بيانات أبجدية لغة الإشارة العربية ASLAD-190K",
    "الاسم_الأصلي": "ASLAD-190K: Arabic Sign Language Alphabet Dataset",
    "درجة_الجودة": 72,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات شاملة تضم 190,000 صورة RGB مصنّفة تمثل 32 حرفاً وإشارة من أبجدية لغة الإشارة العربية. جُمعت الصور بواسطة شخصين مستخدمين كاميرتي ويب (HP HD وHP TrueVision HD) في ظروف متنوعة من حيث الإضاءة والمسافة والخلفية. تشمل المجموعة أيضاً مجموعة فرعية متوازنة (96,000 صورة) مع ملف CSV يحتوي على إحداثيات 21 نقطة مرجعية لليد و26 زاوية هندسية مستخلصة. البيانات متاحة مجاناً بترخيص CC BY 4.0 وتهدف لدعم تطوير تقنيات التعرف على لغة الإشارة العربية لخدمة مجتمع الصم وضعاف السمع الناطقين بالعربية.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "hf_viewer",
      "عدد_العينات_المفحوصة": 15,
      "معاينة_العينات": [
        "{'letter': 'ain', 'file_name': 'ain (1).jpg'} - صورة لحرف العين في لغة الإشارة العربية",
        "{'letter': 'aleff', 'file_name': 'aleff (1).jpg'} - صورة لحرف الألف في لغة الإشارة العربية",
        "ASLAD-96K landmarks: التصنيف=0, الصورة=ain (5191).jpg, إحداثيات landmarks: [0.146, 0.644, 0.0, 0.216, 0.463, 0.034], زوايا: [141.75, 63.83, 145.09, ...]"
      ],
      "مشاكل_مكتشفة": [
        "أسماء أعمدة ملف CSV للـ landmarks رقمية وغير وصفية (4096، 4097، ...) بدلاً من أسماء دالة مثل x_wrist, y_wrist مما يصعّب فهم البيانات واستخدامها",
        "الصور الفعلية مضغوطة في ملف ZIP كبير ولا يمكن معاينتها مباشرة من HuggingFace بسبب خطأ في فك تشفير UTF-8",
        "عدد الموقّعين محدود جداً (شخصان فقط) مما قد يحدّ من تنوع أساليب الإشارة وتعميم النماذج المدربة عليها",
        "عدم توازن طفيف في التوزيع بين الفئات في المجموعة الأصلية (من 5,108 إلى 7,092 صورة لكل حرف)",
        "لا يوجد تقسيم رسمي للبيانات إلى مجموعات تدريب واختبار وتحقق"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "حجم كبير ومميز: 190,000 صورة تجعلها من أكبر مجموعات بيانات لغة الإشارة العربية المتاحة",
      "تنوع في ظروف التصوير: إضاءة متباينة، مسافات مختلفة، خلفيات بسيطة ومعقدة، تصوير نهاري وليلي",
      "توفر مجموعة فرعية متوازنة (96,000 صورة بواقع 3,000 لكل فئة) مما يسهّل التدريب العادل",
      "استخلاص سمات إضافية: إحداثيات landmarks و26 زاوية هندسية متوفرة في ملف CSV جاهز",
      "لا توجد أسماء ملفات مكررة ولا قيم مفقودة في بيانات landmarks مما يدل على عناية في إعداد البيانات",
      "ترخيص مفتوح CC BY 4.0 يسمح بالاستخدام الحر",
      "ورقة بحثية منشورة في مجلة علمية محكّمة (Neural Computing and Applications - Springer)",
      "تم التحقق من البيانات بمساعدة مدرسة الصم والبكم في المنصورة، قسنطينة، الجزائر"
    ],
    "نقاط_الضعف": [
      "عدد الموقّعين محدود جداً (شخصان فقط) مما يقلل من تنوع أنماط الإشارة ويضعف قابلية التعميم",
      "أسماء أعمدة ملف CSV للسمات رقمية وغير واضحة وتفتقر للتوثيق المباشر",
      "لا يوجد تقسيم رسمي للبيانات (تدريب/اختبار/تحقق) مما يصعّب المقارنة المعيارية",
      "البيانات مضغوطة في ملف ZIP كبير مما يعيق التحميل التدفقي والمعاينة السريعة من HuggingFace",
      "الورقة البحثية الوصفية (preprint) لا تتضمن نتائج تجريبية مباشرة بل تحيل إلى الورقة الأصلية المنشورة في Springer",
      "تغطية محدودة لتنوع الموقّعين ديموغرافياً (عمر، جنس، حجم اليد) مما قد يؤدي لتحيّز في النماذج",
      "البيانات ثابتة (صور) ولا تشمل إشارات حركية أو فيديو"
    ],
    "الاستخدامات_الموصى_بها": [
      "تدريب نماذج تصنيف صور حروف لغة الإشارة العربية باستخدام التعلم العميق",
      "تطوير أنظمة التعرف الآلي على لغة الإشارة العربية في الوقت الفعلي",
      "البحث في استخلاص سمات اليد (landmarks والزوايا الهندسية) للتعرف على الإيماءات",
      "المقارنة المعيارية بين خوارزميات الرؤية الحاسوبية على بيانات لغة الإشارة العربية",
      "تطوير تقنيات مساعدة للصم وضعاف السمع في المجتمعات الناطقة بالعربية",
      "دراسات نقل التعلم من مجموعات بيانات لغات الإشارة الأخرى إلى العربية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 65,
      "التوثيق": 62,
      "السلامة_الأخلاقية": 80,
      "الترخيص": 95,
      "قابلية_إعادة_الإنتاج": 60,
      "المراجعة_العلمية": 75,
      "جودة_البيانات": 70
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/aboulesnane/ASLAD-190K",
      "https://data.mendeley.com/datasets/2fgpn5dwgc/2",
      "https://hal.science/hal-04822778v1/file/ASLAD-190Kv2.pdf",
      "https://link.springer.com/article/10.1007/s00521-024-10729-7"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2024,
    "Tasks": [
      "sign language recognition"
    ],
    "Form": "images",
    "Volume": 190000.0,
    "Unit": "images",
    "License": "CC BY 4.0",
    "HF Link": "https://huggingface.co/datasets/aboulesnane/ASLAD-190K",
    "Paper Link": "https://osf.io/preprints/osf/n236q_v2",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Abdennour Boulesnane",
      "Lyna Bellil",
      "Maissoun Ghouzlen Ghiri"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "preprint"
  },
  {
    "slug": "ans_corpus___claim_verification",
    "الاسم": "مجموعة أخبار عربية للتحقق من الادعاءات والتنبؤ بالموقف",
    "الاسم_الأصلي": "ANS CORPUS: claim verification",
    "درجة_الجودة": 68,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات عربية متخصصة في التحقق من صحة الادعاءات والتنبؤ بالموقف، مبنية على عناوين أخبارية عربية. تتكون من 3,786 زوج من الجمل (ادعاء ودليل) مصنفة إلى ثلاث فئات: موافق، غير موافق، وأخرى. النصوص العربية سليمة بشكل عام وتغطي مجالات إخبارية متنوعة كالسياسة والاقتصاد. لا يوجد تكرار في البيانات، لكن هناك عدم توازن واضح في توزيع الفئات حيث تهيمن فئة 'غير موافق' بنسبة 63.6% بينما لا تمثل فئة 'أخرى' سوى 2.4%. المجموعة مرفقة بورقة بحثية منشورة في ورشة عمل FEVER ضمن مؤتمر ACL وتحقق نتائج أساسية باستخدام BERT.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 3786,
      "معاينة_العينات": [
        "s1: هجوم صاروخي يستهدف مطار في طرابلس ويجبر ليبيا على تغيير مسار الرحلات الجوية | s2: هدوء الاشتباكات فى طرابلس | label: disagree",
        "s1: نيكاي يرتفع لأعلى مستوى منذ 1991 | s2: ارتفاع قياسي لمؤشر نيكاي منذ ١٩٩١ | label: agree",
        "s1: هل نجحت عقوبات ترامب في هز بازار طهران؟ | s2: مساع صينية لردع ترامب بـخطة أوروبية | label: other"
      ],
      "مشاكل_مكتشفة": [
        "عدم توازن حاد في توزيع الفئات: فئة disagree تمثل 63.6%، وفئة agree تمثل 34%، بينما فئة other لا تمثل سوى 2.4% فقط",
        "وجود 7 نصوص تحتوي على أحرف لاتينية مثل MSCI مدمجة داخل النص العربي",
        "وجود أحرف مسافة غير قابلة للكسر (\\xa0) في بعض النصوص مما يشير إلى عدم تنظيف كامل للبيانات",
        "النصوص قصيرة نسبياً (عناوين أخبار فقط) مما يحد من تعقيد مهمة الاستدلال اللغوي",
        "النسخة المتاحة على HuggingFace تتضمن فقط نسخة التنبؤ بالموقف (3,786 زوج) وليس نسخة التحقق من الادعاءات (4,547 ادعاء)"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "النصوص العربية سليمة لغوياً وواضحة المعنى في الغالبية العظمى من العينات",
      "لا يوجد أي تكرار في البيانات: جميع الأزواج الـ2,652 في مجموعة التدريب فريدة",
      "التصنيفات متسقة ومنطقية: أزواج agree تعبر فعلاً عن نفس المعنى، وأزواج disagree تتناقض بوضوح",
      "البيانات مقسمة بشكل صحيح إلى تدريب (2,652) وتحقق (755) واختبار (379)",
      "ترخيص Apache-2.0 يسمح بالاستخدام الحر في البحث والتطوير",
      "مرفقة بورقة بحثية محكمة منشورة في ورشة عمل FEVER ضمن ACL",
      "سهلة الوصول عبر HuggingFace ومستودع GitHub"
    ],
    "نقاط_الضعف": [
      "عدم توازن شديد في الفئات: فئة other تمثل 2.4% فقط مما يجعلها شبه معدومة",
      "حجم البيانات صغير نسبياً (3,786 زوج) مقارنة بمجموعات بيانات التحقق من الحقائق الحديثة",
      "النصوص مقتصرة على عناوين أخبارية قصيرة (متوسط 50 حرفاً) ولا تتضمن نصوصاً طويلة أو سياقاً كاملاً",
      "لا يتوفر توثيق تفصيلي لعملية التعليق التوضيحي أو معايير الاتفاق بين المعلقين على صفحة HuggingFace",
      "النسخة الثانية من البيانات (التحقق من الادعاءات مع 4,547 ادعاء) غير متاحة مباشرة على HuggingFace",
      "وجود بعض الأحرف الخاصة وأحرف المسافة غير المرئية التي تحتاج تنظيفاً"
    ],
    "الاستخدامات_الموصى_بها": [
      "التنبؤ بالموقف بين أزواج الجمل الإخبارية العربية",
      "التحقق من صحة الادعاءات في سياق الأخبار العربية",
      "تدريب نماذج كشف الأخبار الكاذبة باللغة العربية",
      "تقييم نماذج فهم اللغة العربية في مهام الاستدلال النصي",
      "البحث الأكاديمي في مجال معالجة اللغة العربية الطبيعية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 90,
      "التوثيق": 60,
      "السلامة_الأخلاقية": 80,
      "الترخيص": 90,
      "قابلية_إعادة_الإنتاج": 65,
      "المراجعة_العلمية": 75,
      "جودة_البيانات": 62
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/ANS_stance",
      "https://github.com/latynt/ans",
      "https://arxiv.org/abs/2005.10410"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2020,
    "Tasks": [
      "stance detection",
      "fact checking"
    ],
    "Form": "text",
    "Volume": 4547.0,
    "Unit": "sentences",
    "License": "Apache-2.0",
    "HF Link": "https://hf.co/datasets/arbml/ANS_stance",
    "Paper Link": "https://arxiv.org/pdf/2005.10410.pdf",
    "Domain": [
      "news articles"
    ],
    "Authors": [
      "Jude Khouja"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "workshop"
  },
  {
    "slug": "aasl",
    "الاسم": "مجموعة بيانات الأبجدية العربية للغة الإشارة",
    "الاسم_الأصلي": "RGB Arabic Alphabets Sign Language Dataset (AASL)",
    "درجة_الجودة": 62,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات AASL هي أول مجموعة بيانات RGB متاحة للعموم لأبجدية لغة الإشارة العربية، تضم 7,857 صورة خام موسومة بالكامل تم جمعها من أكثر من 200 مشارك. الصور تغطي 30 فئة تمثل الحروف العربية في لغة الإشارة، وتم التقاطها في ظروف متنوعة من حيث الإضاءة والخلفية والاتجاه والدقة. تم التحقق من جودة الصور بإشراف خبراء في المجال. المجموعة مفيدة لتطوير نماذج تصنيف لغة الإشارة العربية، لكنها تعاني من عدم توازن في توزيع الفئات وغياب تقسيمات معيارية للتدريب والاختبار، كما أن الورقة البحثية المرافقة منشورة كمسودة غير محكّمة.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "hf_viewer",
      "عدد_العينات_المفحوصة": 9,
      "معاينة_العينات": [
        "Ain_sample.jpg: صورة RGB بأبعاد 3024×2057 تُظهر يداً تؤدي إشارة حرف العين - يد ممدودة أفقياً بأصابع مضمومة على خلفية فاتحة",
        "Al_sample.jpg: صورة RGB بأبعاد 528×960 تُظهر يداً تؤدي إشارة حرف أل - ثلاثة أصابع ممدودة على خلفية سجادة ملونة، مع علامة كاميرا هاتف",
        "Alef_sample.jpg: صورة RGB بأبعاد 2368×3156 تُظهر يداً مقبوضة مع إبهام ممدود تؤدي إشارة حرف الألف على خلفية بيضاء"
      ],
      "مشاكل_مكتشفة": [
        "تباين كبير في أحجام الصور: من 474×534 إلى 4532×3830 بكسل، مما يتطلب معالجة مسبقة لتوحيد الأبعاد",
        "عدم توازن في توزيع الفئات: فئة Teh تحتوي 568 صورة بينما فئة Zain تحتوي 201 صورة فقط",
        "وجود 30 فئة فعلية بدلاً من 31 المذكورة في سكريبت التحميل، لأن Teh_Marbuta مدرجة كفئة مستقلة في المجلدات لكن سكريبت التحميل يدمجها مع Teh",
        "تناقض في العدد المذكور: الورقة تذكر 7,856 والوصف يذكر 7,857 والملف الفعلي يحتوي 7,857 صورة",
        "بعض الصور تحتوي على علامات مائية لكاميرات هواتف (مثل SHOT ON MI 9T)",
        "لا يوجد تقسيم معياري للتدريب والاختبار",
        "عارض البيانات في HuggingFace معطّل بسبب اعتماد المستودع على سكريبت Python قديم",
        "سكريبت التحميل AASL.py يحتوي على خلل: يأخذ فقط أول صورتين من كل فئة بدلاً من كل الصور"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "أول مجموعة بيانات RGB متاحة للعموم لأبجدية لغة الإشارة العربية، مما يسد فجوة مهمة في الموارد المتاحة",
      "تنوع حقيقي في ظروف التصوير: خلفيات مختلفة وإضاءة متنوعة واتجاهات متعددة، كما تأكدنا من خلال فحص العينات",
      "جمع البيانات من أكثر من 200 مشارك يضمن تنوعاً في أشكال اليد وأحجامها",
      "الصور عالية الدقة وبتنسيق RGB خام دون معالجة مسبقة، مما يتيح مرونة في المعالجة",
      "ترخيص CC BY-NC-SA 4.0 يسمح بالاستخدام الأكاديمي والبحثي",
      "التصنيفات واضحة ومنظمة في مجلدات منفصلة لكل حرف"
    ],
    "نقاط_الضعف": [
      "الورقة البحثية منشورة على viXra كمسودة غير محكّمة، مما يقلل من المصداقية العلمية",
      "لا يوجد تقسيم معياري لمجموعات التدريب والتحقق والاختبار",
      "عدم توازن ملحوظ في عدد الصور بين الفئات (201 إلى 568 صورة لكل فئة)",
      "الورقة لا تتضمن نتائج تجريبية أو نماذج أساسية للمقارنة (baselines)",
      "حجم المجموعة صغير نسبياً (أقل من 8,000 صورة) لتدريب نماذج التعلم العميق",
      "سكريبت التحميل على HuggingFace معطوب ولا يعمل مع الإصدارات الحديثة من مكتبة datasets",
      "تباين كبير في أحجام الصور يتطلب معالجة مسبقة إضافية",
      "بعض الصور تحتوي على عناصر مشتتة كعلامات كاميرا الهاتف"
    ],
    "الاستخدامات_الموصى_بها": [
      "تطوير نماذج تصنيف لأبجدية لغة الإشارة العربية",
      "البحث في مجال الرؤية الحاسوبية المتعلق بالتعرف على الإيماءات اليدوية",
      "تدريب نماذج التعلم بالنقل لتطبيقات لغة الإشارة العربية",
      "بناء تطبيقات مساعدة للصم وضعاف السمع في العالم العربي",
      "استخدامها كمجموعة بيانات مرجعية لمقارنة أداء خوارزميات التصنيف"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 55,
      "التوثيق": 50,
      "السلامة_الأخلاقية": 75,
      "الترخيص": 80,
      "قابلية_إعادة_الإنتاج": 55,
      "المراجعة_العلمية": 30,
      "جودة_البيانات": 65
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/pain/AASL",
      "https://huggingface.co/api/datasets/pain/AASL",
      "https://huggingface.co/api/datasets/pain/AASL/tree/main",
      "https://huggingface.co/datasets/pain/AASL/raw/main/AASL.py",
      "https://huggingface.co/datasets/pain/AASL/raw/main/README.md",
      "https://huggingface.co/datasets/pain/AASL/resolve/main/images.zip",
      "https://arxiv.org/abs/2301.11932"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2023,
    "Tasks": [
      "sign language recognition"
    ],
    "Form": "images",
    "Volume": 7857.0,
    "Unit": "images",
    "License": "CC BY-NC-SA 4.0",
    "HF Link": "https://huggingface.co/datasets/pain/AASL",
    "Paper Link": "https://arxiv.org/pdf/2301.11932",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Muhammad Al-Barham",
      "Adham Alsharkawi",
      "Musa Al-Yaman",
      "Mohammad Al-Fetyani",
      "Ashraf Elnagar",
      "Ahmad Abu Sa’aleek",
      "Mohammad Al-Odat"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "preprint"
  },
  {
    "slug": "afewc",
    "الاسم": "مجموعة مقالات ويكيبيديا القابلة للمقارنة بالعربية والفرنسية والإنجليزية",
    "الاسم_الأصلي": "AFEWC - Arabic French English Wikipedia Comparable",
    "درجة_الجودة": 62,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات متعددة اللغات تحتوي على حوالي 40,290 مقالة قابلة للمقارنة مستخرجة من ويكيبيديا بثلاث لغات: العربية والفرنسية والإنجليزية. تم جمع البيانات باستخدام روابط اللغات المتقاطعة في ويكيبيديا، وكل ثلاثية مقالات تتعلق بالموضوع نفسه. النصوص العربية سليمة لغوياً بشكل عام لكنها تحتوي على بقايا تنسيق ويكيبيديا مثل التصنيفات وبقايا التواريخ والقوالب في نسبة ملحوظة من العينات. المجموعة مفيدة للترجمة الآلية الإحصائية واستخراج المعاجم ثنائية اللغة واسترجاع المعلومات عبر اللغات، لكنها تحتاج تنظيفاً إضافياً لإزالة بقايا ترميز ويكيبيديا.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 500,
      "معاينة_العينات": [
        "طبلة الأذن | جهاز سمعي | أذن — طبلة الأذن Eardrum أو الغشاء الطبلي Tympanic Membrane هو غشاء حيوي رقيق يفصل الأذن الخارجية عن الأذن الوسطى لدى البشر والفقاريات الأخرى. ووظيفته هي نقل الصوت من الهواء إلى داخل عظيمات الأذن الوسطى.",
        "إل باسو، تكساس | مدن تكساس — إل باسو (El Paso) مدينة أمريكية تقع في ولاية تكساس. وهي حاضرة مقاطعة إل باسو، وأكبر مدن منطقة غرب تكساس، وسادس أكبر مدن الولاية.",
        "نيوبي | مصطلحات إنترنت — نيوبي (تنطق \"نوبي\" أيضاً) noob, n00b, newbie أو نووب، هي كلمة مشتقة من كلمتي \"new boy\". وهي تعني \"مبتدئ\" عامة، أو الشخص الذي بدأ لتوه استخدام الإنترنت."
      ],
      "مشاكل_مكتشفة": [
        "حوالي 68.8% من العينات تحتوي تصنيفات ويكيبيديا مدمجة في النص (مثل: مدن تكساس | صحف بريطانية) دون فصلها كحقل مستقل",
        "حوالي 10.6% من العينات تحتوي بقايا قوالب تواريخ ويكيبيديا (مثل: تاريخسبتمبر 2011: تاريخ: سبتمبر 2011:)",
        "2.6% من العينات تحتوي بقايا ترميز ويكي ماركاب مثل الأقواس المزدوجة [[ ]] و{{ }}",
        "بعض النصوص العربية تحتوي عبارات إنجليزية مدمجة خاصة في أوصاف الصور والمعرض (Gallery)",
        "لا يوجد تقسيم للبيانات إلى مجموعات تدريب واختبار وتحقق",
        "النصوص ليست مقالات قابلة للمقارنة بالمعنى الدقيق بل هي مقالات ويكيبيديا كاملة بنفس الموضوع، وقد تختلف كثيراً في الطول والمحتوى بين اللغات"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "حجم كبير يبلغ حوالي 40,290 مقالة ثلاثية اللغة، مما يوفر تغطية واسعة للموضوعات",
      "النصوص العربية سليمة لغوياً بشكل عام ومكتوبة بالعربية الفصحى الحديثة",
      "لا توجد تكرارات في العينات الـ 500 المفحوصة",
      "لا توجد نصوص عربية فارغة أو قصيرة جداً (أقل من 50 حرفاً) في العينات المفحوصة",
      "متوسط طول النص العربي 2,459 حرفاً مما يشير إلى محتوى غني ومفصل",
      "البيانات متاحة بسهولة عبر مكتبة HuggingFace Datasets وبصيغة Parquet",
      "تغطي مواضيع متنوعة من علوم وجغرافيا وتكنولوجيا واقتصاد وثقافة"
    ],
    "نقاط_الضعف": [
      "النصوص لم تُنظَّف بشكل كافٍ من بقايا تنسيق ويكيبيديا (تصنيفات، قوالب، ترميز)",
      "لا يوجد تقسيم إلى مجموعات تدريب واختبار مما يصعّب استخدامها في التجارب المقارنة",
      "البيانات قابلة للمقارنة وليست متوازية، فالمحتوى يختلف بين اللغات أحياناً بشكل كبير",
      "الورقة البحثية نُشرت عام 2013 في مجلة Procedia Social and Behavioral Sciences وليست مجلة متخصصة في معالجة اللغات الطبيعية",
      "لا توجد بيانات وصفية على مستوى المقالة مثل موضوع المقالة أو عنوانها كحقل مستقل",
      "تصنيفات ويكيبيديا مدمجة في نص المقالة بدلاً من فصلها كحقول مستقلة مما يُعقّد المعالجة",
      "ترخيص CC BY-NC 2.0 يمنع الاستخدام التجاري"
    ],
    "الاستخدامات_الموصى_بها": [
      "التدريب على نماذج الترجمة الآلية الإحصائية والعصبية بين العربية والفرنسية والإنجليزية",
      "استخراج المعاجم ثنائية اللغة من النصوص القابلة للمقارنة",
      "استرجاع المعلومات عبر اللغات والبحث متعدد اللغات",
      "تجارب تلخيص النصوص متعددة اللغات",
      "دراسة مقارنة للمحتوى المعرفي عبر اللغات في ويكيبيديا",
      "التدريب المسبق لنماذج اللغة متعددة اللغات"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 85,
      "التوثيق": 55,
      "السلامة_الأخلاقية": 80,
      "الترخيص": 60,
      "قابلية_إعادة_الإنتاج": 65,
      "المراجعة_العلمية": 50,
      "جودة_البيانات": 58
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/AFEWC",
      "https://www.sciencedirect.com/science/article/pii/S1877042813041402",
      "https://www.researchgate.net/publication/258435249_Extracting_Comparable_Articles_from_Wikipedia_and_Measuring_their_Comparabilities",
      "https://sourceforge.net/projects/crlcl/"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2013,
    "Tasks": [
      "machine translation"
    ],
    "Form": "text",
    "Volume": 40290.0,
    "Unit": "documents",
    "License": "CC BY-NC 2.0",
    "HF Link": "https://hf.co/datasets/arbml/AFEWC",
    "Paper Link": "https://www.sciencedirect.com/science/article/pii/S1877042813041402",
    "Domain": [
      "wikipedia"
    ],
    "Authors": [
      "Motaz K. Saad",
      "David Langlois",
      "Kamel Sma"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "journal"
  },
  {
    "slug": "ags",
    "الاسم": "مجموعة بيانات التلخيص العربي المولّدة بالذكاء الاصطناعي",
    "الاسم_الأصلي": "AGS: Arabic GPT Summarization Corpus",
    "درجة_الجودة": 62,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات AGS هي أول مجموعة بيانات متاحة للعموم مخصصة للتلخيص الاستخلاصي باللغة العربية، تحتوي على نحو 141,000 زوج من المقالات والملخصات بالعربية الفصحى الحديثة. الملخصات مولّدة آلياً باستخدام نموذج GPT-3.5 Turbo عبر هندسة الأوامر، وتغطي مواضيع متنوعة كالسياسة والرياضة والعلوم والتكنولوجيا. جودة النصوص العربية جيدة بشكل عام مع نسبة ضغط متوسطة تبلغ 66%، لكن الاعتماد الكلي على نموذج لغوي في توليد الملخصات بدلاً من بشر متخصصين يُعد نقطة ضعف جوهرية تؤثر على مصداقية البيانات كمعيار تقييمي حقيقي. المجموعة مفيدة لتدريب نماذج التلخيص العربية لكنها لا تصلح كمقياس مرجعي ذهبي بسبب طبيعة الملخصات المولّدة آلياً.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 200,
      "معاينة_العينات": [
        "id:0 | النص: يمكن تصور السلوكيات المُهَدِدة باعتبارها ثمرة لعدم القدرة على التأقلم مع الدافع الطبيعي التنافسي... | الملخص: السلوكيات المهددة يمكن أن تكون نتيجة عدم القدرة على التأقلم مع العلاقات الهيمنة التنافسية...",
        "id:1 | النص: يقدِّر المؤرِّخون مجموع عدد الرقيق خلال الفترة المُمتدة بدءًا من مطلع التاريخ الإسلاميّ في عام 650... | الملخص: يُقدِّر عدد الرقيق خلال الفترة الممتدة من 650 إلى منتصف القرن العشرين بين 10 إلى 18 مليون شخص...",
        "id:50 | النص: خلصت دراسة أميركية إلى نتائج عكسية للمشروبات الغازية الخالية من السكر... | الملخص: نتائج دراسة أميركية تؤكد أن المشروبات الغازية الخالية من السكر تسبب زيادة الوزن والسكري..."
      ],
      "مشاكل_مكتشفة": [
        "الملخصات مولّدة بالكامل بواسطة GPT-3.5 Turbo وليست بشرية، مما يعني أنها قد تحتوي على هلوسات أو معلومات غير دقيقة لم تُذكر في النص الأصلي",
        "بعض الملخصات تميل إلى الاستخلاص أكثر من التلخيص الحقيقي، حيث تعيد صياغة الجمل الأولى من المقال دون التقاط الأفكار الرئيسية بشكل كافٍ",
        "بعض النصوص الأصلية تبدو مبتورة أو ناقصة في نهايتها، مما يشير إلى مشاكل في عملية جمع المقالات المصدرية",
        "لا يوجد تقسيم للبيانات إلى مجموعات تدريب واختبار وتحقق، بل توجد مجموعة تدريب واحدة فقط مما يصعّب إجراء تقييم معياري",
        "بعض الملخصات المولّدة تضيف تفاصيل تفسيرية غير موجودة صراحة في النص الأصلي، وهو سلوك نموذجي لنماذج اللغة الكبيرة"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "حجم كبير يبلغ نحو 141,000 زوج مقال-ملخص، وهو من أكبر مجموعات بيانات التلخيص العربية المتاحة",
      "النصوص العربية سليمة لغوياً بشكل عام ومكتوبة بالفصحى الحديثة دون تشوهات ترميزية ظاهرة",
      "تغطية موضوعية متنوعة تشمل السياسة والرياضة والعلوم والثقافة والتكنولوجيا",
      "سهولة الوصول عبر منصة HuggingFace بتنسيق Parquet مع دعم مكتبة datasets",
      "نسبة ضغط معقولة تبلغ نحو 66% في المتوسط، مما يعني أن الملخصات أقصر بكثير من النصوص الأصلية",
      "لا توجد عينات فارغة أو مكررة ظاهرياً في العينات المفحوصة",
      "ورقة بحثية منشورة في مؤتمر علمي تشرح المنهجية والنتائج"
    ],
    "نقاط_الضعف": [
      "الملخصات مولّدة بالكامل بواسطة GPT-3.5 Turbo وليست بشرية، مما يحدّ من قيمتها كمقياس مرجعي ذهبي للتلخيص",
      "غياب تقسيم البيانات إلى مجموعات تدريب واختبار وتحقق يحدّ من إمكانية التقييم المعياري",
      "بعض النصوص الأصلية تبدو مبتورة مما يدل على مشاكل في عملية جمع البيانات المصدرية",
      "لا يوجد تقييم بشري منهجي لجودة الملخصات المولّدة أو مدى أمانتها للنصوص الأصلية",
      "الترخيص غير تجاري (CC BY-NC 4.0) يحدّ من الاستخدامات التطبيقية",
      "مصدر المقالات الأصلية غير موثّق بشكل واضح في بطاقة البيانات",
      "المؤتمر الذي نُشرت فيه الورقة (ICECCE) ليس من المؤتمرات الرائدة في مجال معالجة اللغات الطبيعية"
    ],
    "الاستخدامات_الموصى_بها": [
      "تدريب نماذج التلخيص الاستخلاصي للغة العربية كبيانات تدريب مبدئية",
      "الضبط الدقيق لنماذج اللغة متعددة اللغات مثل mT5 على مهمة التلخيص العربي",
      "دراسات مقارنة بين الملخصات المولّدة آلياً والملخصات البشرية",
      "بحوث أولية في مجال التلخيص الآلي للنصوص العربية الإخبارية",
      "تعليم تقنيات معالجة اللغة الطبيعية العربية في السياقات الأكاديمية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 90,
      "التوثيق": 55,
      "السلامة_الأخلاقية": 70,
      "الترخيص": 65,
      "قابلية_إعادة_الإنتاج": 50,
      "المراجعة_العلمية": 50,
      "جودة_البيانات": 58
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/FahdSeddik/AGS-Corpus",
      "https://ieeexplore.ieee.org/abstract/document/10441794"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2023,
    "Tasks": [
      "summarization"
    ],
    "Form": "text",
    "Volume": 142000.0,
    "Unit": "documents",
    "License": "CC BY-NC 4.0",
    "HF Link": "https://hf.co/datasets/FahdSeddik/AGS-Corpus",
    "Paper Link": "https://ieeexplore.ieee.org/abstract/document/10441794",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Abdelrahman Atef",
      "Fahd Seddik",
      "Abdulrahman Elbedewy"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  },
  {
    "slug": "alriyadh-newspaper-covid-dataset",
    "الاسم": "مجموعة بيانات جريدة الرياض - كوفيد",
    "الاسم_الأصلي": "AlRiyadh-Newspaper-Covid-Dataset",
    "درجة_الجودة": 62,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات تحتوي على 24,084 مقالة صحفية عربية من جريدة الرياض السعودية تتناول أحداث فيروس كورونا (كوفيد-19) حتى فبراير 2021. تشمل البيانات النص الكامل للمقالات مع بيانات وصفية غنية تتضمن الفئة والمصدر والتاريخ والنص المنظف وقائمة الكلمات. النصوص العربية سليمة لغوياً وتمثل محتوى صحفياً حقيقياً من مصدر موثوق، لكن توجد مشاكل تقنية ملحوظة مثل انتشار قيم nan كنصوص بدلاً من قيم فارغة حقيقية، ووجود مقالات بتواريخ سابقة لجائحة كوفيد-19، وغياب ورقة بحثية منشورة محكمة.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 500,
      "معاينة_العينات": [
        "العنوان: تزايد منحنى كورونا يرفع جاهزية أمانة المدينة | الفئة: أخبار المناطق | التاريخ: 2021-02-01 | النص: أكدت أمانة منطقة المدينة المنورة استمرارها بتكثيف الجولات الرقابية الميدانية على الأسواق التجارية...",
        "العنوان: فرنسا تغلق مطاعم خالفت قيود كورونا | الفئة: الأخيرة | التاريخ: 2021-02-01 | النص: تم الخميس والجمعة رصد 24 مطعماً في باريس مخالفة للتدابير القاضية بإغلاق المطاعم التي فرضتها السلطات...",
        "العنوان: الالتزام بـ\"توكلنا\" لدخول المنشآت الحكومية والأسواق | الفئة: الأخيرة | التاريخ: 2021-02-01 | النص: شدّد صاحب السمو الملكي الأمير فيصل بن بندر بن عبدالعزيز أمير منطقة الرياض على ضرورة الالتزام..."
      ],
      "مشاكل_مكتشفة": [
        "انتشار واسع لقيم nan كنصوص حرفية بدلاً من قيم فارغة حقيقية (446 من 500 عينة في حقول Subtitle وTime)",
        "وجود عمود Unnamed: 0 غير ضروري يدل على تصدير غير نظيف من pandas",
        "وجود مقالات بتواريخ سابقة لجائحة كوفيد-19 مثل 2016-07-17 مما يثير تساؤلات حول معايير الفلترة",
        "بعض المقالات بدون فئة (قيمة nan في حقل Category)",
        "وجود نصوص فارغة تماماً (2 من 500 عينة)",
        "حقل FullTextCleaned يحذف الأرقام من النص المنظف مما قد يفقد معلومات مهمة (أسعار، إحصائيات)",
        "جميع أنواع البيانات مخزنة كنصوص (Text) حتى الحقول الرقمية مثل WordsCounts وID",
        "لا يوجد تقسيم للبيانات إلى مجموعات تدريب واختبار رغم ادعاء ذلك في HuggingFace"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "حجم كبير من البيانات (أكثر من 24,000 مقالة) يمثل تغطية شاملة لموضوع كوفيد-19",
      "النصوص العربية سليمة لغوياً وواضحة كونها من مصدر صحفي رسمي موثوق",
      "تنوع الفئات يشمل أكثر من 16 فئة (محليات، اقتصاد، رياضة، رأي، دولية، وغيرها)",
      "توفر معالجة نصية مسبقة تشمل تنظيف النص وتقسيمه إلى كلمات وحساب عدد الكلمات",
      "متوسط طول المقالات جيد (308 كلمة) مما يوفر محتوى غني للنمذجة اللغوية",
      "البيانات متاحة مجاناً على منصتي GitHub وHuggingFace بترخيص مفتوح CC BY 3.0",
      "تغطية زمنية واسعة لأحداث جائحة كوفيد-19 في السعودية"
    ],
    "نقاط_الضعف": [
      "غياب ورقة بحثية منشورة ومحكمة تصف المنهجية والتقييم بشكل علمي",
      "مشاكل تقنية في تنظيف البيانات خاصة قيم nan النصية المنتشرة في عدة حقول",
      "عدم وجود تعليقات توضيحية (annotations) أو تصنيفات للمشاعر أو المواضيع الفرعية",
      "مصدر واحد فقط (جريدة الرياض) مما يحد من تنوع المنظور الصحفي والتغطية",
      "بعض التواريخ تعود لما قبل جائحة كوفيد-19 دون توضيح سبب تضمينها",
      "تخزين جميع الحقول كنصوص بدلاً من أنواع بيانات مناسبة (أرقام، تواريخ)",
      "لا توجد وثائق تفصيلية عن منهجية الجمع ومعايير التصفية والتنظيف"
    ],
    "الاستخدامات_الموصى_بها": [
      "التدريب المسبق وضبط نماذج اللغة العربية على نصوص صحفية",
      "تحليل المحتوى الإعلامي السعودي خلال جائحة كوفيد-19",
      "دراسات الخطاب الإعلامي وتأطير الأخبار المتعلقة بالأوبئة",
      "بناء خطوط زمنية للأحداث المتعلقة بكوفيد-19 في السعودية",
      "تدريب نماذج تصنيف النصوص العربية حسب الموضوع أو الفئة الإخبارية",
      "استخراج الكيانات المسماة من النصوص الإخبارية العربية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 85,
      "التوثيق": 40,
      "السلامة_الأخلاقية": 80,
      "الترخيص": 85,
      "قابلية_إعادة_الإنتاج": 50,
      "المراجعة_العلمية": 15,
      "جودة_البيانات": 60
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/AlRiyadh_Newspaper_Covid",
      "https://github.com/alioh/AlRiyadh-Newspaper-Covid-Dataset"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2021,
    "Tasks": [
      "language modeling"
    ],
    "Form": "text",
    "Volume": 24084.0,
    "Unit": "documents",
    "License": "CC BY 3.0",
    "HF Link": "https://hf.co/datasets/arbml/AlRiyadh_Newspaper_Covid",
    "Paper Link": "",
    "Domain": [
      "news articles"
    ],
    "Authors": [],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": ""
  },
  {
    "slug": "amara",
    "الاسم": "مجموعة أمارا (QED)",
    "الاسم_الأصلي": "AMARA (QCRI Educational Domain Corpus / QED)",
    "درجة_الجودة": 62,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات متوازية متعددة اللغات مبنية من ترجمات ترجمات الفيديوهات التعليمية على منصة AMARA، تغطي 20 لغة بما فيها العربية والإنجليزية، وتحتوي على حوالي 500,898 جملة متوازية عربية-إنجليزية. الترجمات أُنتجت بشكل تعاوني من متطوعين عبر الإنترنت، مما يعني تفاوتاً في الجودة. البيانات مفيدة لمهام الترجمة الآلية في المجال التعليمي، لكنها تعاني من مشاكل ملموسة: وجود نصوص بلغات أخرى غير العربية في الجانب العربي (مثل التركية)، ونسبة تكرار ملحوظة خاصة في تعبيرات الترجمة مثل '(ضحك)'، وجمل قصيرة جداً وعلامات ترقيم فقط. رغم ذلك، الجزء الأكبر من النصوص العربية سليم ومفهوم.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "direct_link",
      "عدد_العينات_المفحوصة": 500898,
      "معاينة_العينات": [
        "AR: قد تعتقد أنك تعرف الكثير عن الأمريكيين الأصليين من الأفلام المشهورة والكتب | EN: You might think you know a lot about Native Americans through popular movies, books...",
        "AR: حتى لقد حاولت معرفة عملية التصميم الجيد من أجل التوصل إلى ولاية جديدة لتحل محل \"الاحترار العالمي\". | EN: So I've tried to figure out a good design process to come up with a new term to replace \"global warming.\"",
        "AR: اعتاد الأولاد أن يقولوا، \" إنها تبدوا كالإجابة الخطأ التي يحاول أحدهم مسحها، دون أن يستطيع ذلك.\" | EN: Kids used to say, \"She looks like a wrong answer that someone tried to erase...\""
      ],
      "مشاكل_مكتشفة": [
        "وجود حوالي 9,800 سطر في الجانب العربي لا تحتوي على أي نص عربي — بعضها نصوص تركية كاملة وُضعت خطأً في ملف العربية",
        "وجود 32,213 جملة مكررة، معظمها تعبيرات ترجمة قصيرة مثل '(ضحك)' و'شكراً'",
        "وجود 4,299 جملة قصيرة جداً (أقل من 5 أحرف)، بعضها مجرد شرطات '-' أو رموز مثل '=3'",
        "بعض الترجمات غير متوازنة: الجملة العربية مختصرة جداً مقارنة بالمقابل الإنجليزي الطويل",
        "مكتبة datasets على HuggingFace لا تعمل بسبب اعتماد المجموعة على سكريبت تحميل قديم لم يعد مدعوماً",
        "الترجمات من متطوعين فتتفاوت جودتها — بعضها يبدو آلياً أو حرفياً"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "حجم كبير: حوالي 500,898 جملة متوازية عربية-إنجليزية، مما يجعلها مصدراً غنياً للتدريب",
      "تغطية 20 لغة مع 190 زوجاً لغوياً متوازياً، مما يتيح بحوث الترجمة متعددة اللغات",
      "محتوى تعليمي متنوع من فيديوهات محاضرات ودورات مفتوحة عبر الإنترنت (MOOCs)",
      "ورقة بحثية منشورة في مؤتمر LREC 2014 مع مراجعة علمية",
      "متاحة مجاناً للبحث عبر OPUS مع توثيق واضح",
      "غالبية النصوص العربية سليمة لغوياً ومفهومة وتمثل ترجمات بشرية حقيقية",
      "توفر مجموعات تطوير واختبار مشتركة لـ 14 زوجاً لغوياً"
    ],
    "نقاط_الضعف": [
      "تلوث البيانات: نسبة ملحوظة (حوالي 2%) من الأسطر العربية تحتوي على نصوص بلغات أخرى كالتركية",
      "نسبة تكرار مرتفعة (حوالي 6.4%) بسبب تعبيرات الترجمة المتكررة",
      "جمل قصيرة جداً ورموز غير مفيدة (شرطات، رموز تعبيرية)",
      "جودة الترجمة متفاوتة لأنها من متطوعين وليست من مترجمين محترفين",
      "ترخيص مقيد بالبحث فقط — غير مسموح بالاستخدام التجاري",
      "التوثيق على HuggingFace ناقص (معظم الأقسام تحمل علامة 'More Information Needed')",
      "فشل التحميل عبر مكتبة datasets بسبب سكريبت قديم، مما يصعّب الوصول البرمجي المباشر"
    ],
    "الاستخدامات_الموصى_بها": [
      "تدريب نماذج الترجمة الآلية في المجال التعليمي بين العربية والإنجليزية",
      "بحوث الترجمة متعددة اللغات بفضل تغطية 20 لغة",
      "دراسات محاذاة الجمل عبر اللغات في سياق ترجمات الفيديو",
      "تعزيز بيانات التدريب للنماذج اللغوية ثنائية اللغة مع تنظيف مسبق للبيانات",
      "أبحاث جودة الترجمة التعاونية ومقارنتها بالترجمة المهنية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 55,
      "التوثيق": 50,
      "السلامة_الأخلاقية": 80,
      "الترخيص": 45,
      "قابلية_إعادة_الإنتاج": 65,
      "المراجعة_العلمية": 75,
      "جودة_البيانات": 58
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/Helsinki-NLP/qed_amara",
      "https://object.pouta.csc.fi/OPUS-QED/v2.0a/moses/ar-en.txt.zip",
      "https://alt.qcri.org/resources/qedcorpus/",
      "https://aclanthology.org/L14-1675/"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2014,
    "Tasks": [
      "machine translation"
    ],
    "Form": "text",
    "Volume": 154301.0,
    "Unit": "sentences",
    "License": "custom",
    "HF Link": "https://hf.co/datasets/Helsinki-NLP/qed_amara",
    "Paper Link": "http://www.lrec-conf.org/proceedings/lrec2014/pdf/877_Paper.pdf",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Ahmed Abdelali",
      "Francisco Guzman",
      "Hassan Sajjad",
      "Stephan Vogel"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  },
  {
    "slug": "amina",
    "الاسم": "أمينة - مجموعة بيانات المقالات الإخبارية العربية المتكاملة",
    "الاسم_الأصلي": "AMINA - Arabic Multi-purpose Integral News Articles",
    "درجة_الجودة": 62,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات AMINA هي مجموعة إخبارية عربية واسعة النطاق تضم أكثر من 1.85 مليون مقالة جُمعت من 9 صحف عربية من دول مختلفة عبر تقنيات الزحف الآلي. تحتوي البيانات على 5 حقول فعلية (العنوان، المقالة، التصنيف، الكاتب، تاريخ النشر) رغم أن الورقة البحثية تدّعي وجود حقول إضافية كالصور والكلمات المفتاحية وعدد الزيارات. النصوص العربية سليمة بشكل عام وخالية من مشاكل الترميز، لكن هناك مشاكل في تناسق التصنيفات حيث وُجدت مقالات رياضية مصنفة تحت السياسة. تصلح المجموعة لمهام تصنيف النصوص ونمذجة اللغة، لكنها تعاني من فجوة بين ما تدّعيه الورقة وما هو متاح فعلياً في البيانات المنشورة.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 5000,
      "معاينة_العينات": [
        "العنوان: دونالد ترامب: سي أن أن تنشر تسجيلا صوتيا للرئيس السابق يقر فيه باحتفاظه بوثيقة سرية | التصنيف: Politics | المقالة: حصلت وسائل إعلام اأمريكية على تسجيل صوتي يبدو فيه أن دونالد ترامب يعترف...",
        "العنوان: الذكاء الاصطناعي يختصر وقت العلاج الإشعاعي للسرطان | التصنيف: Science and Technology | المقالة: تنتظر بريطانيا نوعا جديدا من تقنيات الذكاء الاصطناعي التي تختصر الوقت...",
        "العنوان: ماذا قال ميسي عن جماهير باريس سان جيرمان؟ | التصنيف: Sports | المقالة: قال النجم الأرجنتيني ليونيل ميسي إن علاقته بمشجعي نادي باريس سان جيرمان تصدعت..."
      ],
      "مشاكل_مكتشفة": [
        "فجوة كبيرة بين الحقول التي تدّعيها الورقة البحثية (العنوان، الكلمات المفتاحية، التاريخ والوقت، الموقع، الكاتب، صورة المقالة ووصفها، عدد الزيارات) والحقول المتاحة فعلياً (5 حقول فقط)",
        "وجود تصنيفات خاطئة: مقالات عن كأس العالم والرياضة مصنفة تحت السياسة",
        "حقل الكاتب (Write_By) فارغ في حوالي 51% من العينات",
        "تنسيق التاريخ غير موحد: بعض التواريخ نسبية (قبل 3 ساعة) وأخرى مطلقة (26 يونيو 2023)",
        "وجود مسافات مزدوجة في 84% من المقالات مما يشير إلى عدم تنظيف كافٍ",
        "عارض البيانات على HuggingFace معطل بسبب اختلاف الأعمدة بين ملفات CSV المختلفة (ملف CNN يحتوي Updated Date بدل Write_By)",
        "التصنيفات بالإنجليزية وليست بالعربية رغم أن المجموعة عربية"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "حجم كبير جداً (أكثر من 1.85 مليون مقالة) مما يجعلها من أكبر مجموعات البيانات الإخبارية العربية",
      "النصوص العربية سليمة وخالية من مشاكل الترميز والأحرف المشوهة",
      "تنوع مصادر الأخبار من 9 صحف من دول عربية مختلفة",
      "تغطية 5 تصنيفات موضوعية: سياسة، علوم وتكنولوجيا، رياضة، اقتصاد، فنون",
      "المقالات ذات طول مناسب (متوسط 3818 حرفاً) وغنية بالمحتوى",
      "لا يوجد تكرار واضح في العناوين (500 عنوان فريد من 500 عينة)",
      "منشورة في مجلة علمية محكمة (Neural Computing and Applications)",
      "البيانات متاحة مجاناً على HuggingFace"
    ],
    "نقاط_الضعف": [
      "فجوة كبيرة بين ما تدّعيه الورقة البحثية من حقول غنية (صور، كلمات مفتاحية، موقع جغرافي، عدد زيارات) وما هو متاح فعلياً (5 حقول فقط)",
      "اختلاف هيكل ملفات CSV بين المصادر المختلفة مما يسبب أخطاء في التحميل",
      "حقل الكاتب فارغ في أكثر من نصف العينات",
      "وجود أخطاء في التصنيف مثل تصنيف مقالات رياضية تحت السياسة",
      "تنسيق التاريخ غير موحد بين تواريخ نسبية ومطلقة",
      "الترخيص غير محدد مما يثير تساؤلات حول حقوق الاستخدام",
      "التصنيفات مكتوبة بالإنجليزية",
      "عدم تنظيف كافٍ للنصوص (مسافات مزدوجة منتشرة)"
    ],
    "الاستخدامات_الموصى_بها": [
      "تصنيف النصوص الإخبارية العربية إلى فئات موضوعية",
      "التدريب المسبق لنماذج اللغة العربية على نصوص إخبارية",
      "تحليل المحتوى الإعلامي العربي ودراسات الصحافة الرقمية",
      "بناء أنظمة استرجاع المعلومات وتلخيص الأخبار العربية",
      "دراسات مقارنة بين أساليب التغطية الإخبارية في الصحف العربية المختلفة"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 65,
      "التوثيق": 50,
      "السلامة_الأخلاقية": 70,
      "الترخيص": 25,
      "قابلية_إعادة_الإنتاج": 55,
      "المراجعة_العلمية": 75,
      "جودة_البيانات": 60
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/MohamedZayton/AMINA",
      "https://link.springer.com/content/pdf/10.1007/s00521-024-10277-0.pdf"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2024,
    "Tasks": [
      "topic classification",
      "language modeling"
    ],
    "Form": "text",
    "Volume": 1850000.0,
    "Unit": "documents",
    "License": "unknown",
    "HF Link": "https://huggingface.co/datasets/MohamedZayton/AMINA",
    "Paper Link": "https://link.springer.com/content/pdf/10.1007/s00521-024-10277-0.pdf",
    "Domain": [
      "news articles"
    ],
    "Authors": [
      "Mohamed Zaytoon",
      "Muhannad Bashar",
      "Mohamed A. Khamis",
      "Walid Gomaa"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "journal"
  },
  {
    "slug": "anetac",
    "الاسم": "مجموعة بيانات نقحرة وتصنيف الكيانات المسماة العربية",
    "الاسم_الأصلي": "ANETAC: Arabic Named Entity Transliteration and Classification Dataset",
    "درجة_الجودة": 62,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات متخصصة في نقحرة الكيانات المسماة بين الإنجليزية والعربية، تحتوي على 79,924 عينة مقسمة إلى تدريب (75,907) وتحقق (1,003) واختبار (3,014). كل عينة تتكون من زوج (كيان عربي، نقحرة إنجليزية)، رغم أن الورقة البحثية الأصلية تذكر وجود تصنيف ثالث (شخص/موقع/منظمة) مفقود من نسخة HuggingFace. النقحرة العربية سليمة بشكل عام وتغطي تنوعاً جيداً من الأسماء العالمية، لكن هناك نسبة تكرار ملحوظة (حوالي 15% من الكلمات العربية لها عدة نقحرات مختلفة). المجموعة مفيدة لأبحاث نقحرة الأسماء لكنها ناقصة مقارنة بما تصفه الورقة الأصلية.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 79924,
      "معاينة_العينات": [
        "Arabic: بولك | Transliteration: Bulcke",
        "Arabic: جانوس | Transliteration: Janus",
        "Arabic: نالبانديان | Transliteration: Nalbandian"
      ],
      "مشاكل_مكتشفة": [
        "عمود التصنيف (شخص/موقع/منظمة) المذكور في الورقة البحثية مفقود تماماً من نسخة HuggingFace — البيانات تحتوي فقط على عمودين بدلاً من ثلاثة",
        "وجود 11,643 كلمة عربية مكررة بنقحرات مختلفة (مثلاً: 'كوري' لها 13 نقحرة مختلفة) — هذا قد يكون مقصوداً لكنه يحتاج توضيح",
        "وجود 46 عينة بأسماء قصيرة جداً (حرف أو حرفان فقط مثل 'فو' و'اك') وهي مشكوك في فائدتها",
        "لا يوجد ملف بيانات وصفية (card) على HuggingFace — الـ Repo card metadata مفقود",
        "البيانات الوصفية في ملف JSON تشير إلى ورقة بحثية خاطئة (CheckThat! Lab CLEF 2020) بدلاً من ورقة ANETAC الأصلية",
        "الترخيص مسجل كـ 'unknown' في البيانات الوصفية بينما الورقة تحمل ترخيص CC BY-NC-SA 4.0"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "حجم كبير ومناسب للتدريب مع 79,924 عينة",
      "تقسيم واضح إلى مجموعات تدريب وتحقق واختبار",
      "النصوص العربية سليمة وخالية من التشوه — لم يُلاحظ أي أحرف لاتينية مختلطة في العمود العربي",
      "تنوع جيد في الأسماء يشمل أسماء من ثقافات ولغات مختلفة حول العالم",
      "لا توجد قيم فارغة في أي من العمودين",
      "البيانات متاحة مجاناً على كل من GitHub و HuggingFace",
      "الأزواج (عربي-نقحرة) فريدة بالكامل — لا يوجد تكرار في الأزواج",
      "جودة النقحرة معقولة — مثلاً 'خالد' تُنقحر بشكل صحيح إلى Khalid و Khaled"
    ],
    "نقاط_الضعف": [
      "فقدان عمود التصنيف (شخص/موقع/منظمة) في نسخة HuggingFace وهو جزء أساسي من البيانات حسب الورقة",
      "الملفات الخام على GitHub بتنسيق بسيط (ملفات .ar و .en منفصلة) بدون تصنيفات أيضاً",
      "بعض الأسماء القصيرة جداً (حرف أو حرفان) تبدو غير مفيدة للتدريب",
      "البيانات الوصفية في ملف JSON تحتوي على أخطاء متعددة: ورقة بحثية خاطئة، مؤلفون خاطئون، ملخص لا علاقة له بالمجموعة",
      "لا يوجد توثيق كافٍ على HuggingFace (بطاقة البيانات مفقودة)",
      "الترخيص غير محدد في البيانات الوصفية رغم أن الورقة تذكر CC BY-NC-SA 4.0",
      "بعض النقحرات تبدو غير دقيقة أو غير متسقة في حالة الكلمات متعددة النقحرات"
    ],
    "الاستخدامات_الموصى_بها": [
      "تدريب نماذج نقحرة الأسماء من الإنجليزية إلى العربية والعكس",
      "تقييم أنظمة النقحرة الآلية",
      "بناء قواميس أسماء أعلام ثنائية اللغة",
      "دعم أنظمة استرجاع المعلومات عبر اللغات",
      "تدريب نماذج التسلسل إلى التسلسل على مستوى الأحرف"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 85,
      "التوثيق": 40,
      "السلامة_الأخلاقية": 85,
      "الترخيص": 50,
      "قابلية_إعادة_الإنتاج": 55,
      "المراجعة_العلمية": 65,
      "جودة_البيانات": 60
    },
    "المصادر_المفتوحة": [
      "https://hf.co/datasets/arbml/ANETAC",
      "https://github.com/HadjAmeur/ANETAC-Dataset",
      "https://arxiv.org/abs/1907.03110"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2020,
    "Tasks": [
      "named entity recognition",
      "transliteration"
    ],
    "Form": "text",
    "Volume": 79924.0,
    "Unit": "sentences",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/arbml/ANETAC",
    "Paper Link": "https://arxiv.org/pdf/1907.03110.pdf",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Alberto Barrón-Cedeño",
      "Tamer Elsayed",
      "Preslav Nakov",
      "Giovanni Da San Martino",
      "Maram Hasanain",
      "Reem Suwaileh",
      "Fatima Haouari",
      "Nikolay Babulkov",
      "Bayan Hamdan",
      "Alex Nikolov",
      "Shaden Shaar",
      "Zien Sheikh Ali"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  },
  {
    "slug": "ar_aes",
    "الاسم": "مجموعة بيانات التقييم الآلي للمقالات العربية",
    "الاسم_الأصلي": "AR-AES",
    "درجة_الجودة": 62,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات AR-AES هي أول مورد متاح للعامة لدعم البحث في التقييم الآلي للمقالات باللغة العربية، وتضم 2082 إجابة مقالية من طلاب جامعة أم القرى بمكة المكرمة عبر أربعة مقررات أكاديمية. تتميز بتوفير تقييمات من مقيّمَين مستقلَّين مع معايير تقييم شفافة قائمة على الروبريك. غير أن الفحص الفعلي كشف عن مشاكل ملحوظة تشمل: وجود 36 سجلاً فارغاً بالكامل، و771 مقالة مكررة النص بالضبط، ونسبة كبيرة من الدرجات المفقودة خاصة للمقيّم الثاني (702 درجة مفقودة). كما أن نسبة الاتفاق بين المقيّمَين كانت متواضعة (22.6% تطابق تام فقط)، مما يثير تساؤلات حول موثوقية التقييم البشري ذاته.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 2082,
      "معاينة_العينات": [
        "Q1 | Introduction to Information Science | المعلومات هي ناتجة تجهيز البيانات كالخبر وقاعدة البيانات والتحليل , البيانات هي المادة الخام كرموز والتعليقات يمكن للانسان تفسيرها او حلها | Score_A=2.5 | Score_B=2.0",
        "Q1 | Introduction to Information Science | البيانات : هي الارقام او الجمل التي يمكن للانسان ان يفسرها مثل: ارقام الهاتف المعلومات : هي نتايج تجهيز التفسيرات او البيانات وتعليلها | Score_A=1.5 | Score_B=2.5",
        "Q1 | Introduction to Information Science | البيانات او الداتا هي المادة الخام المسجلة ك رموز اوهي ارقام او جمل او عبارات يمكن للانسان تفسيرها او تعبيرها المعلومات نتكون نتيجة تجهيز البيانات مثل النقل والاختيار | Score_A=3.5 | Score_B=5.0"
      ],
      "مشاكل_مكتشفة": [
        "وجود 36 سجلاً فارغاً بالكامل بدون معرّف سؤال أو اسم مقرر أو جنس أو نوع اختبار",
        "وجود 771 مقالة مكررة النص بالضبط، بعضها مكرر حتى 5 مرات — وهذا يمثل نسبة كبيرة من إجمالي البيانات",
        "702 درجة مفقودة للمقيّم الثاني (Final_Score_B) من أصل 2082 سجلاً، أي أن ثلث البيانات تقريباً بدون تقييم ثانٍ",
        "131 درجة مفقودة للمقيّم الأول (Final_Score_A)، مما يعني وجود سجلات بدون أي تقييم",
        "عدد كبير من حقول الروبريك الفارغة: Rubric_B4 فارغ في 1767 سجلاً و Rubric_A4 فارغ في 1651 سجلاً",
        "أسماء الحقول غير متسقة: يوجد مسافة زائدة قبل بعض أسماء الأعمدة مثل ' Final_Score_A' و 'Rubric_A2 '",
        "نسبة التطابق التام بين المقيّمَين منخفضة جداً (22.6%) مع متوسط فرق 1.07 نقطة وأقصى فرق 5 نقاط",
        "عدم التوازن الكبير بين الجنسين: 1662 ذكراً مقابل 384 أنثى",
        "وجود 3 مقالات قصيرة جداً (أقل من 20 حرفاً) قد لا تمثل إجابات حقيقية"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "أول مجموعة بيانات متاحة للعامة للتقييم الآلي للمقالات العربية، مما يسد فجوة مهمة في البحث العربي",
      "تغطية أربعة مقررات أكاديمية متنوعة: مقدمة في علوم المعلومات، نظم المعلومات الإدارية، الكيمياء البيئية، والتقنية الحيوية",
      "توفير معايير تقييم شفافة (روبريك) باللغتين العربية والإنجليزية مع إجابات نموذجية مرجعية",
      "تضمين بيانات وصفية غنية: الجنس، نوع الاختبار (تقليدي/إلكتروني)، معرّف المجموعة",
      "ترخيص مفتوح CC BY 4.0 يسمح بالاستخدام الحر بما فيه التجاري",
      "النصوص العربية مقروءة وسليمة بشكل عام وتمثل إجابات طلابية حقيقية بأساليب متنوعة"
    ],
    "نقاط_الضعف": [
      "الوصف يذكر 2046 مقالة لكن البيانات الفعلية تحتوي على 2082 سجلاً منها 36 فارغاً تماماً — عدم تطابق بين الوصف والواقع",
      "نسبة تكرار مرتفعة جداً: 771 مقالة مكررة النص بالضبط من أصل حوالي 2046 مقالة فعلية",
      "ثلث البيانات تقريباً بدون تقييم من المقيّم الثاني، مما يحد من إمكانية دراسة الاتفاق بين المقيّمين",
      "حقول الروبريك التفصيلية فارغة في نسبة كبيرة جداً من السجلات (أكثر من 80% لبعض الحقول)",
      "عدم توازن واضح بين الجنسين (81% ذكور) وبين المقررات (مقرر واحد يمثل 40% من البيانات)",
      "لا يوجد تقسيم رسمي للبيانات إلى مجموعات تدريب واختبار",
      "أسماء الأعمدة تحتوي على مسافات زائدة مما يسبب مشاكل تقنية عند المعالجة",
      "الورقة منشورة كمسودة أولية على arXiv فقط ولم تُراجَع في مؤتمر أو مجلة محكّمة"
    ],
    "الاستخدامات_الموصى_بها": [
      "البحث في التقييم الآلي للمقالات العربية كنقطة انطلاق أولى مع الحذر من مشاكل الجودة",
      "تدريب وتقييم نماذج اللغة العربية مثل AraBERT على مهمة تقييم الإجابات المقالية بعد تنظيف البيانات المكررة والفارغة",
      "دراسة موثوقية التقييم البشري والاتفاق بين المقيّمين في السياق الأكاديمي العربي",
      "أبحاث تحليل النصوص الطلابية العربية ودراسة الفروق بين أنماط الاختبارات التقليدية والإلكترونية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 85,
      "التوثيق": 65,
      "السلامة_الأخلاقية": 75,
      "الترخيص": 90,
      "قابلية_إعادة_الإنتاج": 50,
      "المراجعة_العلمية": 35,
      "جودة_البيانات": 45
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/Rnghazawi-NLP/AR-AES",
      "https://arxiv.org/abs/2407.11212"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2024,
    "Tasks": [
      "answer grading"
    ],
    "Form": "text",
    "Volume": 2046.0,
    "Unit": "documents",
    "License": "CC BY 4.0",
    "HF Link": "https://huggingface.co/datasets/Rnghazawi-NLP/AR-AES",
    "Paper Link": "https://arxiv.org/pdf/2407.11212",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Rayed Ghazawi",
      "Edwin Simpson"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "preprint"
  },
  {
    "slug": "arabic_billion_words",
    "الاسم": "مليار كلمة عربية (مجموعة أبو الخير)",
    "الاسم_الأصلي": "Arabic Billion Words (Abu El-Khair Corpus)",
    "درجة_الجودة": 62,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات نصية عربية ضخمة تضم أكثر من خمسة ملايين مقالة صحفية بإجمالي يتجاوز مليار ونصف كلمة، جُمعت من عشر صحف كبرى في ثماني دول عربية على مدار أربعة عشر عاماً. النصوص العربية الفعلية التي فُحصت سليمة لغوياً وواضحة البنية، وتتضمن حقولاً منظمة (رابط، عنوان، تاريخ، نص كامل). لكن المجموعة تعاني من مشاكل خطيرة في إمكانية الوصول: الموقع الأصلي (abuelkhair.net) لم يعد متاحاً حيث تحوّل إلى موقع غير ذي صلة، ونسخة HuggingFace الرسمية تعتمد على سكريبت تحميل قديم لم يعد مدعوماً، مما يجعل الوصول للبيانات ممكناً فقط عبر نسخ غير رسمية. الترخيص غير محدد، والورقة البحثية منشورة كمسودة على arXiv دون مراجعة علمية رسمية.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 500,
      "معاينة_العينات": [
        "العنوان: بن غليطة: 396 شركة معتمدة لدى التنظيم العقاري في دبي | النص: أكد المهندس مروان بن غليطة المدير التنفيذي لمؤسسة التنظيم العقاري بدبي أن استخدام العقوبات والغرامات المنصوص عليها في القانون ضد الشركات العقارية غير المسجلة...",
        "العنوان: الإمارات ونيبال توقعان مذكرة تفاهم للنقل الجوي | النص: وقعت الإمارات مذكرة تفاهم للنقل الجوي مع جمهورية نيبال في كاتماندو مؤخرا، تقضي بزيادة عدد الرحلات الجوية للناقلات الوطنية لكلا البلدين...",
        "العنوان: مصرع وإصابة 59 مصرياً بحادث سير | النص: لقي 19 مصريا مصرعهم وأصيب 40 آخرون أمس في حادث تصادم حافلة عمومية بسيارة نقل على طريق القاهرة - اسوان الزراعية..."
      ],
      "مشاكل_مكتشفة": [
        "الموقع الأصلي (abuelkhair.net) تحوّل إلى موقع قمار إلكتروني ولم يعد يستضيف البيانات",
        "نسخة HuggingFace الرسمية تعتمد على سكريبت تحميل بايثون قديم غير مدعوم في الإصدارات الحديثة من مكتبة datasets",
        "لا توجد ملفات بيانات فعلية (parquet أو csv) على المستودع الرسمي، فقط سكريبت التحميل",
        "تم الوصول للبيانات فقط عبر نسخة غير رسمية (MohamedRashad/arabic-billion-words) وليس المصدر الأصلي",
        "أول 500 عينة كلها من مصدر واحد فقط (جريدة الاتحاد الإماراتية) مما يشير لعدم خلط البيانات بين المصادر",
        "الترخيص غير محدد مما يثير مخاوف قانونية حول إعادة الاستخدام",
        "وجود علامات اقتباس مكررة ('''' بدلاً من \") في بعض النصوص تشير لمشاكل في استخلاص XML",
        "حقل التاريخ يحتوي على نص وصفي كامل (مثل: تاريخ النشر: الثلاثاء 01 يناير 2008) بدلاً من تنسيق تاريخ معياري"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "حجم ضخم جداً: أكثر من 5 ملايين مقالة ومليار ونصف كلمة، مما يجعلها من أكبر المجموعات العربية",
      "النصوص العربية سليمة لغوياً وواضحة في العينات المفحوصة (500 عينة بدون نصوص فارغة أو مشوهة)",
      "تنوع جغرافي: تغطي 10 صحف من 8 دول عربية مختلفة (الإمارات، مصر، السعودية، الكويت، لبنان، سوريا، الجزائر، اليمن)",
      "بنية منظمة: كل مقالة تحتوي على رابط وعنوان وتاريخ ونص كامل",
      "تغطية زمنية واسعة تمتد لأربعة عشر عاماً",
      "لا تكرارات ملحوظة في الروابط ضمن العينة المفحوصة (500 رابط فريد)"
    ],
    "نقاط_الضعف": [
      "مشكلة حرجة في إمكانية الوصول: المصدر الأصلي (abuelkhair.net) لم يعد متاحاً وتحوّل لموقع غير ذي صلة",
      "نسخة HuggingFace الرسمية معطلة فعلياً بسبب اعتمادها على سكريبت تحميل غير مدعوم",
      "الترخيص غير محدد، مما يخلق غموضاً قانونياً حول حقوق الاستخدام وإعادة التوزيع",
      "الورقة البحثية مسودة arXiv فقط ولم تخضع لمراجعة علمية رسمية",
      "البيانات غير مخلوطة: العينات الأولى كلها من مصدر واحد، مما قد يسبب انحيازاً في النمذجة",
      "تنسيق حقل التاريخ غير معياري ويحتاج لمعالجة إضافية",
      "لا يوجد تقسيم للبيانات (train/test/validation)",
      "لا توجد أي تعليقات توضيحية أو تصنيفات - نصوص خام فقط",
      "وجود أخطاء في استخلاص XML: علامات اقتباس مكررة في بعض النصوص"
    ],
    "الاستخدامات_الموصى_بها": [
      "التدريب المسبق لنماذج اللغة العربية (language modeling)",
      "بناء تمثيلات كلمات عربية (word embeddings)",
      "التحليل الإحصائي للغة العربية المعاصرة",
      "تدريب نماذج ملء القناع (masked language modeling)",
      "أبحاث اللسانيات الحاسوبية العربية",
      "استخلاص المعلومات والتعرف على الكيانات المسماة (بعد إضافة تعليقات توضيحية)"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 30,
      "التوثيق": 55,
      "السلامة_الأخلاقية": 65,
      "الترخيص": 20,
      "قابلية_إعادة_الإنتاج": 25,
      "المراجعة_العلمية": 40,
      "جودة_البيانات": 72
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/abuelkhair-corpus/arabic_billion_words",
      "https://huggingface.co/datasets/MohamedRashad/arabic-billion-words",
      "https://arxiv.org/abs/1611.04033",
      "https://www.abuelkhair.net/",
      "https://huggingface.co/datasets/abuelkhair-corpus/arabic_billion_words/raw/main/arabic_billion_words.py"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2016,
    "Tasks": [
      "language modeling"
    ],
    "Form": "text",
    "Volume": 5222973.0,
    "Unit": "documents",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/abuelkhair-corpus/arabic_billion_words",
    "Paper Link": "https://arxiv.org/ftp/arxiv/papers/1611/1611.04033.pdf",
    "Domain": [
      "news articles"
    ],
    "Authors": [
      "I. A. El-Khair"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "preprint"
  },
  {
    "slug": "arabic_keyphrase_dataset",
    "الاسم": "مجموعة بيانات الكلمات المفتاحية العربية",
    "الاسم_الأصلي": "Arabic Keyphrase dataset",
    "درجة_الجودة": 62,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات عربية متخصصة في استخراج الكلمات المفتاحية تلقائياً، تحتوي على 400 مستند مُجمَّع من ويكيبيديا العربية (365 مقالة) ومبادرة الملك عبدالله للمحتوى العربي (35 مقالة طبية)، موزعة على 18 فئة موضوعية مختلفة. تم استخراج 10 كلمات مفتاحية لكل مستند يدوياً بواسطة 6 قراء مع مراجعة تحققية لاحقة. النصوص العربية سليمة لغوياً بشكل عام كونها مأخوذة من ويكيبيديا، لكن توجد مشاكل تنظيفية ملحوظة: جميع الملفات تحتوي حرف BOM، و303 مستند من 400 تحتفظ بتنسيقات ويكي مثل الأقواس المزدوجة وعلامات العناوين. المجموعة صغيرة الحجم نسبياً (400 مستند فقط) وتفتقر إلى تقسيم رسمي للاختبار والتدريب، لكنها تُعد من أوائل المجموعات المتاحة للعربية في هذا المجال وقد استُشهد بها في أبحاث لاحقة.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 400,
      "معاينة_العينات": [
        "الذئب الرمادي، الذي يُعرف أيضًا بأسماء متعددة مثل ذئب الغياض، الذئب الأشهب... | الكلمات المفتاحية: الذئب الرمادي، فصيلة الكلبيات، العصر الجليدي، الكلاب المستأنسة، الثدييات، السلالات...",
        "المها أو الوضيحي هو جنس من الظباء الصحراوية التي تقطن شبه الجزيرة العربية وأجزاء مختلفة من قارة أفريقيا... | الكلمات المفتاحية: المها، مها أبو حراب، شبه الجزيرة العربية، الظباء الصحراوية...",
        "الفهد أو النمر الصيّاد هو نوع فريد من فصيلة السنوريات، يتميز بسرعة فائقة لا ينازعه فيها أحد... | الكلمات المفتاحية: الفهد، فصيلة السنوريات، سرعة فائقة، الانتشار، السلالات..."
      ],
      "مشاكل_مكتشفة": [
        "جميع الملفات الـ400 تحتوي حرف BOM (علامة ترتيب البايت) في بداية النصوص والكلمات المفتاحية",
        "303 مستند من 400 تحتفظ بتنسيقات ويكيبيديا مثل [[عناوين]] و== أقسام == دون تنظيف كامل",
        "7% من الكلمات المفتاحية (277 من 3956) غير موجودة حرفياً في نص المستند المقابل",
        "106 كلمات مفتاحية عامة جداً مكونة من 4 حروف أو أقل مثل 'مصر' و'روما' و'كندا'",
        "بعض الكلمات المفتاحية تبدو عامة وغير محددة مثل 'الحياة' و'الألوان' و'المراحل'",
        "التوزيع غير متوازن بين الفئات: من 3 مستندات (طعام) إلى 59 مستنداً (شخصيات ودول)",
        "حقل التصنيف (label) يحتوي أرقاماً فقط (0-17) دون وصف نصي للفئات",
        "لا يوجد تقسيم رسمي للتدريب والاختبار"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "النصوص العربية سليمة لغوياً ومكتوبة بالعربية الفصحى الحديثة كونها مأخوذة من ويكيبيديا",
      "لا يوجد تكرار في المستندات — جميع الـ400 مستند فريدة",
      "تغطية موضوعية واسعة عبر 18 فئة مختلفة تشمل التاريخ والعلوم والتقنية والصحة وغيرها",
      "كل مستند يحتوي بالضبط 8-11 كلمات مفتاحية بمتوسط 9.9، مما يدل على اتساق التعليق التوضيحي",
      "93% من الكلمات المفتاحية موجودة فعلياً في النصوص مما يؤكد دقة الاستخراج",
      "التعليق التوضيحي تم بواسطة 6 قراء بشريين مع خطوة تحقق ومراجعة لاحقة",
      "البيانات متاحة مجاناً على GitHub وHuggingFace مما يسهل الوصول إليها",
      "تنوع كبير في أطوال المستندات من 651 حرفاً إلى 102,939 حرفاً بمتوسط 24,513 حرفاً",
      "من أوائل مجموعات البيانات العربية المخصصة لاستخراج الكلمات المفتاحية"
    ],
    "نقاط_الضعف": [
      "حجم المجموعة صغير نسبياً (400 مستند فقط) مقارنة بالمجموعات الإنجليزية المماثلة",
      "عدم تنظيف تنسيقات ويكيبيديا بشكل كامل في أغلب المستندات",
      "وجود حرف BOM في جميع الملفات مما يتطلب معالجة مسبقة",
      "بعض الكلمات المفتاحية عامة وغير محددة ولا تعكس المحتوى الجوهري للمستند",
      "التوزيع غير المتوازن بين الفئات قد يؤثر على أداء النماذج",
      "لا يوجد تقسيم رسمي للتدريب والاختبار ضمن البيانات المتاحة",
      "الترخيص غير محدد مما يُصعّب الاستخدام التجاري",
      "الورقة البحثية قصيرة (6 صفحات) ونُشرت في مؤتمر محدود الانتشار",
      "لا توجد معلومات عن اتفاق المقيّمين (inter-annotator agreement)"
    ],
    "الاستخدامات_الموصى_بها": [
      "تقييم خوارزميات استخراج الكلمات المفتاحية من النصوص العربية",
      "مجموعة اختبار مرجعية للأبحاث في مجال معالجة اللغة العربية الطبيعية",
      "تدريب وتقييم نماذج تعلم الآلة لاستخراج العبارات المفتاحية العربية",
      "دراسة مقارنة بين أداء خوارزميات الاستخراج المختلفة على النصوص العربية",
      "استخدامها كمجموعة اختبار (وليس تدريب) نظراً لحجمها الصغير، مع بناء مجموعات تدريب أكبر"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 85,
      "التوثيق": 55,
      "السلامة_الأخلاقية": 90,
      "الترخيص": 25,
      "قابلية_إعادة_الإنتاج": 60,
      "المراجعة_العلمية": 45,
      "جودة_البيانات": 60
    },
    "المصادر_المفتوحة": [
      "https://hf.co/datasets/arbml/Keyphrase_Extraction",
      "https://github.com/logmani/ArabicDataset",
      "https://airccj.org/CSCP/vol7/csit76321.pdf"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2017,
    "Tasks": [
      "keyphrase extraction"
    ],
    "Form": "text",
    "Volume": 400.0,
    "Unit": "documents",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/arbml/Keyphrase_Extraction",
    "Paper Link": "https://airccj.org/CSCP/vol7/csit76321.pdf",
    "Domain": [
      "news articles"
    ],
    "Authors": [
      "Mohammed Al Logmani",
      "Husni Al Muhtaseb"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  },
  {
    "slug": "arabic_named_entity_gazetteer",
    "الاسم": "القاموس الجغرافي للكيانات المسماة العربية",
    "الاسم_الأصلي": "Arabic Named Entity Gazetteer (WikiFANEGazet)",
    "درجة_الجودة": 62,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات تتكون من 68,355 كياناً مسماةً عربياً مصنفاً في 53 فئة فرعية دقيقة (ضمن 8 فئات رئيسية: أشخاص، مواقع جغرافية-سياسية، منظمات، منتجات، منشآت، مواقع طبيعية، مركبات، أسلحة)، تم استخلاصها تلقائياً من ويكيبيديا العربية. البيانات عبارة عن قاموس جغرافي (gazetteer) وليست مجموعة نصوص مشروحة تقليدية؛ حيث يحتوي كل سجل على اسم كيان واحد محاط بوسم XML يحدد نوعه. تمتلك المجموعة قيمة بحثية كمورد مساعد لأنظمة التعرف على الكيانات المسماة العربية، لكنها تعاني من بعض مشاكل الجودة كوجود أسماء غير عربية وتصنيفات خاطئة واستخدام الشرطة السفلية بدل المسافات، وهو ما يحد من قابلية استخدامها المباشر.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 68355,
      "معاينة_العينات": [
        "<PER_Athlete>‎لاديفانص</PER_Athlete>",
        "<PER_Artist>‎جوستاف_لوبون</PER_Artist>",
        "<GPE_Population-Center>‎حي_أول_المحلة</GPE_Population-Center>"
      ],
      "مشاكل_مكتشفة": [
        "جميع أسماء الكيانات تستخدم الشرطة السفلية (_) بدلاً من المسافات، مما يجعلها تشبه عناوين صفحات ويكيبيديا الخام وليست نصوصاً طبيعية (53,940 من 68,355 سجل)",
        "وجود 231 كياناً بأسماء غير عربية بالكامل (مثل: Pleasantville، Crash، X11) دون ترجمة أو تعريب",
        "وجود 25 حالة تصنيف خاطئ محتمل: كيانات مصنفة كأشخاص لكنها في الواقع قوائم أو بطولات أو اتحادات (مثل: 'ممثلون_شكسبيريون' مصنف كـ PER_Artist)",
        "وجود 24 كياناً بأسماء قصيرة جداً (حرفان فقط) مثل 'لا' و'غد' و'بك' و'جو'، وهي أسماء غامضة يصعب استخدامها كمعرفات فريدة",
        "جميع السجلات تحتوي على علامة اتجاه النص من اليسار (‎U+200E) في بداية اسم الكيان، وهي بقايا تقنية من المعالجة",
        "بطاقة البيانات على HuggingFace فارغة تقريباً ولا تحتوي على وصف أو توثيق",
        "البنية بسيطة للغاية: عمود نصي واحد فقط يحتوي على الكيان والوسم معاً، دون فصل بين الاسم والتصنيف في حقول منفصلة"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "تغطية واسعة بـ 68,355 كياناً مسماةً عربياً، وهو حجم مناسب لقاموس جغرافي",
      "تصنيف دقيق ومتعدد المستويات يشمل 53 فئة فرعية ضمن 8 فئات رئيسية، وهو أكثر تفصيلاً من معظم مجموعات الكيانات المسماة العربية",
      "لا يوجد أي تكرار في البيانات (0 سجلات مكررة من أصل 68,355)",
      "بنية الوسوم XML متسقة تماماً: لا توجد وسوم غير متطابقة أو تالفة",
      "مرتبطة بورقة بحثية محكّمة منشورة في مؤتمر IJCNLP الدولي",
      "متاحة مجاناً بترخيص CC BY 3.0 على كل من SourceForge و HuggingFace",
      "التوزيع بين الفئات الرئيسية معقول: الأشخاص (30,821)، المواقع الجغرافية-السياسية (20,785)، المنظمات (6,664)، المنتجات (5,684)"
    ],
    "نقاط_الضعف": [
      "البيانات قاموس كيانات فقط وليست مجموعة نصوص مشروحة سياقياً، مما يحد من فائدتها في تدريب نماذج التعرف على الكيانات المسماة بشكل مباشر",
      "أسماء الكيانات بصيغة عناوين ويكيبيديا الخام (بالشرطة السفلية)، وتحتاج معالجة مسبقة لتحويلها إلى نصوص طبيعية",
      "وجود أخطاء تصنيف ناتجة عن الاستخلاص التلقائي: كيانات غير شخصية مصنفة كأشخاص، وقوائم وبطولات واتحادات مصنفة خطأً",
      "غياب التوثيق على منصة HuggingFace: لا يوجد وصف أو تعريف بالمهام أو إرشادات الاستخدام",
      "البيانات قديمة نسبياً (2013) وآخر تحديث على SourceForge كان في 2014، مما يعني غياب الكيانات الحديثة",
      "لا يوجد تقسيم للبيانات إلى مجموعات تدريب واختبار وتطوير",
      "بعض التصنيفات الفرعية غير واضحة أو غير بديهية (مثل WEA_Sharp للصواريخ، PRO_Sound للفرق الموسيقية)"
    ],
    "الاستخدامات_الموصى_بها": [
      "كمورد مساعد (قاموس بحث) لتعزيز أداء أنظمة التعرف على الكيانات المسماة العربية الموجودة",
      "لبناء قوائم كيانات مرجعية في مجالات محددة (أسماء أماكن، أسماء أشخاص، منظمات)",
      "كنقطة انطلاق لبناء مجموعات بيانات أكثر شمولاً للكيانات المسماة العربية مع إضافة سياق نصي",
      "في أنظمة استرجاع المعلومات العربية لتحديد وتصنيف الكيانات المسماة في النصوص",
      "كمرجع لتقييم تغطية أنظمة التعرف على الكيانات المسماة العربية عبر فئات مختلفة"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 85,
      "التوثيق": 35,
      "السلامة_الأخلاقية": 85,
      "الترخيص": 90,
      "قابلية_إعادة_الإنتاج": 60,
      "المراجعة_العلمية": 70,
      "جودة_البيانات": 55
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/WikiFANEGazet",
      "https://aclanthology.org/I13-1045/",
      "https://sourceforge.net/projects/arabic-named-entity-gazetteer/"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2013,
    "Tasks": [
      "named entity recognition",
      "information retrieval"
    ],
    "Form": "text",
    "Volume": 68355.0,
    "Unit": "tokens",
    "License": "CC BY 3.0",
    "HF Link": "https://hf.co/datasets/arbml/WikiFANEGazet",
    "Paper Link": "https://aclanthology.org/I13-1045/",
    "Domain": [
      "wikipedia"
    ],
    "Authors": [
      "Fahd Alotaibi",
      "Mark Lee"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  },
  {
    "slug": "arabic_news_articles_from_aljazeera_net",
    "الاسم": "مقالات إخبارية عربية من الجزيرة نت",
    "الاسم_الأصلي": "Arabic News articles from Aljazeera.net",
    "درجة_الجودة": 62,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات تضم 5,870 مقالة إخبارية عربية مستخرجة من موقع الجزيرة نت بطريقة الزحف الآلي، تغطي فترة 2019-2020. تتميز البيانات بجودة نصية عالية حيث بلغ متوسط نسبة الأحرف العربية 96% مع عدم وجود تكرارات أو نصوص مشوهة في العينات المفحوصة. تشمل المقالات مواضيع متنوعة كالسياسة والاقتصاد والصحة ونمط الحياة، مع حقول غنية تتضمن العنوان والمحتوى الكامل والوسوم والمصدر. رغم جودة المحتوى النصي، تعاني المجموعة من غياب ورقة بحثية مرافقة وتوثيق ضعيف وترخيص غير محدد وحجم صغير نسبياً.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 1000,
      "معاينة_العينات": [
        "العنوان: الجيش التركي يعلن جاهزيته للعبور إلى ليبيا.. المعارك تتجدد بطرابلس وقوات حفتر تتراجع | المحتوى: تجددت المعارك اليوم الجمعة بمحيط العاصمة الليبية طرابلس، وأفادت التقارير بتراجع قوات اللواء المتقاعد خليفة حفتر...",
        "العنوان: محمد علي يعلن وثيقة \"التوافق المصري\" تمهيدا لإسقاط السيسي | المحتوى: كشف الفنان والمقاول المصري المعارض محمد علي عن وثيقة التوافق المصري التي أعلن في مؤتمر لندن...",
        "العنوان: من الحلم إلى الشارع.. قصة مشروع السيارة التركية | المحتوى: شهدت تركيا اليوم الجمعة الإعلان رسميا عن ميلاد سيارتها الوطنية الأولى في حفل كبير أقامته مجموعة مشروع السيارة التركية..."
      ],
      "مشاكل_مكتشفة": [
        "لا توجد ورقة بحثية مرافقة تصف منهجية جمع البيانات وضمان جودتها",
        "الترخيص غير محدد بوضوح مما يثير تساؤلات حول حقوق الاستخدام",
        "لا يوجد تقسيم للبيانات إلى مجموعات تدريب واختبار",
        "التغطية الزمنية محدودة بفترة 2019-2020 فقط",
        "حجم المجموعة صغير نسبياً (5,870 مقالة) مقارنة بمجموعات بيانات أخبار أخرى",
        "3 عينات من أصل 1000 بدون وسوم (حقل tags فارغ)",
        "لا يوجد تصنيف موضوعي واضح للمقالات (فئات مثل سياسة، رياضة، اقتصاد)"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "جودة نصية عالية جداً: لم يُكتشف أي نص مشوه أو خطأ ترميز في 1000 عينة مفحوصة",
      "عدم وجود تكرارات: جميع العناوين والمعرفات فريدة في العينات المفحوصة",
      "نسبة أحرف عربية مرتفعة (متوسط 96%) مما يدل على نظافة البيانات",
      "حقول غنية ومتنوعة: معرف فريد، تاريخ النشر، عنوان، وصف، محتوى كامل، مصدر، وسوم",
      "مصدر موثوق: جميع المقالات من موقع الجزيرة نت وهو مصدر إعلامي معروف",
      "تنوع في المواضيع المغطاة: سياسة، صحة، تقنية، رياضة، ثقافة",
      "متاح على منصتين: Kaggle و HuggingFace مما يسهل الوصول",
      "محتوى كامل وليس مجرد عناوين أو مقتطفات (متوسط طول المحتوى حوالي 3000 حرف)"
    ],
    "نقاط_الضعف": [
      "غياب تام لورقة بحثية مرافقة تصف المنهجية",
      "ترخيص غير محدد: يثير تساؤلات قانونية حول حقوق إعادة الاستخدام التجاري",
      "حجم صغير نسبياً (5,870 مقالة) غير كافٍ لتدريب نماذج لغوية كبيرة",
      "تغطية زمنية ضيقة محصورة في 2019-2020",
      "لا يوجد تقسيم رسمي للبيانات (train/test/validation)",
      "توثيق ضعيف على كلتا المنصتين: لا يوجد وصف تفصيلي لعملية الجمع والتصفية",
      "لا يوجد تصنيف موضوعي منظم رغم تنوع المحتوى",
      "عدم وجود انتماء أكاديمي للمؤلف مما يقلل من المصداقية العلمية"
    ],
    "الاستخدامات_الموصى_بها": [
      "نمذجة اللغة العربية وتدريب نماذج لغوية على نصوص إخبارية",
      "تلخيص النصوص العربية الإخبارية باستخدام حقلي المحتوى والوصف",
      "التعرف على الكيانات المسماة في النصوص الإخبارية العربية",
      "تصنيف المقالات الإخبارية العربية حسب الموضوع",
      "تدريب نماذج تضمين الكلمات العربية (Word Embeddings)",
      "تحليل المحتوى الإعلامي للجزيرة خلال فترة 2019-2020"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 85,
      "التوثيق": 30,
      "السلامة_الأخلاقية": 65,
      "الترخيص": 20,
      "قابلية_إعادة_الإنتاج": 40,
      "المراجعة_العلمية": 10,
      "جودة_البيانات": 80
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/news_articles_aljazeera",
      "https://www.kaggle.com/datasets/arhouati/arabic-news-articles-from-aljazeeranet"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2020,
    "Tasks": [
      "language modeling"
    ],
    "Form": "text",
    "Volume": 5870.0,
    "Unit": "documents",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/arbml/news_articles_aljazeera",
    "Paper Link": "",
    "Domain": [
      "news articles"
    ],
    "Authors": [
      "ABDELKADER RHOUATI"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": ""
  },
  {
    "slug": "arabic_nli_pair",
    "الاسم": "أزواج الاستدلال اللغوي الطبيعي العربي",
    "الاسم_الأصلي": "Arabic-NLi-Pair",
    "درجة_الجودة": 62,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات عربية مترجمة آلياً من مجموعتي SNLI وMultiNLI الإنجليزيتين الشهيرتين، تحتوي على حوالي 327,954 زوج من الجمل (anchor وpositive) مخصصة لمهام التشابه الدلالي النصي والاستدلال اللغوي الطبيعي. النصوص العربية مفهومة بشكل عام لكنها تعاني من أخطاء نحوية وصرفية ناتجة عن الترجمة الآلية، مثل عدم مطابقة الجمع والتأنيث والتذكير. المجموعة مفيدة لتدريب نماذج التضمين الدلالي العربية رغم أنها تفتقر إلى تصنيفات NLI الأصلية (entailment/contradiction/neutral) وتقتصر على أزواج متشابهة فقط، مما يحدّ من استخدامها في مهام الاستدلال اللغوي الكاملة.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 5000,
      "معاينة_العينات": [
        "anchor: شخص على حصان يقفز فوق طائرة معطلة | positive: شخص في الهواء الطلق، على حصان.",
        "anchor: أطفال يبتسمون و يلوحون للكاميرا | positive: هناك أطفال حاضرون",
        "anchor: صبي يقفز على لوح التزلج في منتصف الجسر الأحمر. | positive: الفتى يقوم بخدعة التزلج"
      ],
      "مشاكل_مكتشفة": [
        "أخطاء نحوية ناتجة عن الترجمة الآلية، مثل: 'امرأتين شقراوات' بدلاً من 'امرأتان شقراوان'، و'الطريق تطور حفرة كبيرة' وهي جملة ركيكة",
        "وجود نص غير عربي في بعض العينات، مثل عينة تحتوي على نص إيطالي: 'STAI GUARDANO GRATIS IL PAVITMENTO'",
        "وجود 24 زوجاً مكرراً في أول 5000 عينة (نسبة تكرار حوالي 0.5%)",
        "غياب تصنيفات الاستدلال اللغوي الأصلية (entailment/contradiction/neutral) رغم أن الاسم يشير إلى NLI",
        "بعض الترجمات حرفية وغير طبيعية في السياق العربي، مثل: 'عائلة أجنبية تسير على طريق ترابي' حيث كلمة 'أجنبية' لا معنى لها بدون سياق مرجعي",
        "أخطاء في صيغ الجمع والمثنى والتأنيث منتشرة بسبب طبيعة الترجمة الآلية"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "حجم كبير يبلغ حوالي 327,954 زوج من الجمل، مما يوفر بيانات تدريب كافية",
      "سهولة الوصول عبر مكتبة datasets مع دعم البث المباشر (streaming)",
      "تقسيم واضح إلى مجموعات تدريب (314,000) وتحقق (6,810) واختبار (6,830)",
      "النصوص العربية مفهومة وقابلة للقراءة رغم الأخطاء النحوية",
      "ترخيص Apache 2.0 مفتوح يسمح بالاستخدام التجاري والبحثي",
      "مشتقة من مجموعتي SNLI وMultiNLI المعروفتين والموثقتين جيداً",
      "تنوع جيد في المواضيع المغطاة (أنشطة يومية، رياضة، طبيعة، وغيرها)"
    ],
    "نقاط_الضعف": [
      "الترجمة آلية بالكامل دون مراجعة بشرية واضحة، مما يؤدي إلى أخطاء نحوية وصرفية",
      "غياب تصنيفات NLI الأصلية (الاستلزام/التناقض/الحياد)، فالبيانات تحتوي فقط على أزواج متشابهة",
      "الورقة البحثية منشورة كمسودة على arXiv فقط ولم تخضع لمراجعة أقران رسمية",
      "لا يوجد توثيق لطريقة الترجمة المستخدمة أو تقييم لجودتها",
      "وجود شوائب لغوية مثل نصوص غير عربية لم تُنظّف",
      "عدم توفر الأزواج السلبية (negative pairs) مما يحدّ من فائدة المجموعة في التعلم التقابلي الكامل",
      "بعض الترجمات حرفية وتفتقر إلى الطبيعية في السياق العربي"
    ],
    "الاستخدامات_الموصى_بها": [
      "تدريب نماذج التضمين الدلالي العربية (Arabic Sentence Embeddings)",
      "التدريب المسبق أو الضبط الدقيق لنماذج التشابه النصي الدلالي",
      "استخدامها كبيانات تدريب أولية مع تنظيف إضافي للأخطاء النحوية",
      "مهام استرجاع المعلومات والبحث الدلالي باللغة العربية",
      "لا يُنصح باستخدامها مباشرة لمهام الاستدلال اللغوي الطبيعي الكامل بسبب غياب التصنيفات"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 92,
      "التوثيق": 50,
      "السلامة_الأخلاقية": 85,
      "الترخيص": 95,
      "قابلية_إعادة_الإنتاج": 55,
      "المراجعة_العلمية": 35,
      "جودة_البيانات": 58
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/Omartificial-Intelligence-Space/Arabic-NLi-Pair",
      "https://arxiv.org/abs/2407.21139"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2024,
    "Tasks": [
      "natural language inference"
    ],
    "Form": "text",
    "Volume": 327954.0,
    "Unit": "sentences",
    "License": "Apache-2.0",
    "HF Link": "https://huggingface.co/datasets/Omartificial-Intelligence-Space/Arabic-NLi-Pair",
    "Paper Link": "https://arxiv.org/pdf/2407.21139",
    "Domain": [
      "public datasets"
    ],
    "Authors": [
      "Omer Nacar",
      "Anis Koubaa"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "preprint"
  },
  {
    "slug": "arabic_nli_pair_class",
    "الاسم": "مجموعة بيانات الاستدلال اللغوي الطبيعي العربية - تصنيف الأزواج",
    "الاسم_الأصلي": "Arabic-NLi-Pair-Class",
    "درجة_الجودة": 62,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات ضخمة تضم حوالي 981 ألف زوج من الجمل العربية لمهمة الاستدلال اللغوي الطبيعي، مترجمة آلياً من مجموعتي SNLI وMultiNLI الإنجليزيتين. تحتوي على ثلاثة تصنيفات: استلزام، حياد، وتناقض. جودة النصوص العربية مقبولة بشكل عام مع وجود أخطاء نحوية ناتجة عن الترجمة الآلية، بالإضافة إلى مراجع ثقافية غربية غير ملائمة للسياق العربي. تُستخدم بشكل رئيسي لتدريب نماذج التشابه الدلالي ونماذج التضمين العربية، لكنها تفتقر إلى مراجعة بشرية للترجمة.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 5000,
      "معاينة_العينات": [
        "المقدمة: شخص على حصان يقفز فوق طائرة معطلة | الفرضية: شخص يقوم بتدريب حصانه للمنافسة | التصنيف: حياد (1)",
        "المقدمة: أطفال يبتسمون و يلوحون للكاميرا | الفرضية: هناك أطفال حاضرون | التصنيف: استلزام (0)",
        "المقدمة: صبي يقفز على لوح التزلج في منتصف جسر أحمر | الفرضية: الصبي يتزلج على الرصيف | التصنيف: تناقض (2)"
      ],
      "مشاكل_مكتشفة": [
        "وجود أخطاء نحوية وصرفية ناتجة عن الترجمة الآلية، مثل: 'امرأتين شقراوات يعانقان بعضهما' بدلاً من 'امرأتان شقراوان تتعانقان'",
        "بعض التصنيفات مشكوك في صحتها: مثلاً العينة 500 تصنّف 'طبيب يقوم بعملية جراحية' مع 'رجل عجوز كان يتحدث' كاستلزام وهذا غير منطقي",
        "مراجع ثقافية غربية مترجمة حرفياً مثل 'وول مارت' و'بيسبول' و'فريسبي' (132 حالة في أول 5000 عينة)",
        "حوالي 172 حالة استلزام مشبوهة في أول 5000 عينة حيث لا يوجد أي تداخل لفظي بين المقدمة والفرضية",
        "حالة تكرار واحدة في أول 1000 عينة"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "حجم كبير جداً يتجاوز 981 ألف عينة مع تقسيمات واضحة للتدريب والتحقق والاختبار (942000/19700/19700)",
      "توزيع متوازن للتصنيفات الثلاثة: استلزام 33.4%، حياد 33.6%، تناقض 33% (في العينة المفحوصة)",
      "لا توجد حقول فارغة أو نصوص مفقودة في جميع العينات المفحوصة",
      "النصوص العربية مقروءة ومفهومة في معظم الحالات رغم كونها مترجمة آلياً",
      "ترخيص مفتوح Apache-2.0 يتيح الاستخدام التجاري والبحثي",
      "سهولة الوصول عبر مكتبة HuggingFace datasets بصيغة Parquet"
    ],
    "نقاط_الضعف": [
      "الترجمة آلية بالكامل دون مراجعة بشرية، مما يؤدي لأخطاء نحوية وصرفية متعددة",
      "الورقة البحثية لا تحدد بوضوح نظام الترجمة المستخدم ولا تقدم تقييماً لجودة الترجمة",
      "وجود مراجع ثقافية غربية لا تتناسب مع السياق العربي (وول مارت، بيسبول، إلخ)",
      "بعض التصنيفات خاطئة وموروثة من مجموعات البيانات الأصلية أو ناتجة عن تغير المعنى بعد الترجمة",
      "الورقة البحثية منشورة كمسودة على arXiv ولم تخضع لمراجعة أقران رسمية",
      "البيانات مشتقة بالكامل ولا تحتوي على محتوى عربي أصيل"
    ],
    "الاستخدامات_الموصى_بها": [
      "تدريب نماذج التشابه الدلالي ونماذج التضمين للغة العربية",
      "التدريب المسبق أو الضبط الدقيق لنماذج الاستدلال اللغوي الطبيعي العربية",
      "المقارنة المرجعية بين نماذج اللغة العربية على مهام الاستدلال",
      "لا يُنصح باستخدامها كمعيار ذهبي لتقييم جودة اللغة العربية بسبب أخطاء الترجمة الآلية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 95,
      "التوثيق": 55,
      "السلامة_الأخلاقية": 80,
      "الترخيص": 95,
      "قابلية_إعادة_الإنتاج": 50,
      "المراجعة_العلمية": 35,
      "جودة_البيانات": 55
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/Omartificial-Intelligence-Space/Arabic-NLi-Pair-Class",
      "https://arxiv.org/abs/2407.21139"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2024,
    "Tasks": [
      "natural language inference"
    ],
    "Form": "text",
    "Volume": 981382.0,
    "Unit": "sentences",
    "License": "Apache-2.0",
    "HF Link": "https://huggingface.co/datasets/Omartificial-Intelligence-Space/Arabic-NLi-Pair-Class",
    "Paper Link": "https://arxiv.org/pdf/2407.21139",
    "Domain": [
      "public datasets"
    ],
    "Authors": [
      "Omer Nacar",
      "Anis Koubaa"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "preprint"
  },
  {
    "slug": "arabic_senti-lexicon",
    "الاسم": "المعجم العاطفي العربي",
    "الاسم_الأصلي": "Arabic senti-lexicon",
    "درجة_الجودة": 62,
    "تقدير_الجودة": "جيد",
    "الملخص": "معجم عاطفي عربي يضم 3941 مدخلاً من الكلمات والعبارات المصنفة حسب القطبية (إيجابية/سلبية) مع درجات من -5 إلى +5، إضافة إلى تصنيف أجزاء الكلام والمرادفات. يُعدّ مصدراً مفيداً لتحليل المشاعر في النصوص العربية الفصحى، وقد نُشر ضمن ورقة بحثية في مجلة Journal of Information Science عام 2018. النصوص العربية سليمة بشكل عام لكن يوجد عدد من التناقضات بين تصنيف القطبية ودرجة الشعور (38 حالة)، كما أن تنسيق حقل المرادفات غير متسق عبر المدخلات. المعجم مناسب كمصدر مساعد لتحليل المشاعر لكنه محدود الحجم نسبياً مقارنة بالمعاجم الحديثة.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 3941,
      "معاينة_العينات": [
        "{'Word_Phrase': 'أبو وجهين', 'POS': 0, 'Polarity': 'neg', 'Score': '-5', 'Synonyms': ';;', 'Phrase': '1', 'Strength_word': '0', 'Nigation_word': '0'}",
        "{'Word_Phrase': 'عمل بغيض', 'POS': 0, 'Polarity': 'neg', 'Score': '-5', 'Synonyms': 'فعل ممقوت ; مستهجن ; مكروه ; مقيت;حبيب ; محبوب ; مرغوب به ; مستعلى ; مستطاب;', 'Phrase': '1'}",
        "{'Word_Phrase': 'رفاهية', 'POS': 2, 'Polarity': 'pos', 'Score': '3', 'Synonyms': 'رفاهية لين العيش سعة العيش بحبوحة', 'Phrase': '0'}"
      ],
      "مشاكل_مكتشفة": [
        "وجود 38 تناقضاً بين تصنيف القطبية ودرجة الشعور (مثلاً: كلمة 'مهزوم' مصنفة إيجابية بدرجة -4، و'فتنة' مصنفة إيجابية بدرجة -3)",
        "47 مدخلاً بدرجة صفر رغم تصنيفها كإيجابية، مما يشير إلى غموض في التصنيف",
        "تنسيق حقل المرادفات غير متسق: بعض المدخلات تستخدم الفاصلة المنقوطة وبعضها يستخدم الفراغات فقط (520 فارغ، 2558 بفاصلة منقوطة، 772 بفراغات فقط)",
        "عدم توازن واضح بين الفئات: 2722 مدخلاً سلبياً مقابل 1219 إيجابياً فقط (نسبة 2.2:1)",
        "حقل Score مخزن كنص وليس كرقم صحيح",
        "خطأ إملائي في اسم الحقل 'Nigation_word' بدلاً من 'Negation_word'",
        "العدد الفعلي للمدخلات (3941) يختلف قليلاً عن المُعلن في الوصف (3880)"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "النصوص العربية سليمة وواضحة في الغالبية العظمى من المدخلات",
      "لا يوجد أي تكرار في المدخلات — كل الـ 3941 مدخلاً فريد",
      "لا توجد مدخلات فارغة — كل سجل يحتوي على كلمة أو عبارة",
      "توفر معلومات غنية: قطبية، درجة، أجزاء الكلام، مرادفات، وعلامات للنفي والعبارات",
      "غالبية المدخلات (3779 من 3941) تتضمن مرادفات مما يزيد من فائدة المعجم",
      "منشور في مجلة علمية محكّمة (Journal of Information Science)",
      "متاح مجاناً على HuggingFace وGitHub مما يسهل الوصول إليه",
      "يغطي أجزاء الكلام الأربعة: صفات (1325)، أسماء (1705)، أفعال (650)، ظروف (261)"
    ],
    "نقاط_الضعف": [
      "حجم محدود نسبياً (3941 مدخلاً) مقارنة بالمعاجم الحديثة",
      "38 تناقضاً بين القطبية والدرجة يشير إلى أخطاء في التوسيم لم تُراجَع",
      "عدم توازن بين الفئات الإيجابية والسلبية (نسبة 1:2.2)",
      "تنسيق غير متسق لحقل المرادفات عبر المدخلات المختلفة",
      "لا يوجد تقسيم اختبار (test split) مما يصعب التقييم المعياري",
      "الترخيص مخصص (custom) وليس ترخيصاً معيارياً مفتوح المصدر",
      "يقتصر على العربية الفصحى ولا يغطي اللهجات العربية المحكية رغم ادعاء الوصف بوجود مرادفات لهجية",
      "خطأ إملائي في اسم حقل البيانات (Nigation بدلاً من Negation)",
      "تركّز أغلب الدرجات السلبية على -3 (1455 مدخلاً) مما يقلل من تمايز الدرجات"
    ],
    "الاستخدامات_الموصى_بها": [
      "تحليل المشاعر في النصوص العربية الفصحى كمعجم مساعد",
      "استخراج سمات المشاعر (feature extraction) لنماذج تعلم الآلة",
      "إثراء نماذج معالجة اللغة العربية الطبيعية بمعلومات القطبية",
      "البحث الأكاديمي في مجال تحليل المشاعر العربي",
      "بناء أنظمة تصنيف المشاعر الأساسية للنصوص العربية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 85,
      "التوثيق": 55,
      "السلامة_الأخلاقية": 85,
      "الترخيص": 45,
      "قابلية_إعادة_الإنتاج": 50,
      "المراجعة_العلمية": 75,
      "جودة_البيانات": 58
    },
    "المصادر_المفتوحة": [
      "https://hf.co/datasets/arbml/Senti_Lexicon",
      "https://huggingface.co/datasets/arbml/Senti_Lexicon",
      "https://github.com/almoslmi/masc"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2018,
    "Tasks": [
      "part of speech tagging",
      "sentiment analysis"
    ],
    "Form": "text",
    "Volume": 3880.0,
    "Unit": "tokens",
    "License": "custom",
    "HF Link": "https://hf.co/datasets/arbml/Senti_Lexicon",
    "Paper Link": "https://journals.sagepub.com/doi/pdf/10.1177/0165551516683908",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Tareq Al-Moslmi",
      "M. Albared",
      "Adel Al-Shabi",
      "N. Omar",
      "S. Abdullah"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "journal"
  },
  {
    "slug": "arabic_stsb",
    "الاسم": "معيار التشابه الدلالي النصي العربي",
    "الاسم_الأصلي": "Arabic-stsb",
    "درجة_الجودة": 62,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات Arabic-stsb هي ترجمة آلية لمعيار التشابه الدلالي النصي الإنجليزي (STS-B) إلى العربية، تحتوي على 8,628 زوج من الجمل مع درجات تشابه دلالي تتراوح بين 0 و1. تم إنشاؤها باستخدام نموذج CTranslate2 للترجمة الآلية العصبية ضمن إطار بحثي لتطوير نماذج التضمين المتداخلة (Matryoshka) للعربية. جودة الترجمة مقبولة إجمالاً للجمل البسيطة والقصيرة، لكن تظهر مشاكل واضحة في ترجمة أسماء العلم والمصطلحات التقنية والجمل الطويلة المعقدة، مع وجود 46 زوجاً مكرراً و3 عينات تحتوي على نصوص إنجليزية بنسبة كبيرة. المجموعة مفيدة كأداة تقييم لنماذج التضمين العربية رغم محدودية جودة الترجمة الآلية.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 8628,
      "معاينة_العينات": [
        "s1: 'طائرة ستقلع' | s2: 'طائرة جوية ستقلع' | score: 1.0",
        "s1: 'رجل يعزف على ناي كبير' | s2: 'رجل يعزف على الناي.' | score: 0.76",
        "s1: 'ثلاثة رجال يلعبون الشطرنج.' | s2: 'رجلين يلعبان الشطرنج.' | score: 0.52"
      ],
      "مشاكل_مكتشفة": [
        "وجود 46 زوج جمل مكرر في مجموعة التدريب من أصل 5,749 زوجاً",
        "3 عينات تحتوي على نصوص إنجليزية بنسبة تتجاوز 50% (أسماء شركات ومنتجات تقنية مثل Pylon Pro وIntel وYahoo)",
        "بعض الترجمات حرفية وغير طبيعية مثل 'امرأة تحمل كينغارو' بدلاً من 'كنغر'، و'خنزيراً أرضياً' كترجمة غير مألوفة",
        "بعض الجمل تحتوي على أخطاء نحوية بسيطة مثل 'رجلين يلعبان' بدلاً من 'رجلان يلعبان' (في حالة الرفع)",
        "درجات التشابه مُعادة تطبيعها من مقياس 1-5 إلى 0-1 دون توضيح كافٍ لتأثير ذلك على دقة التمييز بين الدرجات",
        "لا توجد تشكيلات (حركات) على النصوص العربية مما قد يسبب غموضاً في بعض الجمل"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "البيانات متاحة مجاناً بترخيص Apache-2.0 مفتوح وسهلة التحميل عبر مكتبة datasets",
      "تقسيم واضح إلى تدريب (5,749) وتحقق (1,500) واختبار (1,379) مما يسهل المقارنة المعيارية",
      "توزيع درجات التشابه متوازن نسبياً عبر النطاق الكامل (0-1) مما يضمن تغطية جيدة لمستويات التشابه المختلفة",
      "لا توجد جمل فارغة ولا قيم مفقودة في أي من الحقول الثلاثة",
      "الجمل القصيرة والبسيطة مترجمة بجودة عالية وطبيعية (مثل: طائرة ستقلع، رجل يدخن)",
      "مدعومة بورقة بحثية منشورة على arXiv مع نتائج تقييم تفصيلية",
      "حجم المجموعة (8,628 زوج) كافٍ لمهام التقييم المعيارية"
    ],
    "نقاط_الضعف": [
      "الترجمة آلية بالكامل عبر CTranslate2 مع مراجعة بشرية عشوائية محدودة فقط، مما يعني عدم ضمان جودة كل الترجمات",
      "بعض الترجمات تبدو حرفية وغير طبيعية خاصة للجمل الطويلة والمعقدة وتلك التي تحتوي على أسماء علم أجنبية",
      "وجود 46 زوجاً مكرراً يشير إلى عدم إجراء تنظيف كامل للبيانات بعد الترجمة",
      "درجات التشابه منقولة من المجموعة الإنجليزية الأصلية دون إعادة تقييم للنصوص العربية المترجمة، مما قد يسبب عدم تطابق بين الدرجة والمعنى الفعلي",
      "الورقة البحثية منشورة كمسودة أولية (preprint) على arXiv دون مراجعة أقران رسمية",
      "لا يوجد توثيق تفصيلي لعملية ضبط الجودة أو نسبة الأخطاء المكتشفة في المراجعة العشوائية",
      "المجموعة مشتقة بالكامل وليست أصلية، مما يحد من تمثيلها للتشابه الدلالي في السياق العربي الأصيل"
    ],
    "الاستخدامات_الموصى_بها": [
      "تقييم نماذج التضمين متعددة اللغات والعربية على مهمة التشابه الدلالي النصي",
      "المقارنة المعيارية بين نماذج معالجة اللغة العربية المختلفة",
      "تدريب وضبط نماذج التضمين الدلالي للعربية كمجموعة تقييم وليس كمجموعة تدريب أساسية",
      "البحث الأكاديمي في مجال فهم التشابه الدلالي للنصوص العربية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 95,
      "التوثيق": 55,
      "السلامة_الأخلاقية": 85,
      "الترخيص": 95,
      "قابلية_إعادة_الإنتاج": 70,
      "المراجعة_العلمية": 40,
      "جودة_البيانات": 58
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/Omartificial-Intelligence-Space/Arabic-stsb",
      "https://arxiv.org/abs/2407.21139",
      "https://arxiv.org/html/2407.21139v1"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2024,
    "Tasks": [
      "embedding evaluation"
    ],
    "Form": "text",
    "Volume": 8628.0,
    "Unit": "sentences",
    "License": "Apache-2.0",
    "HF Link": "https://huggingface.co/datasets/Omartificial-Intelligence-Space/Arabic-stsb",
    "Paper Link": "https://arxiv.org/pdf/2407.21139",
    "Domain": [
      "public datasets"
    ],
    "Authors": [
      "Omer Nacar",
      "Anis Koubaa"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "preprint"
  },
  {
    "slug": "a_corpus_of_arabic_literature_(19-20th_centuries)_for_stylometric_tests",
    "الاسم": "مدونة الأدب العربي (القرنان التاسع عشر والعشرون) للاختبارات الأسلوبية",
    "الاسم_الأصلي": "A Corpus of Arabic Literature (19-20th centuries) for Stylometric Tests",
    "درجة_الجودة": 58,
    "تقدير_الجودة": "مقبول",
    "الملخص": "مجموعة بيانات تضم نصوصاً أدبية عربية من القرنين التاسع عشر والعشرين، مقسمة إلى ثلاث مدونات فرعية: 22 رواية تاريخية مؤرخة لجرجي زيدان، و65 كتاباً لـ8 مؤلفين، و300 كتاب لـ28 مؤلفاً (387 وثيقة إجمالاً). النصوص مجمعة من مؤسسة هنداوي وتم تطبيعها إملائياً بإزالة التشكيل وتبسيط الألفات وتحويل الألف المقصورة إلى ياء، مما يجعلها مناسبة لاختبارات القياس الأسلوبي (stylometry) لكنها تفقد كثيراً من خصائصها اللغوية الأصلية. على مستوى HuggingFace، النصوص مقطعة إلى أجزاء صغيرة جداً (حوالي 70 حرفاً) دون بيانات وصفية عن المؤلف أو العنوان، مما يحد بشدة من فائدتها في هذا الشكل.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 1000,
      "معاينة_العينات": [
        "OpenITI URI: 1331JurjiZaydan.AbuMuslimKhurasani.Hindawi41728357  ابو مسلم الخرساني ابو مسلم الخرساني تاليف جرجي زيدان",
        "القاعة الكبري ووراء تلك القاعة غرف كبيرة مفروشة باثمن الاثاث من الديباج",
        "حكومة خراسان قال وهذا يدلك علي اعزازي لك وسعيي في راحتك لان نصرا هذا لا"
      ],
      "مشاكل_مكتشفة": [
        "النصوص مقطعة إلى أجزاء صغيرة جداً بمتوسط 69.7 حرفاً فقط لكل صف، مما يفقد السياق الأدبي",
        "إزالة كاملة للهمزات من جميع أشكال الألف: لم تُوجد أي ألف مهموزة (أ/إ/آ) في 500 عينة مفحوصة",
        "إزالة كاملة للتشكيل: لا يوجد أي تشكيل في جميع العينات المفحوصة",
        "استبدال الهمزة على السطر بحرف الهمزة العادي أحياناً مما ينتج كلمات مشوهة مثل 'مءسسة' بدل 'مؤسسة' و'مسءول' بدل 'مسؤول'",
        "عدم وجود حقول بيانات وصفية (اسم المؤلف، عنوان الكتاب، تاريخ النشر) في نسخة HuggingFace - الحقل الوحيد هو 'text'",
        "بعض الصفوف تحتوي بيانات وصفية تقنية (مثل OpenITI URI ومعلومات هنداوي للنشر) مختلطة مع المحتوى الأدبي",
        "تحويل الألف المقصورة (ى) إلى ياء (ي) يغير المعنى في بعض الحالات ويُصعّب التمييز بينها"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "مجموعة متخصصة ونادرة تركز على الأدب العربي الحديث (القرنان 19-20) وهي فترة مهمة أدبياً",
      "تصميم مدروس لاختبارات القياس الأسلوبي مع ثلاث مدونات فرعية بأحجام مختلفة",
      "مدونة جرجي زيدان المؤرخة (22 رواية بتواريخ نشر معروفة) ذات قيمة عالية لدراسة التطور الأسلوبي الزمني",
      "ترخيص مفتوح (CC BY 4.0) يسمح بالاستخدام والتوزيع الحر",
      "متاحة على منصتين (Zenodo وHuggingFace) مما يسهل الوصول",
      "التطبيع الإملائي متسق ومنهجي وموثق بوضوح، وهو مناسب للتحليل الأسلوبي",
      "جميع النصوص فريدة (200 من 200 عينة مفحوصة كانت مختلفة) مما يشير لعدم وجود تكرار"
    ],
    "نقاط_الضعف": [
      "نسخة HuggingFace تفتقر تماماً للبيانات الوصفية (المؤلف، العنوان، التاريخ) مما يجعلها عديمة الفائدة تقريباً للقياس الأسلوبي في شكلها الحالي",
      "تقطيع النصوص إلى أجزاء صغيرة (~70 حرفاً) يفقد البنية النصية والسياق ويجعل إعادة تجميع النصوص الأصلية أمراً صعباً",
      "التطبيع الإملائي المفرط (إزالة الهمزات والتشكيل) يحد من الاستخدامات خارج نطاق القياس الأسلوبي",
      "لا توجد ورقة بحثية منشورة مرتبطة بالمجموعة لتوثيق المنهجية بالتفصيل",
      "لا يوجد ملف README على HuggingFace يشرح البيانات أو طريقة استخدامها",
      "لا يوجد تقسيم للبيانات (تدريب/اختبار/تحقق) - فقط مجموعة واحدة",
      "محدودية المصادر: جميع النصوص من مصدر واحد فقط (مؤسسة هنداوي)",
      "عدد التحميلات منخفض جداً (12 تحميلاً في الشهر الأخير) مما يشير لمحدودية الاستخدام المجتمعي"
    ],
    "الاستخدامات_الموصى_بها": [
      "اختبارات القياس الأسلوبي (stylometry) لنسبة النصوص إلى مؤلفيها - باستخدام نسخة Zenodo الأصلية التي تحتوي على البيانات الوصفية",
      "دراسة التطور الأسلوبي الزمني لجرجي زيدان عبر رواياته الـ22 المؤرخة",
      "تدريب نماذج لغوية على نصوص أدبية عربية حديثة (مع مراعاة التطبيع الإملائي)",
      "البحث في الإنسانيات الرقمية واللسانيات الحاسوبية للنصوص العربية",
      "اختبار أدوات تحليل النصوص العربية مثل حزمة R stylo"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 70,
      "التوثيق": 40,
      "السلامة_الأخلاقية": 90,
      "الترخيص": 95,
      "قابلية_إعادة_الإنتاج": 55,
      "المراجعة_العلمية": 25,
      "جودة_البيانات": 50
    },
    "المصادر_المفتوحة": [
      "https://zenodo.org/api/records/5772261",
      "https://huggingface.co/api/datasets/arbml/Arabic_Literature",
      "https://hf.co/datasets/arbml/Arabic_Literature"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2021,
    "Tasks": [
      "language modeling"
    ],
    "Form": "text",
    "Volume": 387.0,
    "Unit": "documents",
    "License": "CC BY 4.0",
    "HF Link": "https://hf.co/datasets/arbml/Arabic_Literature",
    "Paper Link": "",
    "Domain": [
      "books"
    ],
    "Authors": [
      "Romanov Maxim"
    ],
    "Dialect": "Classical Arabic",
    "Access": "Free",
    "Venue Type": ""
  },
  {
    "slug": "akec",
    "الاسم": "مجموعة بيانات استخراج العبارات المفتاحية العربية",
    "الاسم_الأصلي": "AKEC - Arabic Keyphrase Extraction Corpus",
    "درجة_الجودة": 58,
    "تقدير_الجودة": "مقبول",
    "الملخص": "مجموعة بيانات صغيرة الحجم تتكون من 160 وثيقة عربية مع عباراتها المفتاحية، جُمعت عبر التعهيد الجماعي (crowdsourcing) وتمثل أول مجموعة بيانات معيارية لاستخراج العبارات المفتاحية من النصوص العربية. البيانات مستمدة من أربعة مصادر مختلفة تشمل صحفاً ومدونات عربية، وتتوفر بصيغتين: نصوص أصلية (pure) ونصوص مُجذَّرة (lemmatized). رغم ريادتها في هذا المجال، تعاني المجموعة من صغر حجمها الشديد ومشاكل ملحوظة في جودة التجذير، كما أن نسخة HuggingFace تحتوي فقط على العبارات المفتاحية دون نصوص الوثائق الأصلية، مما يحد من فائدتها كمجموعة تدريب مستقلة.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 160,
      "معاينة_العينات": [
        "ArtMus01 : عنصرية فكرية,المكتبات,للصراعات الفكرية,عبدالله الحبيشي,وزارة الثقافة,علي الشمام,الكتب,المفكرين والأدباء,مكتبة المختار,خالد حسين,دار النشر,رشدي عبدالسلام,ساحات للصراعات الفكرية,مرتادي المكتبات العامة",
        "ArtMus02 : المركز الثقافي,السعوديون,القيم الإسلامية,الملياردير الوليد بن طلال,السينما,المسارح,الوليد بن طلال,العاصمة الرياض,الفيلم السينمائي,اختلاط الجنسين,النشطاء الإسلاميين,مسفر السباعي",
        "ArtMus03 : الرواية العراقية المهاجرة,سرير البنفسج,مأوى اللاجئين,العراقيون,البلد الجديد,روائيات عراقيات,هموم النوستالجيا,الإنسان العراقي,دراسته الجامعية,سميرة المانع"
      ],
      "مشاكل_مكتشفة": [
        "نسخة HuggingFace تحتوي فقط على العبارات المفتاحية (lemmatized و pure) دون نصوص الوثائق الأصلية، مما يجعلها غير مكتملة لمهمة استخراج العبارات المفتاحية",
        "مشاكل واضحة في التجذير: 65 حالة تجذير مشبوهة حيث تُحذف الأحرف الأولى بشكل خاطئ، مثل 'ستطلاع' بدلاً من 'استطلاع'، و'ختلاط' بدلاً من 'اختلاط'، و'نتهى' بدلاً من 'انتهى'",
        "عدم تطابق في عدد العبارات المفتاحية بين النسخة المُجذَّرة والنسخة الأصلية في عدة وثائق (مثلاً: وثيقة 0 بها 72 مقابل 71، ووثيقة 3 بها 67 مقابل 60)",
        "حجم المجموعة صغير جداً (160 وثيقة فقط) مما يحد من فائدتها في تدريب نماذج التعلم العميق",
        "بعض العبارات المفتاحية المُجذَّرة تحتوي على أجزاء غير مفهومة أو مبتورة مثل 'ي مركز ثقافي أدار حكومة' و'ن تجاهل ولي مجموع'"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "أول مجموعة بيانات معيارية لاستخراج العبارات المفتاحية العربية، مما يمنحها قيمة ريادية في المجال",
      "لا يوجد تكرار في البيانات — جميع العينات الـ 160 فريدة بنسبة 100%",
      "توفر صيغتين من العبارات المفتاحية: أصلية ومُجذَّرة، مما يتيح مقارنة تأثير التجذير",
      "تنوع في مصادر الوثائق (أربعة مصادر مختلفة) ومجالات متعددة تشمل الثقافة والسياسة والأدب",
      "وجود تقسيم واضح للتدريب والاختبار (100 تدريب و60 اختبار) في المستودع الأصلي على GitHub",
      "العبارات المفتاحية في النسخة الأصلية (pure) سليمة لغوياً وذات معنى واضح",
      "منشورة في مؤتمر علمي محكّم (IALP 2016) مع تقييم مقارن بتعليقات الخبراء"
    ],
    "نقاط_الضعف": [
      "حجم صغير جداً (160 وثيقة فقط) لا يكفي لتدريب نماذج تعلم عميق فعّالة",
      "نسخة HuggingFace ناقصة — تحتوي فقط على العبارات المفتاحية دون نصوص الوثائق الأصلية",
      "مشاكل جوهرية في جودة التجذير: حذف خاطئ لهمزة الوصل والألف في كثير من الكلمات (65 حالة مشبوهة على الأقل)",
      "عدم تطابق في عدد العبارات المفتاحية بين النسختين المُجذَّرة والأصلية في بعض الوثائق",
      "الترخيص غير محدد بوضوح، مع إشارة إلى أنها متاحة لأغراض البحث فقط",
      "البيانات قديمة نسبياً (2016) وقد لا تعكس التطورات الحديثة في معالجة اللغة العربية",
      "لا تحتوي على بيانات وصفية إضافية مثل المجال أو المصدر أو طول الوثيقة الأصلية"
    ],
    "الاستخدامات_الموصى_بها": [
      "تقييم ومقارنة خوارزميات استخراج العبارات المفتاحية من النصوص العربية (باستخدام النسخة الكاملة من GitHub)",
      "دراسة تأثير التجذير على جودة استخراج العبارات المفتاحية بالمقارنة بين النسختين",
      "استخدامها كمجموعة اختبار مرجعية (benchmark) وليس كمجموعة تدريب بسبب صغر حجمها",
      "البحث الأكاديمي في مجال معالجة اللغة العربية الطبيعية وتحديداً استخراج المصطلحات"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 70,
      "التوثيق": 55,
      "السلامة_الأخلاقية": 85,
      "الترخيص": 35,
      "قابلية_إعادة_الإنتاج": 55,
      "المراجعة_العلمية": 70,
      "جودة_البيانات": 45
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/AKEC",
      "https://github.com/ailab-uniud/akec",
      "https://ieeexplore.ieee.org/document/7875927"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2016,
    "Tasks": [
      "keyphrase extraction"
    ],
    "Form": "text",
    "Volume": 160.0,
    "Unit": "documents",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/arbml/AKEC",
    "Paper Link": "https://ieeexplore.ieee.org/document/7875927",
    "Domain": [
      "news articles"
    ],
    "Authors": [
      "Muhammad Helmy",
      "Marco Basaldella",
      "Eddy Maddalena",
      "S. Mizzaro",
      "Gianluca Demartini"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  },
  {
    "slug": "aqeedah_rag_dataset",
    "الاسم": "مجموعة بيانات العقيدة للاسترجاع المعزز بالتوليد",
    "الاسم_الأصلي": "Aqeedah RAG Dataset",
    "درجة_الجودة": 58,
    "تقدير_الجودة": "مقبول",
    "الملخص": "مجموعة بيانات عربية متخصصة في علم العقيدة الإسلامية تحتوي على 5,419 فقرة مستخرجة من 17 كتاباً لـ 8 مؤلفين من علماء أهل السنة والجماعة، مع تضمينات FAISS محسوبة مسبقاً بـ 768 بُعداً. النصوص العربية سليمة لغوياً وتمثل مصادر عقدية موثوقة من كتب الشيخ ابن عثيمين وابن باز وغيرهم. إلا أن المجموعة تعاني من غياب ورقة بحثية موثقة، ووجود تكرارات ونصوص قصيرة غير مفيدة مثل عناوين الأغلفة والصفحات الفارغة، فضلاً عن عدم اتساق البيانات الوصفية في أسماء المؤلفين وانعدام تقسيمات التقييم والاختبار. الحجم صغير نسبياً ومقتصر على مجال العقيدة فقط دون بقية العلوم الشرعية.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 5419,
      "معاينة_العينات": [
        "أصول الإيمان لسماحة الشيخ عبد العزيز بن باز الرئيس العام لإدارات البحوث العلمية والإفتاء والدعوة والإرشاد الحمد لله رب العالمين, والصلاة والسلام على عبده ورسوله وخيرته من خلقه وأمينه على وحيه ونبينا وإمامنا محمد بن عبد الله...",
        "ومن هذا الباب ما جاء في الحديث الصحيح، قيل: يا رسول الله أي الإسلام أفضل؟ قال: \"أن تطعم الطعام وتقرأ السلام على من عرفت ومن لم تعرف\"، وفي حديث آخر قال: \"من سلم المسلمون من لسانه ويده\"...",
        "بسم الله الرحمن الرحيم توطئة الحمد لله الذي أرسل رسوله بالهدى ودين الحق، والحمد لله الذي جعلنا من أتباع محمد صلى الله عليه وسلم، والحمد لله الذي من علينا فجعلنا من المتمسكين بهديه..."
      ],
      "مشاكل_مكتشفة": [
        "وجود 16 تكراراً كاملاً في النصوص، بما في ذلك عناوين كتب وبسملات وصفحات فارغة مكررة",
        "وجود نصوص قصيرة جداً غير مفيدة للاسترجاع: عناوين أغلفة كتب، أسماء ناشرين، تواريخ طبعات، وعبارة 'صفحة فارغة' (5 تكرارات على الأقل)",
        "عدم اتساق في أسماء المؤلفين: 'محمد بن صالح بن محمد العثيمين' يظهر بنسختين مختلفتين (مع مسافة زائدة في النهاية وبدونها)، مما يقسم 4,044 فقرة إلى مجموعتين منفصلتين",
        "أقصر نص يتكون من 9 أحرف فقط، وهناك عشرات النصوص أقل من 50 حرفاً تمثل عناوين وبيانات نشر وليست محتوى علمياً",
        "غياب تقسيمات التقييم والاختبار (train فقط)، مما يحد من قابلية استخدامها في التقييم المنهجي",
        "لا توجد ورقة بحثية منشورة أو محكّمة مرتبطة بالمجموعة"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "النصوص العربية سليمة لغوياً ومكتوبة بالعربية الفصحى، وتمثل نصوصاً أصيلة من كتب علماء معروفين في العقيدة الإسلامية",
      "توفر تضمينات FAISS محسوبة مسبقاً بـ 768 بُعداً لكل فقرة بدون أي قيم مفقودة، مما يسهل بناء أنظمة الاسترجاع مباشرة",
      "البيانات الوصفية منظمة وتتضمن اسم المؤلف واسم الكتاب ورقم الفقرة، مما يسهل التتبع والإسناد",
      "تنوع نسبي في المصادر: 17 كتاباً و8 مؤلفين يغطون جوانب مختلفة من علم العقيدة (التوحيد، شرح الطحاوية، العقيدة الواسطية، الفتاوى)",
      "سهولة الوصول: مستضافة على HuggingFace بصيغة Parquet مع ترخيص MIT مفتوح",
      "متوسط طول الفقرات مناسب (952 حرفاً) لتطبيقات الاسترجاع المعزز بالتوليد"
    ],
    "نقاط_الضعف": [
      "حجم صغير نسبياً (5,419 فقرة فقط) مقارنة بمجموعات بيانات الاسترجاع الكبيرة",
      "مجال ضيق جداً: مقتصرة على العقيدة دون بقية العلوم الشرعية كالفقه والتفسير والحديث",
      "وجود تكرارات ونصوص غير مفيدة (صفحات فارغة، عناوين أغلفة، بيانات نشر) لم يتم تنظيفها",
      "عدم اتساق البيانات الوصفية في أسماء المؤلفين بسبب مسافات زائدة",
      "غياب تام لورقة بحثية منشورة أو محكّمة تصف المنهجية والتقييم",
      "غياب تقسيمات تقييم واختبار، وعدم وجود أسئلة أو إجابات مرفقة لتقييم أداء نظام RAG",
      "هيمنة واضحة لمؤلف واحد (ابن عثيمين) على أكثر من 74% من الفقرات، مما يقلل التنوع",
      "لا يوجد توثيق لنموذج التضمينات المستخدم أو كيفية حسابها"
    ],
    "الاستخدامات_الموصى_بها": [
      "بناء أنظمة استرجاع معزز بالتوليد متخصصة في الإجابة عن أسئلة العقيدة الإسلامية",
      "تطوير محركات بحث دلالي في النصوص الشرعية العقدية",
      "استخدامها كنواة أولية لمجموعة بيانات أكبر في العلوم الشرعية بعد التنظيف والتوسيع",
      "التدريب على استرجاع النصوص العربية الإسلامية باستخدام التضمينات المحسوبة مسبقاً"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 90,
      "التوثيق": 35,
      "السلامة_الأخلاقية": 80,
      "الترخيص": 90,
      "قابلية_إعادة_الإنتاج": 30,
      "المراجعة_العلمية": 10,
      "جودة_البيانات": 55
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/abdullah-alamodi/aqeedah-rag-dataset"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2025,
    "Tasks": [
      "retrieval-augmented generation"
    ],
    "Form": "text",
    "Volume": 5419.0,
    "Unit": "documents",
    "License": "MIT License",
    "HF Link": "https://huggingface.co/datasets/abdullah-alamodi/aqeedah-rag-dataset",
    "Paper Link": "",
    "Domain": [
      "books"
    ],
    "Authors": [
      "Alya Alamodi",
      "Abdullah Alamodi"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": ""
  },
  {
    "slug": "arabic_nli_triplet",
    "الاسم": "مجموعة الاستدلال اللغوي الطبيعي العربية - ثلاثيات",
    "الاسم_الأصلي": "Arabic-NLi-Triplet",
    "درجة_الجودة": 58,
    "تقدير_الجودة": "مقبول",
    "الملخص": "مجموعة بيانات ثلاثية مترجمة آليًا من مجموعتي SNLI وMultiNLI الإنجليزيتين إلى العربية باستخدام نظام الترجمة الآلية العصبية CTranslate2. تحتوي على 571,043 عينة مقسمة إلى ثلاثيات (anchor, positive, negative) لمهام الاستدلال اللغوي الطبيعي والتشابه الدلالي. جودة الترجمة متفاوتة؛ فبينما معظم الجمل مفهومة، تظهر تراكيب حرفية من الإنجليزية مثل 'في اللون الأبيض' بدلاً من 'باللون الأبيض'، وأخطاء في التطابق النحوي بين المثنى والجمع. يوجد تكرار هيكلي كبير في حقل الـ anchor بسبب طريقة توليد الثلاثيات من أزواج NLI الأصلية، مما يحدّ من تنوع السياقات اللغوية. تصلح البيانات لتدريب نماذج التضمين الدلالي لكنها تحتاج حذرًا عند استخدامها لمهام تتطلب دقة لغوية عربية عالية.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 20000,
      "معاينة_العينات": [
        "anchor: 'شخص على حصان يقفز فوق طائرة معطلة' | positive: 'شخص في الهواء الطلق، على حصان.' | negative: 'شخص في مطعم، يطلب عجة.'",
        "anchor: 'أطفال يبتسمون و يلوحون للكاميرا' | positive: 'هناك أطفال حاضرون' | negative: 'الاطفال يتجهمون'",
        "anchor: 'رجل وامرأة وطفل يستمتعون على الشاطئ' | positive: 'عائلة مكونة من ثلاثة أفراد على الشاطئ' | negative: 'عائلة مكونة من ثلاثة أفراد في مركز التسوق'"
      ],
      "مشاكل_مكتشفة": [
        "تراكيب حرفية مترجمة من الإنجليزية: استخدام 'في اللون الأبيض' بدلاً من 'باللون الأبيض' — رُصدت 60 حالة في أول 200 عينة",
        "تكرار هيكلي كبير في حقل الـ anchor: في عينة من 20,000 سجل وُجدت 933 anchor فريدة فقط (4.7%)، وأقصى تكرار لـ anchor واحد بلغ 3,222 مرة",
        "وجود 41 ثلاثية مكررة بالكامل (anchor+positive+negative متطابقة) في أول 20,000 سجل",
        "أخطاء نحوية في التطابق بين المثنى والجمع مثل 'امرأتين شقراوات' بدلاً من 'امرأتين شقراوين'",
        "بعض العبارات السلبية (negative) تبدو قريبة دلاليًا من الـ anchor مما يشكك في جودة تصنيف بعض الثلاثيات",
        "ترجمات حرفية غير طبيعية مثل 'المرأة هي نيك' كترجمة مباشرة من الإنجليزية"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "حجم كبير يبلغ 571,043 عينة مع تقسيمات واضحة للتدريب (558 ألف) والتحقق (6,580) والاختبار (6,610)",
      "جميع النصوص بالعربية بنسبة عالية جدًا مع غياب شبه تام للأحرف غير العربية",
      "هيكل الثلاثيات (anchor, positive, negative) واضح ومناسب لتدريب نماذج التضمين الدلالي",
      "مصدرة من مجموعتي SNLI وMultiNLI المعروفتين والموثقتين جيدًا",
      "ترخيص Apache 2.0 مفتوح يسمح بالاستخدام التجاري والبحثي",
      "سهولة التحميل والوصول عبر مكتبة datasets من HuggingFace",
      "ورقة بحثية مرافقة تشرح المنهجية والنتائج"
    ],
    "نقاط_الضعف": [
      "الترجمة آلية بالكامل عبر CTranslate2 دون مراجعة بشرية منهجية — فقط مراجعة عشوائية محدودة كما ذُكر في الورقة",
      "تكرار هيكلي مرتفع جدًا: كل anchor قد يتكرر عشرات المرات مع أزواج positive/negative مختلفة مما يقلل التنوع",
      "وجود تراكيب لغوية حرفية مترجمة من الإنجليزية لا تتوافق مع الاستخدام الطبيعي للعربية",
      "أخطاء نحوية وصرفية ناتجة عن الترجمة الآلية خاصة في صيغ المثنى والجمع",
      "لم يُقيَّم جودة الترجمة بمقاييس آلية معيارية مثل BLEU أو تقييم بشري واسع",
      "الورقة البحثية منشورة كنسخة أولية على arXiv فقط دون مراجعة أقران رسمية",
      "النماذج المدربة على هذه البيانات العربية أدّت بشكل أقل من النماذج متعددة اللغات حسب نتائج الورقة نفسها"
    ],
    "الاستخدامات_الموصى_بها": [
      "تدريب نماذج التضمين الدلالي للنصوص العربية (sentence embeddings)",
      "مهام التشابه الدلالي بين الجمل العربية",
      "تدريب نماذج الاستدلال اللغوي الطبيعي العربية كخط أساس",
      "استرجاع المعلومات والبحث الدلالي بالعربية",
      "التعلم التبايني (contrastive learning) لنماذج اللغة العربية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 92,
      "التوثيق": 60,
      "السلامة_الأخلاقية": 80,
      "الترخيص": 95,
      "قابلية_إعادة_الإنتاج": 55,
      "المراجعة_العلمية": 35,
      "جودة_البيانات": 48
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/Omartificial-Intelligence-Space/Arabic-NLi-Triplet",
      "https://arxiv.org/abs/2407.21139",
      "https://arxiv.org/html/2407.21139"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2024,
    "Tasks": [
      "natural language inference"
    ],
    "Form": "text",
    "Volume": 571043.0,
    "Unit": "sentences",
    "License": "Apache-2.0",
    "HF Link": "https://huggingface.co/datasets/Omartificial-Intelligence-Space/Arabic-NLi-Triplet",
    "Paper Link": "https://arxiv.org/pdf/2407.21139",
    "Domain": [
      "public datasets"
    ],
    "Authors": [
      "Omer Nacar",
      "Anis Koubaa"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "preprint"
  },
  {
    "slug": "arabic_satire_dataset",
    "الاسم": "مجموعة بيانات السخرية العربية",
    "الاسم_الأصلي": "Arabic satire dataset",
    "درجة_الجودة": 58,
    "تقدير_الجودة": "مقبول",
    "الملخص": "مجموعة بيانات عربية لتصنيف المقالات الساخرة مقابل المقالات الإخبارية الحقيقية، تتضمن 1524 عينة (761 ساخرة و763 إخبارية) مستخرجة من منصات إخبارية ساخرة حقيقية ومواقع إخبارية عربية. النصوص العربية سليمة لغوياً وواضحة التمييز بين الفئتين، مع توازن جيد في التوزيع بين التصنيفين. تعاني المجموعة من ضعف شديد في التوثيق على GitHub وHuggingFace، وعدم وجود ترخيص محدد، ووجود تناقض بين الحجم المُعلن في الوصف (1000 عينة) والحجم الفعلي (1524 عينة)، إضافة إلى تسمية العمود بـ'tweet' رغم أن المحتوى مقالات كاملة وليست تغريدات. مفيدة للبحث في كشف السخرية والأخبار الكاذبة بالعربية رغم صغر حجمها.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 1524,
      "معاينة_العينات": [
        "ومن ناحية أخرى قررت دار الإفتاء تخصيص ركعة في كل صلاة تراويح برمضان من أجل الدعاء لمشجعي ريال مدريد عدا راموس بقبول توبتهم عدا راموس في حال قرروا تشجيع صلاح من كل قلبهم عدا راموس، على أمل أن تكون توبتهم عدا راموس توبة نصوحة لا أغراض أخرى لها.",
        "في قرار شجاع يحتاج لإرادة حقيقية؛ قرر فرحان الصامد رفض دعوة أصدقائه المسيحيين لانضمامه لاحتساء الخمر احتفالا معهم بليلة رأس السنة قبل أيام، على أن يوفر ثمن الزجاجات إلى ما بعد عيد الفطر",
        "ومدى مصر هو موقع إخباري مستقل حجبته السلطات منذ أكثر من عامين."
      ],
      "مشاكل_مكتشفة": [
        "تناقض في الحجم: الوصف يذكر 1000 عينة والورقة تذكر 768 لكل فئة، لكن البيانات الفعلية تحتوي على 1524 عينة",
        "19 نصاً مكرراً (1.25% من إجمالي البيانات)",
        "438 عينة (28.7%) تحتوي على مسافات بيضاء زائدة أو أسطر فارغة إضافية",
        "العمود مسمى 'tweet' رغم أن المحتوى مقالات صحفية كاملة وليست تغريدات",
        "لا يوجد تقسيم إلى مجموعات تدريب واختبار وتحقق",
        "التوثيق على GitHub شبه معدوم — لا يوجد ملف README",
        "بطاقة بيانات HuggingFace فارغة بالكامل (كل الحقول تقول More Information Needed)"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "النصوص العربية سليمة لغوياً وخالية من مشاكل الترميز — لم تُكتشف أي أحرف مشوهة في 1524 عينة",
      "توازن جيد بين الفئتين: 761 ساخرة مقابل 763 إخبارية",
      "المقالات الساخرة واضحة الأسلوب الساخر ومتميزة عن الأخبار الحقيقية عند القراءة",
      "لا توجد نصوص فارغة أو قصيرة جداً — أقصر نص 62 حرفاً وهو مقبول",
      "البيانات متاحة مجاناً على HuggingFace بصيغة Parquet سهلة التحميل",
      "مدعومة بورقة بحثية منشورة في مجلة Applied Sciences المفهرسة",
      "تغطي مواضيع متنوعة: سياسة، رياضة، دين، مجتمع"
    ],
    "نقاط_الضعف": [
      "حجم صغير نسبياً (1524 عينة) قد لا يكفي لتدريب نماذج عميقة بشكل مستقل",
      "توثيق ضعيف جداً — لا ملف README على GitHub ولا بطاقة بيانات مكتملة على HuggingFace",
      "الترخيص غير محدد مما يعيق إعادة الاستخدام الأكاديمي والتجاري",
      "تناقض واضح بين الحجم المُعلن والحجم الفعلي يقلل من الثقة في الوصف",
      "تسمية العمود 'tweet' مضللة لأن المحتوى مقالات كاملة بمتوسط 1013 حرفاً",
      "لا يوجد تقسيم معياري للبيانات (تدريب/اختبار/تحقق)",
      "28.7% من العينات تحتوي على مسافات بيضاء زائدة تحتاج تنظيفاً",
      "لا توجد معلومات عن المصادر المحددة للمقالات الساخرة والإخبارية داخل البيانات نفسها",
      "لا توجد بيانات وصفية إضافية مثل تاريخ النشر أو المصدر أو الكاتب"
    ],
    "الاستخدامات_الموصى_بها": [
      "بحث أولي في كشف السخرية والتهكم في النصوص العربية",
      "تدريب وتقييم نماذج التصنيف الثنائي للنصوص العربية (ساخر/غير ساخر)",
      "دراسات التعلم بالنقل باستخدام نماذج مثل AraBERT لمهام تصنيف النصوص العربية",
      "تحليل لغوي ومعجمي لأسلوب السخرية في الكتابة الصحفية العربية",
      "مكوّن مساعد ضمن أنظمة كشف الأخبار الكاذبة بالعربية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 80,
      "التوثيق": 25,
      "السلامة_الأخلاقية": 55,
      "الترخيص": 15,
      "قابلية_إعادة_الإنتاج": 40,
      "المراجعة_العلمية": 65,
      "جودة_البيانات": 62
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/Arbic-satire-dataset",
      "https://github.com/Noza1234/Arbic-satire-dataset",
      "https://www.mdpi.com/2076-3417/13/19/10616"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2023,
    "Tasks": [
      "sentiment analysis",
      "information retrieval",
      "fake news detection"
    ],
    "Form": "text",
    "Volume": 1000.0,
    "Unit": "sentences",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/arbml/Arbic-satire-dataset",
    "Paper Link": "https://www.mdpi.com/2076-3417/13/19/10616",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Fatmah Assiri",
      "Hanen Himdi"
    ],
    "Dialect": "Classical Arabic",
    "Access": "Free",
    "Venue Type": "journal"
  },
  {
    "slug": "wikimatrix",
    "الاسم": "ويكي ماتريكس",
    "الاسم_الأصلي": "WikiMatrix",
    "درجة_الجودة": 58,
    "تقدير_الجودة": "مقبول",
    "الملخص": "WikiMatrix هي مجموعة بيانات ضخمة للجمل المتوازية مُستخرجة تلقائياً من ويكيبيديا باستخدام تضمينات الجمل متعددة اللغات (LASER). تحتوي على حوالي 4435 جملة عربية-إنجليزية كجزء من 135 مليون جملة متوازية عبر 1620 زوج لغوي. الجودة متفاوتة بشكل ملحوظ: فبينما توجد أزواج ترجمة جيدة ودقيقة، لوحظت أيضاً أخطاء ترجمة دلالية خطيرة وضوضاء ناتجة عن مراجع ويكيبيديا ونصوص إنجليزية مختلطة في الجانب العربي. البيانات مفيدة للترجمة الآلية لكنها تحتاج تنقية إضافية قبل الاستخدام خاصة لرفع عتبة درجة التطابق.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "direct_link",
      "عدد_العينات_المفحوصة": 200,
      "معاينة_العينات": [
        "Score: 1.20 | AR: في البداية حققوا بعض المكاسب بما في ذلك الاستيلاء على تلة استراتيجية. | EN: Initially, they made some gains, including capturing a strategic hill.",
        "Score: 1.19 | AR: اطلع عليه بتاريخ 24 أبريل 2011. Yemen deal may be done within week: officials. | EN: Yemen deal may be done within week: officials.",
        "Score: 1.19 | AR: عن \"رب العالمين\" سبحانه وتعالى. | EN: Opsaridium ubangiense."
      ],
      "مشاكل_مكتشفة": [
        "أخطاء ترجمة دلالية خطيرة: بعض الأزواج غير مترابطة معنوياً إطلاقاً (مثال: 'عن رب العالمين سبحانه وتعالى' مقابل 'Opsaridium ubangiense' وهو اسم نوع سمكي)",
        "خطأ في العينة الأولى: 'إلى ربها ناظرة: أي منتظرة لرحمته ودخول جنته' ترجمت إلى 'He is sometimes seen having arguments with his lord' وهي ترجمة خاطئة تماماً",
        "نسبة 11.5% من العينات تحتوي على نصوص إنجليزية مختلطة في حقل المصدر العربي، ناتجة عن مراجع ويكيبيديا وعناوين أجنبية",
        "نسبة 5.5% من العينات تحتوي على ضوضاء مراجع ويكيبيديا مثل 'اطلع عليه بتاريخ' متبوعة بنص إنجليزي",
        "بعض الأزواج هي نسخ متطابقة عربي-عربي وليست ترجمات فعلية (مثل: 'ماذا تعرف عن تركستان الشرقية' في كلا الجانبين)",
        "رابط HuggingFace المسجّل في البيانات الوصفية (Tyler/wikimatrix_collapsed) يشير إلى مجموعة فارغة لا تحتوي على أي بيانات"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "حجم كبير من الجمل المتوازية العربية-الإنجليزية المستخرجة تلقائياً",
      "البيانات متاحة مجاناً للتحميل المباشر من خوادم Facebook/Meta",
      "كل زوج جمل مرفق بدرجة تطابق رقمية تسمح بالترشيح حسب الجودة المطلوبة",
      "منهجية علمية موثقة ومنشورة في مؤتمر EACL المرموق",
      "تغطية واسعة لأزواج اللغات (1620 زوج) مما يتيح الترجمة المحورية",
      "حوالي 86.5% من العينات المفحوصة ذات جودة مقبولة على الأقل من حيث عدم وجود ضوضاء واضحة"
    ],
    "نقاط_الضعف": [
      "وجود أخطاء ترجمة دلالية خطيرة في بعض الأزواج عالية الدرجة، مما يعني أن درجة التطابق ليست مؤشراً موثوقاً بالكامل",
      "تلوث بنصوص إنجليزية في حقل المصدر العربي بنسبة ملحوظة (11.5%)",
      "ضوضاء ناتجة عن مراجع ويكيبيديا وبيانات وصفية غير مفيدة للترجمة",
      "لا يوجد تقسيم اختبار رسمي في مجموعة البيانات",
      "رابط HuggingFace في البيانات الوصفية معطّل (المجموعة فارغة)",
      "الترخيص المسجّل في البيانات الوصفية (Apache-1.0) يختلف عن الترخيص الفعلي لمحتوى ويكيبيديا (CC-BY-SA)",
      "حجم البيانات العربية صغير نسبياً (4435 جملة) مقارنة بالحجم الكلي للمشروع (135 مليون)"
    ],
    "الاستخدامات_الموصى_بها": [
      "تدريب نماذج الترجمة الآلية العربية-الإنجليزية كمصدر بيانات تكميلي بعد ترشيح العتبة",
      "بحوث استخراج النصوص المتوازية وتقييم طرق التعدين التلقائي",
      "إثراء بيانات التدريب للغات منخفضة الموارد عبر الترجمة المحورية",
      "تجارب مقارنة لتقييم جودة الاستخراج التلقائي مقابل الترجمة البشرية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 55,
      "التوثيق": 65,
      "السلامة_الأخلاقية": 75,
      "الترخيص": 55,
      "قابلية_إعادة_الإنتاج": 70,
      "المراجعة_العلمية": 80,
      "جودة_البيانات": 45
    },
    "المصادر_المفتوحة": [
      "https://dl.fbaipublicfiles.com/laser/WikiMatrix/v1/WikiMatrix.ar-en.tsv.gz",
      "https://huggingface.co/datasets/Tyler/wikimatrix_collapsed",
      "https://github.com/facebookresearch/LASER/tree/master/tasks/WikiMatrix",
      "https://aclanthology.org/2021.eacl-main.115/"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2021,
    "Tasks": [
      "machine translation"
    ],
    "Form": "text",
    "Volume": 4435.0,
    "Unit": "sentences",
    "License": "Apache-1.0",
    "HF Link": "https://hf.co/datasets/Tyler/wikimatrix_collapsed",
    "Paper Link": "https://github.com/facebookresearch/LASER/tree/master/tasks/WikiMatrix",
    "Domain": [
      "wikipedia"
    ],
    "Authors": [
      "Holger Schwenk",
      "Vishrav Chaudhary",
      "Shuo Sun",
      "Hongyu Gong",
      "Francisco Guzmán"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  },
  {
    "slug": "arabic_dev2",
    "الاسم": "مجموعة استعلامات DBpedia العربية - الإصدار الثاني",
    "الاسم_الأصلي": "Arabic DEv2",
    "درجة_الجودة": 55,
    "تقدير_الجودة": "مقبول",
    "الملخص": "مجموعة بيانات صغيرة تتكون من 139 استعلاماً مترجماً من مجموعة DBpedia Entity v2 الإنجليزية إلى العربية الفصحى الحديثة، وتُستخدم لمهمة استرجاع الكيانات من قواعد المعرفة العربية. البيانات بسيطة البنية وتتكون من عمودين فقط (معرّف واستعلام) دون تعليقات توضيحية أو أحكام صلة مرفقة. جودة الترجمة مقبولة بشكل عام لكن توجد مشاكل شكلية ملحوظة مثل استخدام الشرطة المائلة العكسية للتذكير والتأنيث ووجود مسافات زائدة في عدد من الاستعلامات. حجم المجموعة صغير جداً (139 استعلاماً فقط من أصل 467) مما يحدّ من فائدتها كمعيار تقييم شامل.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 139,
      "معاينة_العينات": [
        "{'id': 'QALD2_te-59', 'query': 'ولايات أمريكية في نفس منطقة ولاية يوتا الزمنية'}",
        "{'id': 'QALD2_tr-8', 'query': 'ولايات ألمانيا يحكمها الحزب الاشتراكي الديمقراطي'}",
        "{'id': 'SemSearch_LS-21', 'query': 'والدا ليلي ألين'}"
      ],
      "مشاكل_مكتشفة": [
        "استخدام الشرطة المائلة العكسية (\\) في 10 استعلامات للفصل بين صيغتي المذكر والمؤنث، مثل: 'مالك \\ مالكة استوديوهات يونيفرسال' — وهذا أسلوب غير معياري في النصوص العربية",
        "وجود مسافات زائدة في بداية أو نهاية 5 استعلامات على الأقل، مثل: ' مقعد فلوريدا مقاطعة داد'",
        "وجود مسافة مزدوجة في استعلام واحد: 'الفائزون بلقب الصانعين  ببطولة الفورمولا 1'",
        "تكرار استعلام واحد بنفس النص تماماً ('دول المحور في الحرب العالمية الثانية') بمعرّفين مختلفين (INEX_XER-87 و SemSearch_LS-4)",
        "بعض الاستعلامات تحتوي على كلمات إنجليزية غير مترجمة مثل 'hs850' و'MN'",
        "البيانات لا تتضمن أحكام صلة (relevance judgments) أو أي تعليقات توضيحية — فقط نصوص الاستعلامات"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "ترجمة بشرية للاستعلامات إلى العربية الفصحى الحديثة وليست آلية",
      "البيانات متاحة مجاناً بترخيص CC BY 4.0 المفتوح",
      "معرّفات الاستعلامات تتوافق مع المعرّفات الأصلية في DBpedia Entity v2 مما يسهل الربط مع أحكام الصلة الإنجليزية",
      "البيانات منشورة في ورقة بحثية محكّمة في ورشة WANLP المتخصصة ومتاحة على منصتي Zenodo وHuggingFace",
      "تغطي فئات متنوعة من الاستعلامات (QALD2، INEX، SemSearch، TREC Entity) مما يوفر تنوعاً في أنماط الأسئلة",
      "مبادرة مهمة لسد فجوة في موارد استرجاع الكيانات للغة العربية"
    ],
    "نقاط_الضعف": [
      "حجم المجموعة صغير جداً: 139 استعلاماً فقط من أصل 467 في المجموعة الأصلية (أقل من 30%)",
      "بنية البيانات بسيطة للغاية: عمودان فقط (معرّف واستعلام) بدون أحكام صلة أو تعليقات توضيحية مرفقة",
      "مشاكل شكلية في النصوص: مسافات زائدة وأحرف خاصة غير معيارية واستعلام مكرر",
      "لا توجد معلومات واضحة عن منهجية ضمان جودة الترجمة أو عدد المترجمين أو اتفاق التعليق التوضيحي",
      "لا يوجد تقسيم تدريب/اختبار — فقط تقسيم تحقق (validation) واحد",
      "استخدام أسلوب غير معياري للتعامل مع التذكير والتأنيث بالشرطة المائلة العكسية بدلاً من صياغة محايدة",
      "لا تتضمن المجموعة أي بيانات وصفية إضافية مثل نوع الكيان المطلوب أو مستوى صعوبة الاستعلام"
    ],
    "الاستخدامات_الموصى_بها": [
      "تقييم أنظمة استرجاع الكيانات من قواعد المعرفة العربية (بالاقتران مع أحكام الصلة من المجموعة الأصلية)",
      "اختبار أنظمة البحث الدلالي العربية على استعلامات متنوعة",
      "البحث في تحديات استرجاع المعلومات عبر اللغات (cross-lingual) بين الإنجليزية والعربية",
      "استخدامها كنقطة انطلاق لبناء مجموعة تقييم عربية أشمل لاسترجاع الكيانات"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 85,
      "التوثيق": 45,
      "السلامة_الأخلاقية": 90,
      "الترخيص": 95,
      "قابلية_إعادة_الإنتاج": 55,
      "المراجعة_العلمية": 65,
      "جودة_البيانات": 50
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/ArabicDEv2",
      "https://aclanthology.org/2021.wanlp-1.24/",
      "https://aclanthology.org/2021.wanlp-1.24.pdf",
      "https://zenodo.org/record/4560653"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2021,
    "Tasks": [
      "entity retrieval"
    ],
    "Form": "text",
    "Volume": 139.0,
    "Unit": "sentences",
    "License": "CC BY 4.0",
    "HF Link": "https://hf.co/datasets/arbml/ArabicDEv2",
    "Paper Link": "https://aclanthology.org/2021.wanlp-1.24.pdf",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Saher Esmeir"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "workshop"
  },
  {
    "slug": "a7'ta",
    "الاسم": "أخطاء",
    "الاسم_الأصلي": "A7'ta",
    "درجة_الجودة": 52,
    "تقدير_الجودة": "مقبول",
    "الملخص": "مجموعة بيانات أحادية اللغة متوازية للعربية الفصحى الحديثة، مصممة لتصحيح الأخطاء النحوية واللغوية. تحتوي على أزواج من الجمل الخاطئة ونظيراتها الصحيحة، مستخرجة يدوياً من كتاب 'كشاف الأخطاء اللغوية' المتخصص بأخطاء الصحافة السعودية. تغطي ثمانية أنواع من الأخطاء تشمل الأخطاء النحوية والصرفية والإملائية والدلالية والأسلوبية واستعمال الألفاظ الدخيلة وعلامات الترقيم. الحجم صغير جداً (62 صفاً فقط في نسخة HuggingFace مقابل 445 جملة في الوصف الأصلي)، مما يحد من استخدامها كمورد تدريبي فعّال لنماذج التعلم العميق، لكنها تقدم مساهمة نوعية قيّمة في توثيق أنواع الأخطاء اللغوية العربية.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 62,
      "معاينة_العينات": [
        "خطأ: 'كاريزما، فايف ستار، اوبريت' → صحيح: 'هيئة، قبول، خمس نجوم، رواية غنائية' — استبدال ألفاظ أجنبية بعربية فصحى",
        "خطأ: 'وضع الباعة الغير سعوديين' → صحيح: 'وضع الباعة غير السعوديين' — تصحيح خطأ نحوي في استخدام 'الغير'",
        "خطأ: 'كما تم مناقشة المراحل' → صحيح: 'كما نوقشت المراحل' — تصحيح استخدام 'تم' الزائد وبناء الفعل للمجهول"
      ],
      "مشاكل_مكتشفة": [
        "وجود علامة BOM (ترتيب البايت) في 58 من أصل 62 صفاً، مما قد يسبب مشاكل في المعالجة",
        "تناقض كبير في الحجم: الوصف يذكر 300 وثيقة و445 جملة، لكن نسخة HuggingFace تحتوي على 62 صفاً فقط",
        "كل صف يحتوي على عدة جمل مدمجة بأسطر جديدة بدلاً من فصل كل زوج (خطأ/صحيح) في صف مستقل",
        "حالة واحدة من عدم تطابق عدد الأسطر بين العمودين (23 خطأ مقابل 24 صحيح)",
        "إجمالي الكلمات حوالي 499 كلمة فقط، وهو حجم ضئيل جداً لتدريب نماذج تعلم آلي",
        "الترخيص غير محدد مما يخلق غموضاً قانونياً حول إعادة الاستخدام"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "تغطية متنوعة لثمانية أنواع من الأخطاء اللغوية العربية (نحوية، صرفية، إملائية، دلالية، أسلوبية، ألفاظ دخيلة، ترقيم، لغوية عامة)",
      "الأخطاء والتصحيحات واقعية ومستمدة من مصادر صحفية حقيقية عبر كتاب متخصص",
      "جودة التصحيحات اللغوية عالية وتعكس خبرة لغوية دقيقة — مثل تصحيح 'الغير سعوديين' إلى 'غير السعوديين'",
      "البيانات متاحة مجاناً على كل من GitHub وHuggingFace",
      "مدعومة بورقة بحثية منشورة في مجلة علمية محكّمة (Data in Brief)"
    ],
    "نقاط_الضعف": [
      "الحجم صغير للغاية (62 صفاً، حوالي 499 كلمة) مما يجعلها غير كافية لتدريب نماذج تعلم عميق",
      "تناقض بين الحجم المُعلن (300 وثيقة، 445 جملة) والحجم الفعلي على HuggingFace (62 صفاً) — يبدو أن البيانات مجمّعة بشكل خاطئ",
      "لا يوجد تقسيم للبيانات (تدريب/اختبار/تحقق) مما يصعّب التقييم المنهجي",
      "بنية البيانات غير مثالية: الأسماء 'false' و'correct' غير وصفية، والجمل مدمجة في صفوف بدلاً من فصلها",
      "الترخيص غير معروف مما يحد من إمكانية إعادة الاستخدام التجاري",
      "لا يوجد تصنيف لنوع الخطأ في البيانات ذاتها رغم وجود هذا التصنيف في مستودع GitHub الأصلي",
      "مشاكل تقنية في الترميز (علامات BOM متكررة)"
    ],
    "الاستخدامات_الموصى_بها": [
      "مرجع تعليمي لأنواع الأخطاء اللغوية الشائعة في الصحافة العربية",
      "بيانات اختبار أو تقييم لأنظمة التصحيح النحوي العربي (وليس للتدريب بسبب صغر الحجم)",
      "دراسة لسانية لأنماط الأخطاء اللغوية في العربية المعاصرة",
      "دمجها مع مجموعات بيانات أخرى أكبر مثل QALB لتوسيع تغطية أنواع الأخطاء"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 75,
      "التوثيق": 55,
      "السلامة_الأخلاقية": 85,
      "الترخيص": 20,
      "قابلية_إعادة_الإنتاج": 50,
      "المراجعة_العلمية": 65,
      "جودة_البيانات": 45
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/A7ta",
      "https://github.com/iwan-rg/A-Monolingual-Arabic-Parallel-Corpus-",
      "https://www.sciencedirect.com/science/article/pii/S2352340918315397"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2019,
    "Tasks": [
      "grammatical analysis",
      "misspelling detection"
    ],
    "Form": "text",
    "Volume": 300.0,
    "Unit": "documents",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/arbml/A7ta",
    "Paper Link": "https://www.sciencedirect.com/science/article/pii/S2352340918315397",
    "Domain": [
      "books"
    ],
    "Authors": [
      "Nora Madi",
      "Hend Suliman Al-Khalifa"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "journal"
  },
  {
    "slug": "antcorpus",
    "الاسم": "مجموعة أخبار عربية ANT",
    "الاسم_الأصلي": "ANTCORPUS",
    "درجة_الجودة": 52,
    "تقدير_الجودة": "مقبول",
    "الملخص": "مجموعة بيانات نصية عربية تتكون من 10,161 مقال إخباري مصنف إلى 9 فئات، جُمعت عبر تقنية الزحف من خلاصات RSS لموقع JawharaFM الإخباري التونسي. تستخدم لمهام تصنيف النصوص العربية. جودة النصوص العربية جيدة بشكل عام ومقروءة وسليمة لغوياً، إلا أن المجموعة تعاني من عدم توازن حاد بين الفئات حيث تشكل فئة الأخبار المحلية وحدها 47.6% من البيانات بينما تشكل فئة التكنولوجيا 0.8% فقط، كما توجد 23 عينة فارغة تماماً و195 عينة مكررة. الترخيص مخصص وغير واضح مما يحد من إمكانية إعادة الاستخدام.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 10161,
      "معاينة_العينات": [
        "وضعت معلمة ألمانية تبلغ من العمر 65 عاما أربعة توائم في برلين وهم 3 أولاد وبنت. وقالت قناة \"آر تي إل\" الألمانية إن المواليد الأربعة لديهم فرصة قوية في النجاة، لكن لا يستبعد ظهور تعقيدات فيما بعد...",
        "أكد اليوم الثلاثاء، عبد الكريم عمري مدير جهوي للتجهيز بجندوبة، انقطاع حركة المرور على مستوى طريق جهوية اثر انهيار جزء من أحد المعابر. وقال في تصريح لمراسل \"الجوهرة أف أم\"...",
        "دخلت، الثلاثاء، \"خدمة التجول الافتراضي غوغل\" (Google Street View)، بتونس حيز التطبيق وستمكن من تغطية 15 مدينة تونسية في خطوة ترمي الى ابراز صورة البلاد كوجهة سياحية وثقافية وتكنولوجية..."
      ],
      "مشاكل_مكتشفة": [
        "عدم توازن حاد في التصنيفات: فئة localNews تمثل 47.6% بينما technology تمثل 0.8% فقط",
        "وجود 23 عينة فارغة تماماً (تحتوي فقط على سطر جديد) موزعة على عدة فئات",
        "وجود 195 عينة مكررة بالكامل (1.9% من البيانات)",
        "وجود أحرف غير مرئية (non-breaking space \\xa0) في 4,766 عينة (46.9% من البيانات)",
        "البيانات على HuggingFace تفتقر إلى تسميات وصفية للفئات وتستخدم أرقاماً فقط",
        "لا يوجد تقسيم للبيانات إلى مجموعات تدريب واختبار (تقسيم train فقط)",
        "البيانات أحادية المصدر (JawharaFM فقط) مما يحد من التنوع اللغوي والموضوعي"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "النصوص العربية سليمة لغوياً ومقروءة وذات جودة تحريرية جيدة كونها مقالات إخبارية محررة",
      "تغطي 9 فئات موضوعية متنوعة (سياسة، تكنولوجيا، رياضة، اقتصاد، مجتمع، أخبار محلية، متفرقات، أخبار دولية، ثقافة)",
      "حجم معقول يبلغ 10,161 مقالاً مع أطوال نصوص متنوعة (من بضعة أحرف إلى 9,854 حرف)",
      "متاحة مجاناً على كل من GitHub وHuggingFace مما يسهل الوصول إليها",
      "مدعومة بورقة بحثية منشورة في مؤتمر IEEE/ACS محكّم",
      "البيانات الأصلية على GitHub بصيغة XML TREC القياسية وتحتوي على حقول غنية مثل العنوان والمصدر والتاريخ والرابط"
    ],
    "نقاط_الضعف": [
      "عدم توازن حاد في توزيع الفئات مما يؤثر سلباً على أداء نماذج التصنيف",
      "وجود عينات فارغة ومكررة يدل على عدم كفاية عملية تنظيف البيانات",
      "نسخة HuggingFace تفقد معلومات قيمة موجودة في النسخة الأصلية (العنوان، المصدر، التاريخ، الرابط)",
      "الترخيص مخصص (custom) وغير واضح مما قد يعيق الاستخدام التجاري والأكاديمي",
      "لا يوجد تقسيم قياسي إلى مجموعات تدريب واختبار مما يصعّب المقارنة المعيارية",
      "البيانات مستخرجة من مصدر إخباري واحد فقط (JawharaFM) مما يحد من تعميم النتائج",
      "عدم تطابق بين وصف البيانات الوصفية (6,005 وثيقة) والعدد الفعلي على HuggingFace (10,161 عينة) دون توضيح للفرق بين النسخ"
    ],
    "الاستخدامات_الموصى_بها": [
      "تصنيف النصوص الإخبارية العربية مع مراعاة عدم توازن الفئات واستخدام تقنيات المعالجة المناسبة",
      "التدريب المسبق أو الضبط الدقيق لنماذج اللغة العربية على نصوص إخبارية",
      "البحث في مجال معالجة اللغة العربية الطبيعية كمرجع أساسي لمقارنة أداء المصنفات",
      "تحليل المحتوى الإخباري العربي واستخلاص المعلومات"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 75,
      "التوثيق": 50,
      "السلامة_الأخلاقية": 75,
      "الترخيص": 30,
      "قابلية_إعادة_الإنتاج": 45,
      "المراجعة_العلمية": 60,
      "جودة_البيانات": 48
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/antcorpus",
      "https://github.com/antcorpus/antcorpus.data",
      "https://ieeexplore.ieee.org/abstract/document/8308275/authors#authors"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2017,
    "Tasks": [
      "topic classification"
    ],
    "Form": "text",
    "Volume": 6005.0,
    "Unit": "documents",
    "License": "custom",
    "HF Link": "https://hf.co/datasets/arbml/antcorpus",
    "Paper Link": "https://ieeexplore.ieee.org/abstract/document/8308275/authors#authors",
    "Domain": [
      "news articles"
    ],
    "Authors": [
      "Amina Chouigui",
      "Oussama Ben Khiroun",
      "Bilel Elayeb"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  },
  {
    "slug": "aqmar",
    "الاسم": "أقمار - مجموعة بيانات التعرف على الكيانات المسماة العربية",
    "الاسم_الأصلي": "AQMAR Arabic NER Corpus",
    "درجة_الجودة": 52,
    "تقدير_الجودة": "مقبول",
    "الملخص": "مجموعة بيانات AQMAR هي مدونة لغوية تحتوي على حوالي 67,000 كلمة مُعلَّمة يدوياً للتعرف على الكيانات المسماة، مستخرجة من 28 مقالة في ويكيبيديا العربية. تتضمن كيانات من أنواع أساسية (شخص، موقع، منظمة) بالإضافة إلى أنواع متنوعة خاصة بالمجال (MIS0-MIS3). رغم أهميتها التاريخية كمورد مبكر لمعالجة اللغة العربية الطبيعية، إلا أن نسخة HuggingFace تعاني من مشاكل جودة واضحة في التسميات تشمل 27 فئة تسمية بعضها مشوّه أو خاطئ بشكل واضح (مثل OO وIO وB-MIS1` وB-ENGLISH وB-SPANISH)، كما تحتوي على 62 خطأ في تناسق تنسيق BIO، مما يشير إلى أن عملية تحويل البيانات إلى صيغة HuggingFace لم تتم بعناية كافية.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 67012,
      "معاينة_العينات": [
        "راؤول(B-PER) غونزاليس(I-PER) أو(O) راؤول(B-PER) أو(O) الفتى(O) المدلل(O) لاعب(O) كرة(O) قدم(O) إسباني(O) ولد(O) في(O) 27(O) يونيو(O) 1977(O) في(O) مدريد(B-LOC) في(O) إسبانيا(B-LOC)",
        "بطولة(B-MIS1) الدوري(I-MIS1) ست(O) مرات(O) وكأس(B-MIS1) السوبر(I-MIS1) الإسباني(I-MIS1) ثلاثة(O) مرات(O) وكأس(B-MIS1) إنتركونتينتال(I-MIS1)",
        "راؤول(B-PER) كجائزة(B-MIS2) الفرانس(I-MIS2) فوتبول(I-MIS2) لراؤول(B-PER) اوين(B-PER) ليفربول(B-LOC)"
      ],
      "مشاكل_مكتشفة": [
        "وجود 27 فئة تسمية بينما المتوقع حوالي 9-13 فئة فقط، مع تسميات مشوّهة مثل: B-MIS1` (بعلامة اقتباس خلفية)، OO (تكرار خاطئ لتسمية O)، IO (تكرار خاطئ لتسمية I مع O)، I--ORG (شرطة مزدوجة)، B-ENGLISH، B-SPANISH، B-MISS، B-MISS1",
        "62 خطأ في تناسق تنسيق BIO حيث تظهر تسميات I- بدون تسمية B- سابقة مطابقة، مثل: I-ORG بعد O، وI-MIS1 بعد B-MIS0، وI-MIS2 بعد B-MIS1",
        "التسميات المشوّهة تؤثر على عينات محددة مثل: الكلمة 'O' مُعلَّمة كـ B-ENGLISH، و'O'Donnell' مُعلَّمة كـ B-SPANISH بدلاً من B-PER، و'16' مُعلَّمة كـ OO",
        "البيانات على HuggingFace مُقسَّمة على مستوى الكلمة المفردة بدون فواصل واضحة بين الجمل أو المقالات، مما يُصعِّب إعادة بناء السياق",
        "لا يوجد قسم اختبار (test split) منفصل رغم أن البيانات الأصلية قد تحتوي على تقسيمات"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "النصوص العربية سليمة بشكل عام وقابلة للقراءة، مستخرجة من مقالات ويكيبيديا حقيقية",
      "التعليقات التوضيحية الأساسية (B-PER، I-PER، B-LOC، I-LOC، B-ORG، I-ORG، O) صحيحة ومتسقة في معظم الحالات",
      "تغطي أنواع كيانات متنوعة تشمل الأشخاص والمواقع والمنظمات والكيانات المتنوعة بمستويات مختلفة",
      "ورقة بحثية منشورة في مؤتمر EACL 2012 المرموق مع منهجية واضحة",
      "مجانية الوصول بترخيص CC BY-SA 3.0",
      "حجم معقول يبلغ 67,012 كلمة لمهمة التعرف على الكيانات المسماة"
    ],
    "نقاط_الضعف": [
      "نسخة HuggingFace تحتوي على تسميات مشوّهة وخاطئة لا تتطابق مع نظام التسمية الأصلي المذكور في الورقة البحثية",
      "62 خطأ في تناسق تنسيق BIO تُضعِف موثوقية البيانات للتدريب المباشر",
      "عدم وجود قسم اختبار أو تحقق منفصل يجعل التقييم المقارن صعباً",
      "البيانات مُسطَّحة على مستوى الكلمة بدون بنية جمل أو مقالات، مما يفقد السياق المهم",
      "صفحة HuggingFace تفتقر إلى التوثيق (ملف README فارغ) ولا تذكر الترخيص",
      "حجم البيانات صغير نسبياً (67 ألف كلمة) مقارنة بمجموعات البيانات الحديثة",
      "أنواع الكيانات المتنوعة (MIS0-MIS3) غير موثقة بشكل كافٍ في نسخة HuggingFace"
    ],
    "الاستخدامات_الموصى_بها": [
      "التعرف على الكيانات المسماة في النصوص العربية بعد تنظيف التسميات المشوّهة وإصلاح أخطاء BIO",
      "البحث الأكاديمي في مجال معالجة اللغة العربية الطبيعية كمرجع تاريخي",
      "التدريب الأولي أو الضبط الدقيق لنماذج NER العربية مع مراعاة الحاجة لتنظيف البيانات أولاً",
      "دراسة أنماط الكيانات المسماة في نصوص ويكيبيديا العربية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 80,
      "التوثيق": 35,
      "السلامة_الأخلاقية": 85,
      "الترخيص": 80,
      "قابلية_إعادة_الإنتاج": 50,
      "المراجعة_العلمية": 75,
      "جودة_البيانات": 45
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/AQMAR",
      "https://www.cs.cmu.edu/~ark/ArabicNER/",
      "https://aclanthology.org/E12-1017/",
      "https://aclanthology.org/E12-1017.pdf"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2012,
    "Tasks": [
      "named entity recognition"
    ],
    "Form": "text",
    "Volume": 74000.0,
    "Unit": "tokens",
    "License": "CC BY-SA 3.0",
    "HF Link": "https://hf.co/datasets/arbml/AQMAR",
    "Paper Link": "https://aclanthology.org/E12-1017.pdf",
    "Domain": [
      "wikipedia"
    ],
    "Authors": [
      "Behrang Mohit",
      "Nathan Schneider",
      "Rishav Bhowmick",
      "Kemal Oflazer",
      "Noah A. Smith"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  },
  {
    "slug": "arabic_named_entities",
    "الاسم": "الكيانات المسماة العربية",
    "الاسم_الأصلي": "Arabic Named Entities",
    "درجة_الجودة": 52,
    "تقدير_الجودة": "مقبول",
    "الملخص": "مجموعة بيانات معجمية تحتوي على حوالي 42,619 كياناً مسمى باللغة العربية، مستخرجة آلياً من ويكيبيديا العربية وWordNet العربي. تتضمن معلومات تشكيلية ودلالية وتصنيفية للكيانات مع ربطها بأنطولوجيا SUMO ومقابلاتها الإنجليزية. رغم قيمتها البحثية كمورد رائد في مجاله عام 2010 وتحقيقها دقة عالية في التقييم الأصلي (95-99%)، إلا أن نسخة البيانات المتاحة على HuggingFace تعاني من مشكلة جوهرية في إزاحة الأعمدة تؤثر على نحو 31% من السجلات، مما يجعل حقول عديدة تحتوي قيماً خاطئة. كما أن نسبة كبيرة من الحقول فارغة (95% لحقل UNGEGN و93% لحقل DIN31635)، والقيم مخزنة بصيغة غير معيارية تتضمن اسم الحقل كبادئة داخل القيمة نفسها.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 42619,
      "معاينة_العينات": [
        "kiform:ar_أرتور_جورج | formArabicPointed:أَرْتُور_جُورْج | InstanceOf:ar_لاعِب_التَّنِس#lAEb | diac_confidence:2 | stable:1",
        "kiform:ar_أرثر_هندرسون | formArabicPointed:أَرثر_هندرسُوْن | InstanceOf:ar_سِيَاسِيّ#syAsy | english:en_Arthur_Henderson | ont:sumo#Position",
        "kiform:ar_أرخانجيلسك | formArabicPointed:أَرْخَانْجِيْلسك | InstanceOf:ar_مَدِينَة#mdynp | ont:sumo#City | english:en_Arkhangelsk"
      ],
      "مشاكل_مكتشفة": [
        "إزاحة في الأعمدة تؤثر على 13,301 سجل (31% من البيانات) حيث تنتقل القيم إلى أعمدة خاطئة، مثلاً حقل InstanceOf يحتوي قيمة ont وحقل ont يحتوي قيمة english",
        "القيم مخزنة بصيغة غير معيارية تتضمن اسم الحقل كبادئة (مثل kiform:ar_أرتور بدلاً من ar_أرتور فقط)، مما يتطلب معالجة إضافية قبل الاستخدام",
        "حقل formUNGEGN فارغ في 95% من السجلات (40,739 من 42,619)",
        "حقل formDIN31635 فارغ في 93% من السجلات (39,663 من 42,619)",
        "حقل english فارغ في 61% من السجلات، وحقل ont فارغ في 70%",
        "حقل stable يحتوي على قيم sense_id منزاحة في بعض السجلات بدلاً من القيم المتوقعة (0 أو 1)",
        "قيمة diac_confidence تحتوي على alias في 113 سجلاً بدلاً من قيمة رقمية",
        "1,621 سجل (3.8%) بدون شكل عربي مُشكَّل (formArabicPointed فارغ)",
        "لا يوجد تقسيم اختباري منفصل رغم ادعاء صفحة HuggingFace بوجوده"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "حجم كبير نسبياً يبلغ 42,619 كياناً مسمى عربياً مع تشكيل",
      "تنوع جيد في أنواع الكيانات: أشخاص (لاعبون، سياسيون، علماء)، أماكن (مدن، بلدان، مقاطعات)، منظمات (شركات، أحزاب)، وغيرها",
      "النصوص العربية سليمة ومقروءة في الغالبية العظمى من السجلات",
      "توفر معلومات تشكيلية (حركات) للكيانات المسماة العربية وهو أمر نادر",
      "ربط دلالي مع أنطولوجيا SUMO ومقابلات إنجليزية في جزء من السجلات",
      "ورقة بحثية منشورة في مؤتمر LREC مع تقييم كمي ونوعي",
      "متاحة مجاناً على HuggingFace بصيغة Parquet"
    ],
    "نقاط_الضعف": [
      "مشكلة إزاحة الأعمدة الخطيرة التي تجعل 31% من البيانات غير موثوقة دون معالجة يدوية",
      "صيغة تخزين القيم غير معيارية (بادئة اسم الحقل داخل القيمة) تعيق الاستخدام المباشر",
      "الترخيص غير محدد مما يثير تساؤلات حول إمكانية الاستخدام التجاري",
      "البيانات قديمة (2010) وقد تفتقر إلى كيانات حديثة",
      "نسبة كبيرة من الحقول فارغة خاصة أنظمة الكتابة البديلة والمقابلات الإنجليزية",
      "لا يوجد تقسيم اختباري معياري",
      "التوثيق على HuggingFace شبه معدوم ولا يشرح هيكل البيانات أو مشاكلها",
      "البيانات على HuggingFace لا تطابق تماماً ما تصفه الورقة البحثية (42,619 بدلاً من 45,000 والصيغة مختلفة عن LMF)"
    ],
    "الاستخدامات_الموصى_بها": [
      "بناء معجم كيانات مسماة عربية بعد تنظيف مشاكل الإزاحة والتنسيق",
      "تدريب أو تقييم أنظمة التعرف على الكيانات المسماة في النصوص العربية",
      "مرجع للتشكيل الآلي لأسماء العلم العربية",
      "دراسات مقارنة حول تطور موارد الكيانات المسماة العربية",
      "ربط الكيانات العربية بمقابلاتها الإنجليزية وتصنيفاتها الدلالية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 75,
      "التوثيق": 35,
      "السلامة_الأخلاقية": 80,
      "الترخيص": 20,
      "قابلية_إعادة_الإنتاج": 50,
      "المراجعة_العلمية": 70,
      "جودة_البيانات": 40
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/Arabic_Named_Entities",
      "https://aclanthology.org/L10-1548/",
      "https://sourceforge.net/projects/arabicnes/",
      "http://doras.dcu.ie/15979/1/An_automatically_built_Named_Entity_lexicon_for_Arabic.pdf"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2010,
    "Tasks": [
      "named entity recognition"
    ],
    "Form": "text",
    "Volume": 45000.0,
    "Unit": "tokens",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/arbml/Arabic_Named_Entities",
    "Paper Link": "http://doras.dcu.ie/15979/1/An_automatically_built_Named_Entity_lexicon_for_Arabic.pdf",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Mohammed Attia",
      "Antonio Toral",
      "L. Tounsi",
      "M. Monachini",
      "Josef van Genabith"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  },
  {
    "slug": "arabic_rc_datasets",
    "الاسم": "مجموعات بيانات الفهم القرائي العربي",
    "الاسم_الأصلي": "Arabic RC datasets (Arabic_RC_AQA)",
    "درجة_الجودة": 52,
    "تقدير_الجودة": "مقبول",
    "الملخص": "مجموعة بيانات للفهم القرائي والإجابة على الأسئلة بالعربية الفصحى، تحتوي على 1008 عينة في مجموعة AQA الفرعية، وهي جزء من مشروع أكبر يضم 2862 جملة موزعة على ثلاث مجموعات فرعية. تم إنشاء البيانات بطريقة شبه آلية تتضمن جمع أسئلة واقعية ثم البحث عن فقرات إجابة عبر محرك Google واسترجاع المستندات. النصوص العربية سليمة لغوياً بشكل عام لكنها مأخوذة من مواقع إلكترونية متنوعة الجودة مما يُدخل ضوضاء كثيرة من إعلانات ونصوص تنسيقية غير ذات صلة في الفقرات. المجموعة محدودة الحجم نسبياً وتفتقر إلى ترخيص واضح وتقسيم اختباري، مما يحدّ من فائدتها كمعيار مرجعي مستقل.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 1008,
      "معاينة_العينات": [
        "سؤال: 'من هو الصحابي الذي لقب بأمين هذه الأمة ؟' | الإجابة: 'أبو عبيده عامر بن الجراح' | التصنيف: factoid/human | الفقرة: نص طويل (6000+ حرف) من مقال ويب عن سيرة أبي عبيدة بن الجراح يتضمن نصوصاً إعلانية",
        "سؤال: 'من هو الصحابي الذي سماه الرسول عليه الصلاة والسلام غسيل الملائكة ؟' | الإجابة: 'حنظلة بن أبي عامر' | التصنيف: factoid/human | الفقرة: مقال ويب عن حنظلة بن أبي عامر الأنصاري",
        "سؤال: 'من هو قائد معركة نهاوند ؟' | الإجابة: 'النعمان بن مقرن' | التصنيف: factoid/human | الفقرة: نص من موقع تعليمي يتضمن عبارات ترحيبية ونصوص موقع غير ذات صلة بالمحتوى"
      ],
      "مشاكل_مكتشفة": [
        "الفقرات تحتوي على كمية كبيرة من الضوضاء: إعلانات مواقع، نصوص تنسيقية، حقوق نشر، روابط تنقل، وعبارات ترحيبية لا علاقة لها بالسؤال",
        "بعض الفقرات طويلة جداً بشكل غير معقول (أطول فقرة 32,767 حرف) مما يشير إلى أنها صفحات ويب كاملة لم تُنظَّف",
        "متوسط طول الفقرة 6,173 حرف وهو مرتفع جداً لمهمة الفهم القرائي، مما يعني أن معظم النص ضوضاء لا علاقة لها بالإجابة",
        "بعض الإجابات قصيرة جداً (حرف واحد فقط) مما قد يشير إلى مشاكل في جودة التعليقات التوضيحية",
        "الفقرات مأخوذة من مواقع عربية متنوعة الجودة وتتضمن أخطاء إملائية وأسلوبية من المصادر الأصلية",
        "لا يوجد تقسيم اختباري مما يصعّب استخدام المجموعة كمعيار مرجعي قياسي",
        "بعض الفقرات تكرر نفس المعلومة من مصادر متعددة ملصقة معاً في فقرة واحدة",
        "المجموعة على HuggingFace تحتوي فقط على 1,008 عينة (مجموعة AQA) من أصل 2,862 المذكورة في الوصف"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "النصوص العربية سليمة لغوياً في الأسئلة والإجابات بشكل عام",
      "لا يوجد تكرار في الأسئلة (0 أسئلة مكررة من أصل 1,008)",
      "تصنيف الأسئلة غني ومتنوع يشمل 2 تصنيفات رئيسية و12 تصنيفاً فرعياً",
      "البيانات متاحة مجاناً على كل من GitHub وHuggingFace مما يسهّل الوصول إليها",
      "الأسئلة واقعية ومتنوعة تغطي مجالات دينية وتاريخية وثقافية",
      "مدعومة بورقة بحثية منشورة في مؤتمر علمي محكّم (ACIT 2020)",
      "تحتوي على تصنيفات فرعية مفيدة مثل factoid/non-factoid وhuman/entity/numeric/location"
    ],
    "نقاط_الضعف": [
      "الفقرات ملوثة بكمية كبيرة من ضوضاء صفحات الويب (إعلانات، تنقل، حقوق نشر)",
      "حجم المجموعة صغير نسبياً (1,008 عينة) مقارنة بمعايير الفهم القرائي الحديثة",
      "لا يوجد تقسيم اختباري (test split) مما يحدّ من استخدامها كمعيار مرجعي",
      "الترخيص غير محدد مما يخلق غموضاً قانونياً حول إعادة الاستخدام",
      "الفقرات طويلة جداً (متوسط 6,173 حرف) مما يجعل مهمة الفهم القرائي صعبة التقييم",
      "لا يوجد توثيق كافٍ على صفحة HuggingFace (بدون بطاقة بيانات مفصلة)",
      "المجموعة على HuggingFace تحتوي فقط على جزء AQA ولا تشمل مجموعتي CLEF وTREC",
      "بعض الإجابات قصيرة للغاية (حرف واحد) مما يثير تساؤلات عن جودة التعليقات التوضيحية",
      "المحتوى يغلب عليه الطابع الديني والتاريخي مما يحدّ من تنوع المجالات"
    ],
    "الاستخدامات_الموصى_بها": [
      "تجارب أولية على نماذج الإجابة على الأسئلة بالعربية مع الحاجة لتنظيف الفقرات أولاً",
      "دراسة تصنيف الأسئلة العربية باستخدام التصنيفات الفرعية المتوفرة",
      "بحث أكاديمي مقارن مع مجموعات بيانات فهم قرائي عربية أخرى",
      "تدريب أنظمة استرجاع المعلومات العربية كمرحلة أولية مع بيانات إضافية",
      "لا يُنصح باستخدامها كمعيار مرجعي وحيد بسبب صغر الحجم وغياب التقسيم الاختباري"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 80,
      "التوثيق": 40,
      "السلامة_الأخلاقية": 75,
      "الترخيص": 20,
      "قابلية_إعادة_الإنتاج": 55,
      "المراجعة_العلمية": 60,
      "جودة_البيانات": 42
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/Arabic_RC_AQA",
      "https://github.com/MariamBiltawi/Arabic_RC_datasets",
      "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9300111"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2020,
    "Tasks": [
      "question answering"
    ],
    "Form": "text",
    "Volume": 2862.0,
    "Unit": "sentences",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/arbml/Arabic_RC_AQA",
    "Paper Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9300111",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Mariam Biltawi",
      "A. Awajan",
      "Sara Tedmori"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  },
  {
    "slug": "arabic_wikipedia_20230101_bots",
    "الاسم": "ويكيبيديا العربية 20230101 (مع مقالات البوتات)",
    "الاسم_الأصلي": "Arabic_Wikipedia_20230101_bots",
    "درجة_الجودة": 52,
    "تقدير_الجودة": "مقبول",
    "الملخص": "مجموعة بيانات مستخلصة من تفريغ ويكيبيديا العربية بتاريخ 1 يناير 2023، تشمل جميع المقالات بما فيها تلك المُنشأة آلياً بواسطة البوتات. تحتوي على حوالي 1,087,947 مقالة بحجم 1.11 جيجابايت بصيغة Parquet. أُنشئت في سياق دراسة بحثية تهدف لتقييم تأثير المحتوى غير العضوي (المُنتج بالبوتات) على أداء نماذج معالجة اللغة العربية الطبيعية. جودة النصوص متوسطة حيث تعاني من تشوهات واضحة في الحروف ناتجة عن عملية المعالجة، مع اختلاط بيانات ويكيبيديا الوصفية (تصنيفات ووسوم) بالنص الأساسي. البيانات مفيدة لأغراض البحث في تأثير جودة المدونات النصية على النماذج اللغوية، لكنها ليست مثالية كمدونة تدريب عامة بسبب احتوائها المقصود على محتوى منخفض الجودة مُنتج آلياً.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 10,
      "معاينة_العينات": [
        "الماء هو المركب الكيميائي الأكثر وفرة في الأرض يتأل جزيء الماء من ذر أكسجين مركزية ترتبط بها ذر تا هيدروجين برابطة تساهمية لتكون صيغته الجزيء الماء سائل عند الظروف القياسية من الضغط ودرجة الحرا...",
        "ملف تصغير براون ألمانيا ملف تصغير بك يسار أحدث نموذج تلفاز أو وار بالعالم بتقنية وصلة ملف الت از أو الرائي الجمع رائيات أو التلفزة أو التلفزيون أو الم ناة أو هو تحويل مشهد متحرك...",
        "ملف تصغير فيديو بناء شبكة العنكبوت الر لاوات رتبة من صف العنكبيات وهي أكبر رتبة في هذا الصف إذا تشمل أكثر من نوع في جنس وأكثر من مئة فصيلة حيوان صغير وذكره يدعي عنكب أما أنثاه فهي العنكبوت..."
      ],
      "مشاكل_مكتشفة": [
        "تشوه واضح في الحروف العربية: حذف أجزاء من الكلمات مثل 'الت از' بدلاً من 'التلفاز'، 'ور' بدلاً من 'صور'، 'ذر' بدلاً من 'ذرة'",
        "اختلاط وسوم ويكيبيديا وتصنيفاتها مع النص الأساسي (مثل 'ملف تصغير'، 'تصنيف أصنوفات'، 'وصلات خارجية')",
        "فقدان التشكيل والحركات بشكل كامل مع بتر بعض الحروف خاصة في المقالات الطويلة",
        "بعض النصوص تبدو مبتورة أو مشوهة بشكل يصعب قراءته خاصة في مقالة الحرف اللاتيني F حيث أصبح النص شبه غير مقروء",
        "لا يوجد فصل بين محتوى المقالة والبيانات الوصفية مما يؤثر على جودة التدريب",
        "المجموعة تحتوي عمداً على مقالات مُنتجة بالبوتات وهي بطبيعتها أقل جودة لغوياً"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "حجم كبير يتجاوز مليون مقالة مما يوفر تغطية واسعة للمفردات العربية",
      "مرتبطة بورقة بحثية محكّمة منشورة في مؤتمر ArabicNLP 2023 التابع لجمعية اللسانيات الحاسوبية",
      "متاحة مجاناً بترخيص MIT المفتوح",
      "سهلة الوصول عبر مكتبة datasets من HuggingFace وتدعم التحميل المتدفق",
      "تخدم غرضاً بحثياً محدداً ومهماً: دراسة تأثير المحتوى الآلي على أداء النماذج اللغوية",
      "مُنشأة من مصدر موثوق (تفريغ ويكيبيديا الرسمي) بتاريخ محدد وقابل للتحقق"
    ],
    "نقاط_الضعف": [
      "تشوهات واضحة في النصوص ناتجة عن عملية المعالجة مما يقلل من جودة المحتوى اللغوي",
      "تحتوي عمداً على مقالات مُنتجة بالبوتات وهي أقل جودة وتمثيلاً للغة العربية الحقيقية",
      "لا يوجد فصل أو تصنيف بين المقالات البشرية ومقالات البوتات داخل المجموعة نفسها",
      "اختلاط البيانات الوصفية لويكيبيديا (وسوم، تصنيفات، أوامر ملفات) مع النص المفيد",
      "عدم وجود تقسيم للبيانات (لا يوجد قسم اختبار أو تحقق)",
      "التوثيق على صفحة HuggingFace محدود ولا يشرح بالتفصيل خطوات المعالجة والتنظيف",
      "بعض المقالات الطويلة جداً تحتوي على نصوص شبه غير مقروءة بسبب تشوه الحروف"
    ],
    "الاستخدامات_الموصى_بها": [
      "البحث في تأثير المحتوى المُنتج آلياً على أداء نماذج معالجة اللغة الطبيعية العربية",
      "المقارنة مع مجموعات بيانات ويكيبيديا الأخرى (بدون بوتات) لدراسة الفروق في الجودة",
      "تدريب نماذج لغوية مقنّعة لأغراض بحثية مع مراعاة القيود المذكورة",
      "دراسة خصائص المحتوى الآلي في ويكيبيديا العربية وتطوير أدوات كشف المحتوى المُولّد آلياً"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 90,
      "التوثيق": 50,
      "السلامة_الأخلاقية": 75,
      "الترخيص": 95,
      "قابلية_إعادة_الإنتاج": 70,
      "المراجعة_العلمية": 80,
      "جودة_البيانات": 40
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/SaiedAlshahrani/Arabic_Wikipedia_20230101_bots",
      "https://aclanthology.org/2023.arabicnlp-1.19/",
      "https://aclanthology.org/2023.arabicnlp-1.19.pdf"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2023,
    "Tasks": [
      "language modeling"
    ],
    "Form": "text",
    "Volume": 1000000.0,
    "Unit": "documents",
    "License": "MIT License",
    "HF Link": "https://hf.co/datasets/SaiedAlshahrani/Arabic_Wikipedia_20230101_bots",
    "Paper Link": "https://aclanthology.org/2023.arabicnlp-1.19.pdf",
    "Domain": [
      "wikipedia"
    ],
    "Authors": [
      "Saied Alshahrani",
      "Norah Alshahrani",
      "Soumyabrata Dey",
      "Jeanna Matthews"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  },
  {
    "slug": "acqad",
    "الاسم": "مجموعة بيانات الإجابة على الأسئلة العربية المعقدة",
    "الاسم_الأصلي": "ACQAD - Arabic Complex Question Answering Dataset",
    "درجة_الجودة": 45,
    "تقدير_الجودة": "مقبول",
    "الملخص": "مجموعة بيانات ACQAD مخصصة للإجابة على الأسئلة العربية المعقدة، وتحتوي على أسئلة متعددة القفزات وأسئلة مقارنة مولّدة تلقائياً من صناديق المعلومات في ويكيبيديا العربية باستخدام قوالب محددة. تتضمن كل عينة سؤالاً معقداً مع تفكيكه إلى أسئلة فرعية بسيطة وسياق داعم. رغم أن الفكرة قيّمة والبنية منظمة، إلا أن جودة التوليد التلقائي تعاني من مشاكل لغوية ملحوظة تشمل غياب حروف الجر في نحو 32% من الأسئلة، وأخطاء في صياغة القوالب مثل استخدام كلمة 'غات' بدلاً من 'لغات'، وبعض الإجابات غير المنطقية. كما أن المجموعتين الفرعيتين على HuggingFace تحتويان على بيانات متطابقة تماماً رغم تسميتهما بأسماء مختلفة (multihop و comparison)، والحجم الفعلي المتاح هو 2,985 عينة فقط بدلاً من 118,841 المُدّعاة.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 2985,
      "معاينة_العينات": [
        "سؤال: كم تبلغ مساحة بلد اللاعبة إيلونا سلوبيانيك التي حطمت الرقم القياسي في منافسة دفع الجلة في دورة الألعاب الأولمبية الصيفية 1980 ؟ | الإجابة: 108179 كيلومتر مربع",
        "سؤال: ما هي عملة البلد الذي نظم الألعاب الأولمبية الصيفية لعام 1948 ؟ | الإجابة: جنيه إسترليني",
        "سؤال: ما هو السلطة القضائية البلد بأكبر كثافة سكانية ؟ | الإجابة: شعار موناكو [إجابة خاطئة]"
      ],
      "مشاكل_مكتشفة": [
        "تطابق كامل بين المجموعتين الفرعيتين: acqad_multihop و acqad_comparison تحتويان على نفس البيانات بالضبط (2,985 عينة متطابقة المعرّفات والمحتوى)",
        "الحجم الفعلي 2,985 عينة فقط بدلاً من 118,841 المُدّعاة في الورقة والوصف، أي أقل من 2.5% من الحجم المُعلن",
        "غياب حرف الجر قبل كلمة 'بلد' في 972 سؤالاً (32.6%)، مثل 'معدل التضخم بلد' بدلاً من 'معدل التضخم في بلد'",
        "أخطاء في القوالب: استخدام 'غات' بدلاً من 'لغات' في 3 عينات",
        "أخطاء في التطابق بين الجنس النحوي: 'ما هو السلطة القضائية' بدلاً من 'ما هي السلطة القضائية'",
        "تراكيب نحوية مكسورة في 40 عينة مثل 'البلد بأكبر كثافة سكانية'",
        "إجابات غير منطقية: مثل 'شعار موناكو' كإجابة عن السلطة القضائية",
        "47 سؤالاً مكرراً في المجموعة الواحدة",
        "الأسئلة مولّدة آلياً بقوالب متكررة جداً مما يحدّ من التنوع اللغوي",
        "لا يوجد تقسيم للبيانات إلى مجموعات تدريب واختبار وتحقق"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "بنية منظمة وواضحة: كل عينة تحتوي على سؤال معقد وتفكيكه إلى أسئلة فرعية مع إجاباتها",
      "توفر سياق داعم طويل ومفصّل لكل سؤال مستخرج من ويكيبيديا العربية",
      "الإجابات موجودة فعلياً داخل السياق في معظم العينات (9 من 10 عينات مفحوصة)",
      "تغطي مواضيع متنوعة: رياضة، جغرافيا، سياسة، اقتصاد، تاريخ",
      "البيانات متاحة مجاناً على HuggingFace بتنسيق Parquet سهل التحميل",
      "فكرة التفكيك التدريجي للأسئلة المعقدة قيّمة لأبحاث الاستدلال متعدد الخطوات"
    ],
    "نقاط_الضعف": [
      "فجوة ضخمة بين الحجم المُعلن (118,841) والمتاح فعلياً (2,985) — أقل من 2.5%",
      "المجموعتان الفرعيتان متطابقتان تماماً رغم تسميتهما multihop و comparison، مما يلغي التمييز بين نوعي الأسئلة",
      "أخطاء لغوية منهجية ناتجة عن التوليد بالقوالب تؤثر على ثلث الأسئلة تقريباً",
      "لا يوجد تقسيم إلى مجموعات تدريب واختبار وتحقق",
      "الترخيص غير معروف، مما يحدّ من الاستخدام التجاري والأكاديمي",
      "بطاقة بيانات HuggingFace فارغة تقريباً — لا توثيق كافٍ",
      "تنوع لغوي محدود جداً: الأسئلة تتبع أنماطاً قالبية واضحة (مثل 'كم تبلغ الكثافة السكانية لبلد اللاعب...')",
      "الورقة البحثية منشورة في مؤتمر غير معروف على نطاق واسع (ICCSAITCS)",
      "بعض الإجابات تحتوي على بيانات وصفية من ويكيبيديا بدلاً من إجابات فعلية"
    ],
    "الاستخدامات_الموصى_بها": [
      "يمكن استخدامها كنقطة بداية لأبحاث الإجابة على الأسئلة المعقدة بالعربية مع ضرورة تنظيف البيانات أولاً",
      "مناسبة للتجارب الأولية والنماذج التجريبية في مجال تفكيك الأسئلة متعددة القفزات",
      "يمكن الاستفادة من بنية التفكيك لتدريب نماذج الاستدلال التدريجي بعد معالجة الأخطاء اللغوية",
      "غير مناسبة للاستخدام المباشر في أنظمة الإنتاج بسبب المشاكل اللغوية والحجم الصغير"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 70,
      "التوثيق": 25,
      "السلامة_الأخلاقية": 75,
      "الترخيص": 15,
      "قابلية_إعادة_الإنتاج": 35,
      "المراجعة_العلمية": 30,
      "جودة_البيانات": 38
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/acqad_multihop",
      "https://huggingface.co/datasets/arbml/acqad_comparison",
      "https://hal.science/hal-03992129v1/preview/ICCSAITCS_2022_paper_9032.pdf"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2022,
    "Tasks": [
      "question answering"
    ],
    "Form": "text",
    "Volume": 118841.0,
    "Unit": "sentences",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/arbml/acqad_multihop,https://hf.co/datasets/arbml/acqad_comparison",
    "Paper Link": "https://hal.science/hal-03992129v1/preview/ICCSAITCS_2022_paper_9032.pdf",
    "Domain": [
      "wikipedia"
    ],
    "Authors": [
      "Abdellah HAMOUDA SIDHOUM",
      "M'Hamed MATAOUI",
      "Faouzi SEBBAk",
      "Kamel SMAILI"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  },
  {
    "slug": "ai_society_translated",
    "الاسم": "مجتمع الذكاء الاصطناعي - مترجم",
    "الاسم_الأصلي": "AI Society Translated",
    "درجة_الجودة": 45,
    "تقدير_الجودة": "مقبول",
    "الملخص": "مجموعة بيانات مترجمة آلياً تضم حوالي 25,000 محادثة بين وكيلين يعتمدان على GPT-3.5-turbo، حيث يؤدي كل وكيل دوراً مختلفاً (مستخدم ومساعد) من بين 50 دوراً متنوعاً في 10 مهام لكل تركيبة. الترجمة العربية مفهومة بشكل عام لكنها تعاني من خلط لغوي واضح حيث تبقى بعض الكلمات والعبارات بالإنجليزية (مثل Solution و Instruction) في نحو 12% من الرسائل. كما توجد رسائل فارغة (Empty string) تشير إلى فشل في توليد المحتوى الأصلي. البيانات مناسبة كمورد تكميلي للبحث في أنظمة الوكلاء متعددة الأدوار لكنها ليست مثالية للضبط الدقيق المباشر للنماذج العربية بسبب مشاكل جودة الترجمة.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 500,
      "معاينة_العينات": [
        "role_1: Accountant_RoleType.ASSISTANT | id: 001_001_001 | message_1: 'تعليمات: تحديد المخاطر الرئيسية التي تواجه المنظمة في الامتثال للوائح التدقيق الضريبي والمالي الجديدة.' | message_2: 'الحل: إجراء تقييم للمخاطر لتحديد المخاطر الرئيسية...'",
        "role_1: Accountant_RoleType.ASSISTANT | id: 001_001_002 | message_1: 'التعليمة: تحديد نظام التقارير المالية الحالي المستخدم.' | message_2: 'الحل: لتحديد النظام الحالي لتقارير المالية المستخدم، سنقوم بمراجعة الوثائق والأنظمة الموجودة حالياً...'",
        "role_1: Accountant_RoleType.ASSISTANT | id: 001_001_003 | message_1: 'التعليمات: استعراض خطة النفقات الحالية للقسم.' | message_2: 'Empty string.' — رسالة فارغة تدل على فشل في التوليد"
      ],
      "مشاكل_مكتشفة": [
        "خلط لغوي: 677 رسالة من أصل 5679 (حوالي 12%) تبدأ بكلمات إنجليزية مثل Solution: أو Instruction: أو Input: بدلاً من ترجمتها",
        "رسائل فارغة: 16 رسالة من 500 عينة تحتوي على 'Empty string' مما يدل على فشل في توليد الاستجابة الأصلية",
        "الحقول الوصفية (original_task و specified_task و role_1 و role_2) بقيت بالإنجليزية بالكامل دون ترجمة",
        "عدم اتساق في ترجمة المصطلحات: كلمة 'الطلب التالي' و 'Next request' تظهران معاً في نفس السياق",
        "بعض الترجمات حرفية وركيكة مثل 'المعاملة المرفوعة العلم الأحمر' بدلاً من 'المعاملة المشبوهة' أو 'المعاملة المرفوع عليها علامة تحذير'",
        "وجود خطأ هيكلي في ملفات البيانات: بعض الملفات تحتوي على أعمدة إضافية (message_5, message_6) غير موجودة في ملفات أخرى مما يسبب DatasetGenerationCastError",
        "جميع أدوار الرسائل مُعيَّنة كـ 'user' حتى رسائل المساعد مما يُربك بنية الحوار"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "حجم كبير يضم حوالي 25,000 محادثة متعددة الأدوار تغطي 50 دوراً مهنياً متنوعاً",
      "النصوص العربية المترجمة مفهومة بشكل عام والسياق المهني واضح",
      "تنوع المواضيع: محاسبة، تخطيط مالي، تدقيق، إدارة مخاطر، استشارات مالية وغيرها",
      "بنية حوارية منظمة بنمط تعليمات-حل مما يجعلها مناسبة لمهام ضبط التعليمات",
      "متاحة مجاناً على HuggingFace مع دعم 10 لغات بما فيها العربية",
      "مرتبطة بورقة بحثية منشورة في NeurIPS 2023 مما يعطيها مصداقية أكاديمية"
    ],
    "نقاط_الضعف": [
      "الترجمة آلية بالكامل دون مراجعة بشرية واضحة مما يؤدي إلى خلط لغوي في 12% من الرسائل",
      "وجود رسائل فارغة (Empty string) تشير إلى فشل في التوليد الأصلي ولم تُعالج قبل النشر",
      "الحقول الوصفية والمهام الأصلية بقيت بالإنجليزية مما يحد من فائدة المجموعة للمستخدمين العرب",
      "ترجمة حرفية لبعض المصطلحات تنتج تعبيرات غير طبيعية بالعربية",
      "لا يوجد توثيق لطريقة الترجمة أو أداة الترجمة المستخدمة أو أي تقييم لجودتها",
      "البيانات مولَّدة بالكامل بواسطة GPT-3.5-turbo وليست محادثات بشرية حقيقية",
      "الترخيص CC-BY-NC-4.0 يمنع الاستخدام التجاري",
      "لا يوجد تقسيم للاختبار مما يصعّب التقييم المعياري",
      "مشكلة هيكلية في عدم تساوي الأعمدة بين ملفات البيانات"
    ],
    "الاستخدامات_الموصى_بها": [
      "البحث الأكاديمي في أنظمة الوكلاء متعددة الأدوار باللغة العربية",
      "التدريب التكميلي لنماذج اللغة العربية على مهام اتباع التعليمات بعد تنظيف الخلط اللغوي",
      "دراسة سلوكيات التفاعل بين وكلاء الذكاء الاصطناعي في سياقات مهنية عربية",
      "تطوير وتقييم أنظمة الترجمة الآلية للمحادثات التقنية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 80,
      "التوثيق": 35,
      "السلامة_الأخلاقية": 40,
      "الترخيص": 60,
      "قابلية_إعادة_الإنتاج": 50,
      "المراجعة_العلمية": 65,
      "جودة_البيانات": 40
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/camel-ai/ai_society_translated",
      "https://arxiv.org/abs/2303.17760"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2024,
    "Tasks": [
      "instruction tuning"
    ],
    "Form": "text",
    "Volume": 25000.0,
    "Unit": "documents",
    "License": "CC BY-NC 4.0",
    "HF Link": "https://hf.co/datasets/camel-ai/ai_society_translated",
    "Paper Link": "https://arxiv.org/pdf/2303.17760",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Guohao Li",
      "Hasan Abed AlKader Hammoud",
      "Hani Itani",
      "Dmitrii Khizbullin",
      "Bernard Ghanem"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "preprint"
  },
  {
    "slug": "aqad__arabic_question-answer_dataset",
    "الاسم": "مجموعة بيانات الأسئلة والأجوبة العربية (AQAD)",
    "الاسم_الأصلي": "AQAD: Arabic Question-Answer Dataset",
    "درجة_الجودة": 45,
    "تقدير_الجودة": "مقبول",
    "الملخص": "مجموعة بيانات AQAD هي مجموعة عربية للإجابة على الأسئلة الاستخراجية تضم 17,911 عينة مبنية على مقالات ويكيبيديا العربية المقابلة لمقالات مجموعة SQuAD الإنجليزية. تم جمع البيانات بطريقة مؤتمتة بالكامل من جامعة الإسكندرية عام 2020. رغم حجمها الجيد وتغطيتها لـ 297 مقالة متنوعة، تعاني المجموعة من مشاكل جوهرية تشمل نسبة 35.8% من الإجابات الفارغة، وأسئلة مترجمة آلياً بشكل واضح مع خلط بين العربية والإنجليزية، مما يُضعف جودتها بشكل ملحوظ. الأداء المنخفض للنماذج المُقيَّمة عليها (F1: 0.37 لـ BERT) قد يعكس مشاكل في البيانات نفسها وليس فقط صعوبة المهمة.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 17911,
      "معاينة_العينات": [
        "العنوان: بيونسيه | السؤال: متى بدأت بيونسي تصبح شعبية؟ | الإجابة: في أواخر التسعينات | السياق: بيونسي جيزيل نولز-كارتر (من مواليد 4 سبتمبر، 1981)...",
        "العنوان: ذا ليجند أوف زيلدا | السؤال: من هي الشخصية الرئيسية في القصة؟ | الإجابة: لينك، | السياق: وتركز القصة على بطل السلسلة لينك، الذي يحاول إنقاذ هيرول...",
        "العنوان: ذا ليجند أوف زيلدا | السؤال: متى يمكن لمالكي GameCube شراء أميرة أسترالية؟ | الإجابة: [فارغة] | السياق: ذا ليجند أوف زيلدا: توايلايت برينسس..."
      ],
      "مشاكل_مكتشفة": [
        "نسبة 35.8% من العينات (6,420 من 17,911) تحتوي على إجابات فارغة تماماً، وهي نسبة مرتفعة جداً تُقلل من الحجم الفعلي القابل للاستخدام",
        "كثير من الأسئلة مترجمة آلياً بشكل واضح من الإنجليزية مع وجود كلمات إنجليزية مخلوطة مثل: GameCube، Link، Twilight Princess، R&B",
        "بعض الأسئلة غير منطقية نتيجة الترجمة الآلية السيئة مثل: 'متى يمكن لمالكي GameCube شراء أميرة أسترالية؟' و'ما الدور الذي لعبه بيونسيه في طفل القدر؟'",
        "11.1% من الإجابات تحتوي على علامات ترقيم ملتصقة (فواصل ونقاط) مما يُشير إلى مشاكل في استخراج الإجابات",
        "0.2% من قيم answer_start غير دقيقة (إزاحة بحرف واحد عن الموقع الصحيح)",
        "الأسئلة المتعلقة بالإجابات الفارغة كثيراً ما تكون أسئلة لا يمكن الإجابة عليها من السياق المعطى، لكن لا يوجد حقل يُميز بين الأسئلة القابلة وغير القابلة للإجابة"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "حجم جيد يبلغ 17,911 عينة تغطي 297 مقالة ويكيبيديا متنوعة المواضيع",
      "تنسيق البيانات متوافق مع معيار SQuAD مما يُسهل استخدامه مع الأدوات والنماذج القائمة",
      "السياقات النصية العربية من ويكيبيديا سليمة لغوياً بشكل عام",
      "البيانات متاحة بسهولة عبر مكتبة HuggingFace Datasets وعبر GitHub",
      "تكرار الأسئلة منخفض جداً (74 سؤالاً مكرراً فقط من أصل 17,911)",
      "تم نشر ورقة بحثية محكّمة في مؤتمر AICCSA"
    ],
    "نقاط_الضعف": [
      "أكثر من ثلث الإجابات فارغة (35.8%) مما يُقلل الحجم الفعلي إلى نحو 11,491 عينة صالحة فقط",
      "الأسئلة مولّدة آلياً عبر ترجمة أسئلة SQuAD الإنجليزية، مما ينتج عنه صياغات غير طبيعية وغير عربية",
      "خلط متكرر بين العربية والإنجليزية في الأسئلة يُعيق استخدام البيانات لتدريب نماذج عربية خالصة",
      "لا يوجد ترخيص محدد للبيانات",
      "لا يوجد تقسيم اختبار (test split) مما يُصعّب المقارنة المعيارية",
      "الوصف يدّعي أنها 'عالية الجودة' لكن الجودة الفعلية متوسطة بسبب الترجمة الآلية والإجابات الفارغة",
      "أداء النماذج المنخفض (F1: 0.37) قد يكون مؤشراً على مشاكل في البيانات وليس فقط صعوبة المهمة"
    ],
    "الاستخدامات_الموصى_بها": [
      "يمكن استخدامها كمصدر مبدئي لتدريب نماذج الإجابة على الأسئلة العربية بعد تنظيف البيانات وتصفية العينات ذات الإجابات الفارغة",
      "مفيدة للأبحاث المقارنة بين أداء نماذج فهم القراءة على النصوص العربية مقابل الإنجليزية",
      "يمكن استخدام السياقات النصية (من ويكيبيديا) بشكل مستقل لمهام أخرى في معالجة اللغة العربية",
      "غير مناسبة للاستخدام المباشر في تطبيقات إنتاجية بسبب مشاكل الجودة، لكنها تصلح كنقطة انطلاق بحثية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 85,
      "التوثيق": 45,
      "السلامة_الأخلاقية": 75,
      "الترخيص": 20,
      "قابلية_إعادة_الإنتاج": 60,
      "المراجعة_العلمية": 55,
      "جودة_البيانات": 35
    },
    "المصادر_المفتوحة": [
      "https://hf.co/datasets/arbml/AQAD",
      "https://github.com/adelmeleka/AQAD",
      "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9316526"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2020,
    "Tasks": [
      "question answering"
    ],
    "Form": "text",
    "Volume": 17911.0,
    "Unit": "sentences",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/arbml/AQAD",
    "Paper Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9316526",
    "Domain": [
      "wikipedia"
    ],
    "Authors": [
      "Adel Atef",
      "Bassam Mattar",
      "Sandra Sherif",
      "Eman Elrefai",
      "Marwan Torki"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  },
  {
    "slug": "arabic_empathetic_dialogues",
    "الاسم": "حوارات التعاطف العربية",
    "الاسم_الأصلي": "Arabic Empathetic Dialogues",
    "درجة_الجودة": 45,
    "تقدير_الجودة": "مقبول",
    "الملخص": "مجموعة بيانات حوارية عربية تتكون من 36,628 زوجاً من السياق والاستجابة التعاطفية، مصنفة بـ 32 تسمية عاطفية. البيانات مترجمة من مجموعة بيانات إنجليزية (Empathetic Dialogues) إلى العربية الفصحى الحديثة، وتُستخدم لتدريب روبوتات محادثة تعاطفية. على الرغم من أهمية المشروع كونه من أوائل الموارد العربية في هذا المجال، إلا أن جودة الترجمة متفاوتة بشكل كبير: حوالي 760 نصاً لم يُترجم أصلاً وبقي بالإنجليزية، و1,404 نص يحتوي على خلط لغوي، فضلاً عن ترجمات حرفية ركيكة للتعابير الاصطلاحية الإنجليزية مثل 'أتعرق بالرصاص' و'ملعقة لامعة'. التوثيق على HuggingFace ناقص جداً والترخيص غير محدد.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 36628,
      "معاينة_العينات": [
        "السياق: 'أتذكر أنني ذهبت لمشاهدة الألعاب النارية مع أعز أصدقائي. كانت هذه هي المرة الأولى التي قضينا فيها وقتًا بمفردنا معًا.' | الاستجابة: 'هل كان هذا صديقًا كنت تحبه أم مجرد أفضل صديق؟' | التسمية: 10",
        "السياق: 'لم أغش زوجتي قط.' | الاستجابة: 'وهذا شيء يجب ألا تفعله أبدًا ، جيد لك.' | التسمية: 28",
        "السياق: 'المقابلات الوظيفية تجعلني دائمًا أتعرق بالرصاص ، وتجعلني غير مرتاح بشكل عام للنظر تحت المجهر من هذا القبيل.' | الاستجابة: 'لا تكن عصبيا. فقط كن مستعدا.' | التسمية: 6"
      ],
      "مشاكل_مكتشفة": [
        "760 نصاً بالإنجليزية بالكامل لم يُترجم (حوالي 2% من المجموعة)، مثل: 'So i got a huge bonus at work last week!'",
        "1,404 نص يحتوي على خلط لغوي بين العربية والإنجليزية، مثل: 'قدت سيارتي إلى Dairy Queen لكنها كانت مغلقة'",
        "ترجمات حرفية ركيكة للتعابير الاصطلاحية: 'أتعرق بالرصاص' (sweating bullets)، 'ملعقة لامعة' (silver spoon)، 'ضرب على جدار فارغ' (hitting a wall)، 'تفعل الخير' (doing good)",
        "273 نصاً قصيراً جداً (5 أحرف أو أقل) بعضها بالإنجليزية مثل 'hi' و'yes' و'yea'",
        "8 أزواج مكررة بالكامل في المجموعة",
        "التسميات العاطفية (0-31) غير موثقة ولا يوجد ربط واضح بين الرقم والعاطفة المقصودة",
        "توثيق المجموعة على HuggingFace ناقص جداً - معظم الحقول تقول 'More Information Needed'",
        "الترخيص غير محدد"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "من أوائل مجموعات البيانات العربية المتخصصة في الحوار التعاطفي",
      "حجم معقول يبلغ 36,628 عينة مع 32 تصنيفاً عاطفياً",
      "متاحة مجاناً على HuggingFace وGitHub مع نموذج BERT2BERT مدرب مسبقاً",
      "مدعومة بورقتين بحثيتين محكمتين منشورتين في ورشة WANLP",
      "التوزيع متوازن نسبياً عبر التسميات العاطفية الـ 32",
      "لا توجد حقول فارغة - جميع السياقات والاستجابات موجودة"
    ],
    "نقاط_الضعف": [
      "جودة الترجمة متفاوتة بشكل كبير مع وجود ترجمات آلية حرفية واضحة",
      "حوالي 6% من النصوص (2,164 نص) تحتوي على محتوى إنجليزي جزئي أو كلي",
      "التعابير الاصطلاحية مترجمة حرفياً مما ينتج عنه نصوص غير طبيعية بالعربية",
      "التسميات العاطفية غير موثقة - لا يوجد تعريف واضح لكل رقم",
      "الترخيص غير محدد مما يعيق الاستخدام التجاري والأكاديمي",
      "التوثيق على HuggingFace شبه معدوم",
      "لا يوجد تقسيم للبيانات (تدريب/اختبار/تحقق)",
      "المحتوى الثقافي مرتبط بالسياق الغربي (عيد الميلاد، Dairy Queen، إلخ) مما يجعله غير ملائم للسياق العربي",
      "الوصف يدعي أن البيانات بالعربية الفصحى الحديثة لكن جزءاً كبيراً ليس كذلك"
    ],
    "الاستخدامات_الموصى_بها": [
      "التجريب الأولي على نماذج الحوار التعاطفي العربي مع الحذر من مشاكل الجودة",
      "البحث الأكاديمي في مجال توليد الاستجابات التعاطفية بالعربية كنقطة انطلاق",
      "دراسة تحديات ترجمة بيانات الحوار التعاطفي عبر اللغات والثقافات",
      "لا يُنصح باستخدامها مباشرة في أنظمة إنتاجية دون تنظيف ومراجعة شاملة"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 85,
      "التوثيق": 30,
      "السلامة_الأخلاقية": 65,
      "الترخيص": 15,
      "قابلية_إعادة_الإنتاج": 55,
      "المراجعة_العلمية": 60,
      "جودة_البيانات": 40
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/arabic_empathetic_conversations",
      "https://github.com/aub-mind/Arabic-Empathetic-Chatbot",
      "https://aclanthology.org/2020.wanlp-1.6/"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2020,
    "Tasks": [
      "dialogue generation"
    ],
    "Form": "text",
    "Volume": 36629.0,
    "Unit": "sentences",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/arbml/arabic_empathetic_conversations",
    "Paper Link": "https://aclanthology.org/2020.wanlp-1.6.pdf",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Tarek Naous",
      "Christian Hokayem",
      "Hazem Hajj"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "workshop"
  },
  {
    "slug": "arabic_news_dataset_about_hajj",
    "الاسم": "مجموعة بيانات الأخبار العربية عن الحج",
    "الاسم_الأصلي": "Arabic news dataset about Hajj",
    "درجة_الجودة": 45,
    "تقدير_الجودة": "مقبول",
    "الملخص": "مجموعة بيانات تحتوي على 899 مقالة إخبارية عربية متعلقة بالحج وخدمات الحجاج، مجمّعة من مصادر إخبارية في ثلاث دول عربية (السعودية ومصر والأردن) بتوزيع متوازن تقريباً. النصوص العربية سليمة لغوياً وجميعها ذات صلة بموضوع الحج، لكن البيانات المتاحة على HuggingFace تمثّل جزءاً صغيراً جداً مما تدّعيه الورقة البحثية المرتبطة (899 مقالة مقابل 30,000 المذكورة في الورقة). التوثيق ضعيف جداً ولا توجد تعليقات توضيحية أو تصنيفات مشاعر رغم أن المهام المعلنة تشمل تحليل المشاعر، مما يحدّ بشكل كبير من فائدة المجموعة للأغراض البحثية.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "direct_link",
      "عدد_العينات_المفحوصة": 899,
      "معاينة_العينات": [
        "قال صاحب السمو الملكي الأمير سعود بن نايف بن عبدالعزيز أمير المنطقة الشرقية رئيس الهيئة العليا لجائزة نايف بن عبدالعزيز آل سعود العالمية للسنة النبوية والدراسات الإسلامية المعاصرة: أرسى جلالة الملك عبدالعزيز بن عبدالرحمن الفيصل آل سعود",
        "أعطي سمير إمبابي، وزير الطيران المدني، تعليمات للشركة القابضة لمصر للطيران بضرورة عدم تطبيق أي زيادة جديدة علي أسعار تذاكر الحج هذا العام (1432هـ /2011م)، مطالبا الشركة وشركاتها التابعة، بمواصلة التخط",
        "ثمن سياسيون أردنيون الخدمات الكبيرة التي تقدمها المملكة العربية السعودية لضيوف الرحمن وجعل رحلتهم الإيمانية أكثر راحة وسهولة. وقدموا في تصريحات لوكالة الأنباء السعودية، التهنئة لخادم الحرمين الشريفي"
      ],
      "مشاكل_مكتشفة": [
        "تناقض كبير بين حجم البيانات المتاحة (899 مقالة) وما تدّعيه الورقة البحثية (حوالي 30,000 مقالة) والوصف في البيانات الوصفية (أكثر من 2000 مقالة)",
        "لا توجد تعليقات توضيحية أو تصنيفات مشاعر رغم أن المهام المعلنة تشمل تحليل المشاعر واسترجاع المعلومات",
        "وجود مقالة واحدة مكررة بالضبط و37 مقالة متشابهة في أول 200 حرف",
        "239 مقالة (27%) تحتوي على مشاكل تنسيق كمسافات مزدوجة",
        "وجود حالة واحدة لمشكلة ترميز في النص",
        "ملف README فارغ تماماً ولا يوجد أي توثيق على صفحة HuggingFace",
        "البيانات بصيغة Excel فقط وليست بصيغة معيارية مثل Parquet أو CSV، مما يمنع عارض HuggingFace من عرضها",
        "الحقول محدودة جداً: عمودان فقط (النص ومصدر الدولة) بدون أي بيانات وصفية إضافية",
        "الترخيص غير محدد"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "جميع المقالات الـ899 ذات صلة مباشرة بموضوع الحج وخدمات الحجاج (100%)",
      "النصوص العربية سليمة لغوياً وخالية من التشويه في الغالبية العظمى",
      "توزيع متوازن بين الدول الثلاث: السعودية (299)، مصر (300)، الأردن (300)",
      "متوسط طول المقالات مناسب (حوالي 1503 حرف) مع حد أدنى 562 وحد أقصى 2274 حرفاً",
      "لا توجد مقالات فارغة أو قصيرة جداً",
      "البيانات متاحة مجاناً للتحميل",
      "مدعومة بورقة بحثية منشورة في مؤتمر IEEE"
    ],
    "نقاط_الضعف": [
      "فجوة ضخمة بين الحجم المعلن في الورقة (30,000) والبيانات المتاحة فعلياً (899) — أقل من 3% مما وُعد به",
      "غياب تام لأي تعليقات توضيحية أو تصنيفات رغم الادعاء بدعم تحليل المشاعر",
      "توثيق شبه معدوم: لا يوجد README ولا بطاقة تعريف للمجموعة",
      "صيغة Excel غير معيارية تعيق التكامل مع أدوات معالجة اللغة الطبيعية",
      "الترخيص غير محدد مما يثير غموضاً حول حقوق الاستخدام",
      "لا يوجد تقسيم للبيانات إلى مجموعات تدريب واختبار",
      "وجود بعض التكرارات والمقالات المتشابهة",
      "لا توجد بيانات وصفية للمقالات مثل التاريخ أو المصدر الإعلامي أو الكاتب"
    ],
    "الاستخدامات_الموصى_بها": [
      "استخدام محدود كمجموعة نصوص خام لنمذجة اللغة العربية في مجال الحج",
      "تدريب أولي لنماذج تصنيف النصوص حسب الدولة المصدر (سعودية/مصر/أردن)",
      "استخراج المصطلحات والمفردات المتخصصة في مجال خدمات الحج",
      "دراسة أولية للأساليب الإخبارية في تغطية موسم الحج عبر الدول العربية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 40,
      "التوثيق": 15,
      "السلامة_الأخلاقية": 70,
      "الترخيص": 15,
      "قابلية_إعادة_الإنتاج": 25,
      "المراجعة_العلمية": 45,
      "جودة_البيانات": 50
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/Haneen84/Arabic_news/tree/main",
      "https://huggingface.co/datasets/Haneen84/Arabic_news/resolve/main/hajj_art.xlsx",
      "https://ieeexplore.ieee.org/document/10085561",
      "https://huggingface.co/datasets/Haneen84/Arabic_news"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2022,
    "Tasks": [
      "sentiment analysis",
      "information retrieval"
    ],
    "Form": "text",
    "Volume": 2000.0,
    "Unit": "documents",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/Haneen84/Arabic_news/tree/main",
    "Paper Link": "https://ieeexplore.ieee.org/document/10085561",
    "Domain": [
      "news articles"
    ],
    "Authors": [
      "Hassanin M. Al-Barhamtoshy",
      "Hanen T. Himdi",
      "Mohamad Alyahya"
    ],
    "Dialect": "Classical Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  },
  {
    "slug": "adpbc",
    "الاسم": "مجموعة بيانات التحليل النحوي العربي القائمة على علاقات التبعية",
    "الاسم_الأصلي": "ADPBC: Arabic Dependency Parsing Based Corpora",
    "درجة_الجودة": 42,
    "تقدير_الجودة": "مقبول",
    "الملخص": "مجموعة بيانات ADPBC هي ذخيرة لغوية عربية محللة نحوياً تتضمن علاقات التبعية (dependency relations) بصيغة CoNLL-U، تشمل 377 جملة و14,209 رمز لغوي موزعة على 16 وثيقة في خمسة مجالات: الرياضة، الدين، الطقس، الأخبار، والطب الحيوي. تتضمن التعليقات التوضيحية 17 سمة صرفية وعلاقات تبعية نحوية مبنية على نموذج Universal Dependencies. رغم أن النصوص العربية سليمة لغوياً بشكل عام، إلا أن المجموعة تعاني من مشاكل ملحوظة في جودة التعليقات التوضيحية تشمل أخطاء إملائية في أسماء التصنيفات، ووسوم أجزاء الكلام غير القياسية، وتصنيفات خاطئة لبعض الجمل، فضلاً عن صغر حجمها الشديد مقارنة بالمجموعات المماثلة.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 15068,
      "معاينة_العينات": [
        "Id:1 | Form:مشكلة | Lemma:مُشكِلَة | UPosTag:NOUN | Feats:Case=Nom|Definite=Cons|Number=Sing | Head:0 | DepRel:root | label:DB_10_SOCILA&ECNOMIC",
        "Id:2 | Form:البطالة | Lemma:بِطَالَة | UPosTag:NOUN | Feats:Case=Gen|Definite=Def|Number=Sing | Head:1 | DepRel:nmod | label:DB_10_SOCILA&ECNOMIC",
        "Id:8 | Form:تواجه | Lemma:وَاجَه | UPosTag:VERB | Feats:Aspect=Imp|Gender=Fem|Mood=Ind|Number=Sing|Person=3|VerbForm=Fin|Voice=Act | Head:6 | DepRel:acl"
      ],
      "مشاكل_مكتشفة": [
        "أخطاء إملائية متعددة في أسماء التصنيفات: BIOMIDICAL بدلاً من BIOMEDICAL، وECNOMIC بدلاً من ECONOMIC، وSOCILA بدلاً من SOCIAL",
        "وجود 389 رمزاً بوسوم UPosTag غير قياسية مثل IDF وIDG وVERF وIDF+D350 وIDF+D199 وIDF+D45 وADJ+D398 وNOUN (بمسافة زائدة)، وهي ليست من وسوم Universal Dependencies المعيارية",
        "تصنيف خاطئ: جمل عن الأرصاد الجوية والطقس مصنفة تحت TEXT_16_ECNOMIC (اقتصادي)، مع تكرار نفس الجمل في TEXT_15_WEATHER",
        "وجود 6 جمل مكررة تماماً عبر تصنيفات مختلفة",
        "حجم المجموعة صغير جداً: 377 جملة فقط و16 وثيقة، وهو أقل بكثير مما هو متوقع لمهام التحليل النحوي",
        "عدم وجود تقسيم للبيانات (train/test/dev)، فالبيانات كلها في تقسيم واحد",
        "بطاقة البيانات على HuggingFace شبه فارغة مع عبارات متعددة '[More Information Needed]'",
        "1,485 صفاً بقيم فارغة (_) في وسوم UPosTag وDepRel، وهي صفوف الكلمات المتعددة الرموز (multi-word tokens) التي قد تكون طبيعية في صيغة CoNLL-U لكنها تشكل نسبة كبيرة",
        "الترخيص غير محدد مما يحد من إمكانية إعادة الاستخدام"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "النصوص العربية سليمة لغوياً ومكتوبة بالعربية الفصحى الحديثة وتغطي مواضيع متنوعة وذات صلة",
      "التعليقات الصرفية غنية ومفصلة تشمل الإعراب والتعريف والعدد والجنس والزمن مع التشكيل في الجذور",
      "البيانات بصيغة CoNLL-U المعيارية مما يسهل التوافق مع أدوات معالجة اللغة الطبيعية",
      "تغطية جيدة لعلاقات التبعية النحوية (33 نوع علاقة) تشمل معظم علاقات Universal Dependencies",
      "البيانات متاحة مجاناً على كل من GitHub وHuggingFace مما يسهل الوصول إليها"
    ],
    "نقاط_الضعف": [
      "حجم المجموعة صغير للغاية (377 جملة فقط) مما يجعلها غير كافية لتدريب نماذج تحليل نحوي فعالة",
      "أخطاء واضحة في التصنيفات الموضوعية: جمل عن الطقس مصنفة تحت الاقتصاد",
      "أخطاء إملائية في أسماء التصنيفات الإنجليزية تدل على ضعف في مراجعة الجودة",
      "وسوم أجزاء كلام غير قياسية (IDF، VERF، IDG) لا تتوافق مع معيار Universal Dependencies",
      "لا يوجد تقسيم للتدريب والاختبار والتحقق، مما يصعّب إجراء تجارب قابلة للمقارنة",
      "التوثيق ضعيف جداً على HuggingFace: لا يوجد وصف أو شرح لحالات الاستخدام أو منهجية التعليق",
      "الورقة البحثية منشورة في مجلة ذات تأثير محدود (IJITCS) وليست في مؤتمرات معالجة اللغة الطبيعية الرئيسية",
      "وجود تكرار في الجمل عبر تصنيفات مختلفة يشير إلى أخطاء في عملية بناء المجموعة"
    ],
    "الاستخدامات_الموصى_بها": [
      "يمكن استخدامها كمرجع تعليمي لفهم بنية بيانات التحليل النحوي العربي وصيغة CoNLL-U",
      "قد تصلح كبيانات تقييم مبدئية محدودة لنماذج التحليل النحوي العربي الموجودة مسبقاً",
      "يمكن دمجها مع مجموعات بيانات أكبر مثل PADT أو Arabic-UD لتوسيع التغطية الموضوعية",
      "لا يُنصح باستخدامها كمجموعة بيانات رئيسية لتدريب نماذج التحليل النحوي بسبب صغر حجمها ومشاكل الجودة"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 75,
      "التوثيق": 25,
      "السلامة_الأخلاقية": 80,
      "الترخيص": 15,
      "قابلية_إعادة_الإنتاج": 35,
      "المراجعة_العلمية": 30,
      "جودة_البيانات": 40
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/ADPBC",
      "https://github.com/salsama/Arabic-Information-Extraction-Corpus",
      "http://www.mecs-press.org/ijitcs/ijitcs-v13-n1/IJITCS-V13-N1-4.pdf"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2021,
    "Tasks": [
      "part of speech tagging",
      "dependency parsing",
      "topic classification"
    ],
    "Form": "text",
    "Volume": 16.0,
    "Unit": "documents",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/arbml/ADPBC",
    "Paper Link": "http://www.mecs-press.org/ijitcs/ijitcs-v13-n1/IJITCS-V13-N1-4.pdf",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Sally Mohamed",
      "Mahmoud Hussien",
      "Hamdy M. Mousa"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "journal"
  },
  {
    "slug": "kde4",
    "الاسم": "مجموعة بيانات KDE4 المتوازية",
    "الاسم_الأصلي": "KDE4",
    "درجة_الجودة": 38,
    "تقدير_الجودة": "ضعيف",
    "الملخص": "مجموعة بيانات متوازية عربية-إنجليزية مستخرجة من ملفات توطين برنامج KDE4، تحتوي على 116,239 زوج جمل. معظم المحتوى عبارة عن عناصر واجهة مستخدم قصيرة (أزرار، قوائم، رسائل خطأ) وليس جملاً طبيعية كاملة، مما يحدّ بشدة من فائدتها للترجمة الآلية العامة. تعاني المجموعة من نسبة تكرار عالية جداً تبلغ 38% من الأسطر، ونحو 13% من الأسطر في العمود العربي لا تحتوي أي حروف عربية أصلاً، بالإضافة إلى أخطاء محاذاة واضحة بين الجمل العربية والإنجليزية. رغم أنها مورد مجاني ومتاح، إلا أن جودة البيانات الفعلية لا ترقى للاستخدام المباشر دون تنظيف وتصفية مكثفين.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "direct_link",
      "عدد_العينات_المفحوصة": 116239,
      "معاينة_العينات": [
        "AR: مانع الإعلانات | EN: Adblock",
        "AR: اضبط... | EN: Configure Filters...",
        "AR: ترويسة التوقيع المعيارية: | EN: Standard signature header:"
      ],
      "مشاكل_مكتشفة": [
        "15,120 سطر (13%) في العمود العربي لا تحتوي أي حروف عربية — بل أسماء تقنية إنجليزية وأرقام وعلامات metadata مثل @action:inmenu",
        "44,609 سطر مكرر (38.4% من المجموعة) — أكثرها كلمة Name المكررة 1,217 مرة وComment المكررة 638 مرة",
        "أخطاء محاذاة واضحة: مثال 'لا يستطيع فتح لـ القراءة' مقابل 'Singapore'، و'صحيح' مقابل 'Substract'",
        "نصوص عربية مشوهة أو ركيكة مثل 'رشح هذا العنصرِّح' و'تفقّد الحالة من وصلات من الكميّات'",
        "معظم الجمل قصيرة جداً (متوسط 27 حرف) وهي عناصر واجهة مستخدم وليست جملاً لغوية طبيعية",
        "وجود علامات تقنية غير منظفة مثل 'صانع المشاهدName' و'أيرلانداworld. kgm' حيث اختلطت النصوص العربية بالإنجليزية",
        "بعض الأسطر تحتوي رموز XML أو KDE غير محذوفة مثل '& تجاهل النوافذ المصغرة'"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "المجموعة متاحة مجاناً ويمكن تحميلها مباشرة من خوادم OPUS",
      "حجم معقول يبلغ 116,239 زوج جمل متوازية",
      "تغطي مجالاً تقنياً محدداً (واجهات البرمجيات) قد يكون مفيداً لتوطين البرمجيات",
      "جزء من مشروع OPUS الموثوق والمنشور في مؤتمر LREC",
      "لا توجد أسطر فارغة في البيانات"
    ],
    "نقاط_الضعف": [
      "نسبة عالية جداً من التكرار (38.4%) تقلل الحجم الفعلي المفيد بشكل كبير",
      "13% من الأسطر العربية لا تحتوي أي نص عربي فعلي",
      "أخطاء محاذاة خطيرة بين الجمل العربية والإنجليزية في عدد غير قليل من الأزواج",
      "المحتوى مقتصر على عناصر واجهة مستخدم قصيرة وليس نصوصاً لغوية طبيعية",
      "جودة الترجمة العربية متفاوتة — بعض الترجمات ركيكة أو غير مكتملة أو مشوهة",
      "الترخيص مخصص (custom) وغير واضح المعالم",
      "لا يوجد تقسيم للاختبار (test split)",
      "الوصف يدّعي 700,000 جملة لكن البيانات الفعلية للعربية-الإنجليزية تحتوي 116,239 فقط"
    ],
    "الاستخدامات_الموصى_بها": [
      "توطين واجهات البرمجيات من الإنجليزية إلى العربية بعد تنظيف البيانات",
      "استخدامها كبيانات تدريب مساعدة (ضمن مجموعات أكبر) للترجمة الآلية في المجال التقني فقط",
      "بناء قواميس مصطلحات تقنية عربية-إنجليزية متخصصة في البرمجيات",
      "لا يُنصح باستخدامها للترجمة الآلية العامة دون تنظيف وتصفية مكثفين"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 75,
      "التوثيق": 40,
      "السلامة_الأخلاقية": 85,
      "الترخيص": 35,
      "قابلية_إعادة_الإنتاج": 65,
      "المراجعة_العلمية": 55,
      "جودة_البيانات": 25
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/Helsinki-NLP/kde4",
      "https://huggingface.co/datasets/Helsinki-NLP/kde4/viewer/ar-en",
      "https://object.pouta.csc.fi/OPUS-KDE4/v2/moses/ar-en.txt.zip"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2012,
    "Tasks": [
      "machine translation"
    ],
    "Form": "text",
    "Volume": 700000.0,
    "Unit": "sentences",
    "License": "custom",
    "HF Link": "https://hf.co/datasets/Helsinki-NLP/kde4",
    "Paper Link": "http://www.lrec-conf.org/proceedings/lrec2012/pdf/463_Paper.pdf",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Jorg Tiedemann"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  },
  {
    "slug": "arabic_business_corpora",
    "الاسم": "مجموعة النصوص العربية التجارية",
    "الاسم_الأصلي": "Arabic Business Corpora (ABMC)",
    "درجة_الجودة": 35,
    "تقدير_الجودة": "ضعيف",
    "الملخص": "مجموعة بيانات تحتوي على 1200 مقال عربي في المجال التجاري والاقتصادي، مقسمة إلى ثلاثة أقسام: بيانات رؤساء الشركات العربية (400)، أخبار اقتصادية (400)، وأخبار سوق الأسهم (400). النصوص الأصلية على SourceForge تأتي بصيغة نص عادي ونسخة مُعلَّمة بعلامات أجزاء الكلام باستخدام Stanford Arabic POS Tagger. إلا أن نسخة HuggingFace تعاني من مشكلة هيكلية جوهرية حيث تم تقسيم النصوص إلى كلمات مفردة (182,619 صف = كلمة واحدة لكل صف)، مما يفقد البيانات بنيتها كمقالات ويجعلها شبه غير صالحة للاستخدام المباشر دون إعادة تجميع. لا توجد ورقة بحثية مرتبطة، والتوثيق شحيح جداً.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 50000,
      "معاينة_العينات": [
        "المضيبي من سعيد بن سيف الحبسي : في اطار الجهود المتواصلة لإنجاح مشروع التعداد الزراعي لعام 2004 2005 م تسعى وزارة الزراعة والثروة السمكية الى تعريف المزارعين ومربي الثروة الحيوانية بماهية التعداد الزراعي وأهميته",
        "تين المرحلة الاولى ستركز على اسس النظريات الادارية والاهداف المنشودة من اعادة الهيكلة اما المرحلة الثانية ستهدف الى تدريب المشاركين على دراسة شركته واعداد تقرير كامل بنفسه من تطوير هيكلها",
        "يزال هناك مرشحان فقط من الكويت وايران لهذا المنصب . يذكر ان الكويت رشحت مدير دائرة البحوث في اوبك الدكتور عدنان شهاب الدين لهذا المنصب هذا ولايعرف بعد فيما اذن ستغير ايران من موقفها"
      ],
      "مشاكل_مكتشفة": [
        "البيانات مُقسَّمة إلى كلمات مفردة: كل صف يحتوي على كلمة واحدة فقط (182,619 صف) بدلاً من مقالات كاملة (1,200 مقال)، مما يدمر البنية النصية بالكامل",
        "لا توجد حدود واضحة بين المقالات: لا يمكن تحديد أين ينتهي مقال ويبدأ آخر بسبب التقسيم إلى كلمات",
        "فقدان التعليقات التوضيحية: علامات أجزاء الكلام (POS tags) المذكورة في الوصف غير موجودة في نسخة HuggingFace",
        "حقل واحد فقط (Text) بدون أي بيانات وصفية أو تصنيفات أو تعليقات توضيحية",
        "لا توجد بطاقة بيانات (dataset card) على HuggingFace",
        "عدم وجود تقسيم إلى مجموعات تدريب واختبار",
        "بعض النصوص تفتقر إلى علامات التشكيل والهمزات (مثل: 'اطار' بدل 'إطار'، 'الى' بدل 'إلى')"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "النصوص العربية سليمة لغوياً وخالية من التشوه (mojibake) بعد إعادة التجميع",
      "المحتوى يغطي فعلاً مواضيع تجارية واقتصادية متنوعة: زراعة، نفط، استثمار، أسهم، إدارة",
      "لا توجد نصوص إنجليزية مختلطة أو محتوى غير عربي",
      "المجموعة متاحة مجاناً للاستخدام البحثي",
      "تنوع جغرافي في المحتوى يشمل عدة دول عربية (عُمان، الكويت وغيرها)"
    ],
    "نقاط_الضعف": [
      "مشكلة هيكلية خطيرة: البيانات مُقسمة إلى كلمات مفردة على HuggingFace مما يجعلها غير قابلة للاستخدام مباشرة",
      "فقدان كامل لعلامات أجزاء الكلام (POS tags) التي تُعد القيمة المضافة الرئيسية للمجموعة",
      "لا توجد ورقة بحثية منشورة مرتبطة بالمجموعة",
      "توثيق شحيح جداً: لا توجد بطاقة بيانات أو وصف تفصيلي للمنهجية",
      "الترخيص غير محدد رسمياً",
      "حجم صغير نسبياً (1,200 مقال فقط) مقارنة بالمجموعات الحديثة",
      "لا يوجد تقسيم إلى مجموعات تدريب واختبار",
      "النصوص تفتقر إلى التشكيل وبعض الهمزات",
      "تاريخ الإنشاء قديم (2016) والبيانات قد تكون أقدم"
    ],
    "الاستخدامات_الموصى_بها": [
      "يمكن استخدامها كمصدر نصي خام للمجال الاقتصادي العربي بعد إعادة تجميع الكلمات إلى مقالات",
      "تدريب نماذج لغوية متخصصة في المجال التجاري والاقتصادي العربي (بعد المعالجة)",
      "بناء قواميس ومعاجم اقتصادية عربية من المفردات المتكررة",
      "لا تصلح في وضعها الحالي على HuggingFace لمهام تصنيف النصوص أو تحليل المشاعر أو وسم أجزاء الكلام"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 40,
      "التوثيق": 15,
      "السلامة_الأخلاقية": 70,
      "الترخيص": 20,
      "قابلية_إعادة_الإنتاج": 25,
      "المراجعة_العلمية": 10,
      "جودة_البيانات": 25
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/buisness_corpora",
      "https://sourceforge.net/projects/arabic-business-copora/",
      "https://www.lancaster.ac.uk/staff/elhaj/corpora.html"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2016,
    "Tasks": [
      "part of speech tagging",
      "topic classification"
    ],
    "Form": "text",
    "Volume": 1200.0,
    "Unit": "documents",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/arbml/buisness_corpora",
    "Paper Link": "",
    "Domain": [
      "web pages"
    ],
    "Authors": [],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": ""
  },
  {
    "slug": "arabic_news_tweets",
    "الاسم": "تغريدات الأخبار العربية",
    "الاسم_الأصلي": "Arabic News Tweets",
    "درجة_الجودة": 35,
    "تقدير_الجودة": "ضعيف",
    "الملخص": "مجموعة بيانات تحتوي على 89,179 تغريدة إخبارية عربية من حسابات سعودية موثقة، مصنفة إلى 5 فئات: أخبار عامة وإقليمية ورياضية واقتصادية وجودة الحياة. المشكلة الجوهرية أن البيانات المتاحة فعلياً على HuggingFace لا تحتوي على نص التغريدة نفسه، بل فقط معرّف التغريدة وتاريخ النشر والتصنيف، مما يجعل المجموعة غير قابلة للاستخدام المباشر في مهام معالجة اللغة الطبيعية دون استرجاع النصوص عبر واجهة تويتر البرمجية التي لم تعد متاحة مجاناً. التوزيع غير متوازن بشكل كبير حيث تشكل الأخبار العامة 71.9% من البيانات.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 89179,
      "معاينة_العينات": [
        "Posted Date: 2020-07-19 17:26:46, Tweet ID: 1284857217766891521, Label: General News, label: 2",
        "Posted Date: 2020-08-01 00:15:53, Tweet ID: 1289308827095977986, Label: Regional News, label: 4",
        "Posted Date: 2020-07-31 22:29:42, Tweet ID: 1289282105717874688, Label: Sport News, label: 0"
      ],
      "مشاكل_مكتشفة": [
        "البيانات لا تحتوي على نص التغريدة نفسه — فقط معرّف التغريدة والتاريخ والتصنيف، مما يجعل المجموعة عديمة الفائدة بدون واجهة تويتر البرمجية",
        "توزيع الفئات غير متوازن بشكل حاد: الأخبار العامة تشكل 71.9% بينما أخبار جودة الحياة تشكل 1.1% فقط",
        "لا يوجد تقسيم للبيانات إلى مجموعات تدريب واختبار — مجموعة تدريب واحدة فقط",
        "واجهة تويتر البرمجية المجانية لم تعد متاحة بعد استحواذ إيلون ماسك على المنصة، مما يجعل استرجاع النصوص مستحيلاً عملياً للباحثين",
        "الوصف يدّعي أن البيانات مفيدة لتصنيف النصوص لكن النصوص غير موجودة في المجموعة المتاحة"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "لا يوجد تكرار في معرّفات التغريدات — جميع المعرّفات فريدة (89,179 معرّف فريد)",
      "لا توجد قيم فارغة في أي من الأعمدة الأربعة",
      "التصنيفات النصية والرقمية متسقة تماماً (كل تصنيف نصي يقابل رقماً واحداً ثابتاً)",
      "نطاق زمني معقول للبيانات يمتد من أغسطس 2016 إلى أغسطس 2020",
      "الترخيص مفتوح CC BY 4.0 مما يسمح بالاستخدام الحر",
      "حجم المجموعة جيد (89,179 تغريدة) مقارنة بمجموعات بيانات عربية أخرى"
    ],
    "نقاط_الضعف": [
      "غياب نص التغريدة هو عيب جوهري يجعل المجموعة غير صالحة للاستخدام المباشر في مهام معالجة اللغة الطبيعية",
      "اختلال حاد في توزيع الفئات: الأخبار العامة 71.9%، الإقليمية 18.4%، الرياضية 5.9%، الاقتصادية 2.7%، جودة الحياة 1.1%",
      "لا يوجد تقسيم اختبار مما يصعّب إعادة إنتاج نتائج الورقة البحثية",
      "الورقة البحثية المرتبطة نُشرت في مجلة Pertanika وليست من المجلات الرائدة في مجال معالجة اللغة الطبيعية",
      "عدم وجود توثيق كافٍ لمنهجية جمع البيانات وأسماء الحسابات المصدرية",
      "الاعتماد على واجهة تويتر البرمجية لاسترجاع النصوص يشكل عائقاً كبيراً خاصة بعد تغييرات سياسة المنصة"
    ],
    "الاستخدامات_الموصى_بها": [
      "دراسة أنماط النشر الزمنية للأخبار السعودية على تويتر (باستخدام البيانات الوصفية المتاحة فقط)",
      "تحليل توزيع فئات الأخبار في الإعلام السعودي",
      "إذا تم استرجاع النصوص: تصنيف النصوص العربية الإخبارية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 50,
      "التوثيق": 30,
      "السلامة_الأخلاقية": 70,
      "الترخيص": 90,
      "قابلية_إعادة_الإنتاج": 20,
      "المراجعة_العلمية": 35,
      "جودة_البيانات": 20
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/Arabic_News_Tweets",
      "https://data.mendeley.com/datasets/9dxgbgx86k/3",
      "https://www.researchgate.net/publication/382564560_A_Deep_Learning-based_Classification_Model_for_Arabic_News_Tweets_Using_Bidirectional_Long_Short-Term_Memory_Networks",
      "http://www.pertanika.upm.edu.my/pjst/browse/regular-issue?article=JST-4625-2023"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2021,
    "Tasks": [
      "topic classification"
    ],
    "Form": "text",
    "Volume": 89179.0,
    "Unit": "sentences",
    "License": "CC BY 4.0",
    "HF Link": "https://hf.co/datasets/arbml/Arabic_News_Tweets",
    "Paper Link": "",
    "Domain": [
      "social media"
    ],
    "Authors": [
      "Karali Sami",
      "Thanoon Mohammed",
      "Lin Chin-Teng"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": ""
  },
  {
    "slug": "arabic_textual_entailment_dataset",
    "الاسم": "مجموعة بيانات الاستلزام النصي العربي",
    "الاسم_الأصلي": "Arabic Textual Entailment Dataset (ArabicTE)",
    "درجة_الجودة": 35,
    "تقدير_الجودة": "ضعيف",
    "الملخص": "مجموعة بيانات للاستلزام النصي العربي تحتوي على 422 زوجاً من المقدمات والفرضيات مستخرجة من مقالات إخبارية عربية، مع تصنيف ثنائي (يستلزم/لا يستلزم). تعاني البيانات من مشاكل ترميز حادة تشمل استبدال حرف الثاء بحرف v اللاتيني في أكثر من 37% من العينات، واستبدال حرف الهمزة بحرف الثاء، فضلاً عن تقطيع الكلمات بمسافات زائدة بسبب معالجة مسبقة خاطئة. حجم المجموعة صغير جداً (422 عينة بدلاً من 600 المُعلن عنها في الوصف) مما يحد من فائدتها في تدريب النماذج. رغم أن توزيع التصنيفات متوازن ومحتوى النصوص مفهوم من السياق، إلا أن مشاكل الترميز تجعلها غير صالحة للاستخدام المباشر دون تنظيف مسبق شامل.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 422,
      "معاينة_العينات": [
        "المقدمة: نشوب اشتباكات ضارية بين قوات الأمن التابعة ل لرئيس اليمني علي عبد الله صالح و بين عناصر مسلحة من أنصار الأحمر في صنعاث | الفرضية: اشتباكات ضارية في صنعاث و صالح يأمر ب اعتقال أنصار الأحمر | التصنيف: لا يستلزم",
        "المقدمة: مسلحون يغتالون علي فيصل اللامي المدير التنفيذي ل هيئة المساثلة و العدالة العراقية في العاصمة العراقية بغداد | الفرضية: العراق: اغتيال مدير هيئة المساثلة و العدالة ب بغداد | التصنيف: يستلزم",
        "المقدمة: بدات قمة مجموعة الدول الصناعية الvماني الكبار أعمال ها الخميس في منتجع دافوليه الساحلي في فرنسا | الفرضية: قمة مجموعة الvماني تبدأ أعمال ها ب مشاركة مصر و تونس | التصنيف: لا يستلزم"
      ],
      "مشاكل_مكتشفة": [
        "مشكلة ترميز خطيرة: حرف الثاء (ث) يُستبدل بحرف v اللاتيني في 157 عينة من أصل 422 (37.2%). أمثلة: الvماني بدلاً من الثماني، آvار بدلاً من آثار، vلاvة بدلاً من ثلاثة، إvر بدلاً من إثر",
        "مشكلة ترميز ثانية: حرف الهمزة (ء) يُستبدل بحرف الثاء (ث) في كلمات كثيرة. أمثلة: صنعاث بدلاً من صنعاء، أنباث بدلاً من أنباء، علماث بدلاً من علماء، المساثلة بدلاً من المساءلة (89 كلمة فريدة متأثرة)",
        "تقطيع غير طبيعي للكلمات بمسافات زائدة بسبب معالجة صرفية مسبقة: حروف الجر والضمائر المتصلة مفصولة عن كلماتها (ل لرئيس، أعمال ها، وظيفت ه، ب سبب). يؤثر على أغلب العينات (أكثر من 140 عينة لكل نمط)",
        "الحجم الفعلي 422 عينة وليس 600 كما يدّعي الوصف في ملف البيانات الوصفية",
        "البيانات مُخزنة بالنظام اللاتيني (Script: Latin في الوصف) مما يفسر جزئياً مشاكل الترميز، لكن النصوص الفعلية بالخط العربي",
        "تصنيفات الحقل label تحتوي مسافة زائدة في البداية: ' NotEntails' و ' Entails' بدلاً من 'NotEntails' و 'Entails'"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "توزيع متوازن للتصنيفات: 202 عينة لا يستلزم (47.9%) و 220 عينة يستلزم (52.1%)",
      "لا توجد تكرارات: جميع الأزواج البالغ عددها 422 فريدة",
      "محتوى النصوص مفهوم من السياق رغم مشاكل الترميز، ومستمد من أخبار عربية حقيقية متنوعة",
      "مهمة الاستلزام النصي مفيدة لفهم اللغة العربية ونادرة نسبياً في الموارد العربية",
      "مرتبطة بورقة بحثية منشورة في مجلة علمية محكّمة (JAIR)",
      "متاحة مجاناً على منصة HuggingFace وقابلة للتحميل مباشرة"
    ],
    "نقاط_الضعف": [
      "مشاكل ترميز حادة تجعل أكثر من ثلث البيانات مشوهة حرفياً (استبدال ث بـ v واستبدال ء بـ ث)",
      "تقطيع صرفي مسبق يفصل حروف الجر والضمائر المتصلة بمسافات، مما يجعل النصوص غير طبيعية",
      "حجم صغير جداً (422 عينة) لا يكفي لتدريب نماذج تعلم آلي فعّالة",
      "تناقض بين الحجم المُعلن (600 عينة) والحجم الفعلي (422 عينة)",
      "لا يوجد تقسيم للبيانات إلى مجموعات تدريب واختبار وتحقق",
      "الترخيص غير معروف مما يحد من إمكانية إعادة الاستخدام التجاري",
      "الرابط الأصلي للبيانات (جامعة مانشستر) لا يعمل حالياً",
      "التوثيق على HuggingFace شحيح ويشير إلى 'More Information Needed' في عدة حقول"
    ],
    "الاستخدامات_الموصى_بها": [
      "يمكن استخدامها كمجموعة اختبار صغيرة لمهام الاستلزام النصي العربي بعد تنظيف مشاكل الترميز يدوياً",
      "مرجع بحثي لدراسة تطور مجموعات بيانات الاستلزام النصي العربي",
      "لا يُنصح باستخدامها في تدريب النماذج بسبب صغر حجمها ومشاكل الترميز",
      "يمكن استخدامها كنقطة انطلاق لبناء مجموعة بيانات أكبر وأنظف للاستلزام النصي العربي"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 75,
      "التوثيق": 25,
      "السلامة_الأخلاقية": 80,
      "الترخيص": 15,
      "قابلية_إعادة_الإنتاج": 30,
      "المراجعة_العلمية": 60,
      "جودة_البيانات": 20
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/ArabicTE",
      "https://arxiv.org/abs/1402.0578",
      "http://www.cs.man.ac.uk/~ramsay/ArabicTE/"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2013,
    "Tasks": [
      "natural language inference"
    ],
    "Form": "text",
    "Volume": 600.0,
    "Unit": "sentences",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/arbml/ArabicTE",
    "Paper Link": "https://arxiv.org/ftp/arxiv/papers/1402/1402.0578.pdf",
    "Domain": [
      "news articles"
    ],
    "Authors": [
      "Maytham Alabbas",
      "A. Ramsay"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "journal"
  },
  {
    "slug": "aghlat",
    "الاسم": "أغلاط",
    "الاسم_الأصلي": "Aghlat",
    "درجة_الجودة": 32,
    "تقدير_الجودة": "ضعيف",
    "الملخص": "مجموعة بيانات صغيرة جداً (331 عينة فقط) للأخطاء الإملائية في اللغة العربية، تحتوي على كلمات مع اقتراحات تصحيحية. البيانات تعاني من مشاكل جوهرية تشمل وجود كلمات إنجليزية وأحرف لاتينية مفردة ورموز غير عربية ضمن مجموعة بيانات يُفترض أنها عربية بالكامل. الاقتراحات التصحيحية في كثير من الحالات غير منطقية ولا تمثل تصحيحات حقيقية للكلمات الخاطئة، بل تبدو مولّدة آلياً بناءً على التشابه الشكلي فقط. لا توجد ورقة بحثية مرافقة ولا توثيق كافٍ يشرح المنهجية أو مصادر البيانات.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 331,
      "معاينة_العينات": [
        "word='فايز' | n1=15 | suggest='فاير;فأير;قايظ;فزيا;فاي;فاز;فيز;فزاي;يفاز;ففيز;فاغز;فاعز;فاخز;فحيز;فاجز'",
        "word='والأنترت' | n1=3 | suggest='والأنترنت;وال أنترت;وامتلأنا'",
        "word='ماءاً' | n1=13 | suggest='ماساً;ماءا;ماءً;ماصاً;ماءاه;ماداً;ماءاك;ماءان;ماناً;مالاً;ماءاي;موءاً;ماراً'"
      ],
      "مشاكل_مكتشفة": [
        "حجم البيانات صغير جداً: 331 عينة فقط، وهو غير كافٍ لأي تدريب أو تقييم موثوق",
        "وجود 20 كلمة إنجليزية/لاتينية مثل MIKHAIL وFRIDMAN وdivest وtwitter وWorldCup في مجموعة بيانات يُفترض أنها عربية",
        "وجود 9 إدخالات لأحرف مفردة (G, S, l, O, J, Z, s) ورموز (ـ، ️) مع اقتراحات متطابقة وهي الحروف العربية الأبجدية، مما لا يمثل تصحيحاً إملائياً حقيقياً",
        "اقتراحات التصحيح في كثير من الحالات غير منطقية: مثلاً 'اليازجي' اقتراحها الوحيد 'انجيالي' وهو ليس تصحيحاً معقولاً، و'الأبارتايد' اقتراحها 'ارتبال'",
        "الحقل n1 غير موثّق ولا يُعرف ما يمثله بالضبط، رغم أنه يبدو عدد الاقتراحات المقدمة",
        "لا يوجد سياق للكلمات (جمل أو فقرات)، مما يجعل مهمة اكتشاف الأخطاء الإملائية محدودة جداً",
        "بعض الكلمات ليست أخطاءً إملائية بل أسماء أعلام أجنبية معرّبة مثل 'رونالدو' و'ليبيراسيون'",
        "لا توجد ورقة بحثية ولا توثيق يشرح منهجية جمع البيانات أو مصادرها"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "البيانات متاحة مجاناً على GitHub وHuggingFace وسهلة التحميل",
      "الفكرة الأساسية (كوربس أخطاء إملائية عربية) تسد حاجة حقيقية في مجال معالجة اللغة العربية",
      "لا توجد كلمات مكررة في المجموعة (331 كلمة فريدة)",
      "بعض الأمثلة تمثل أخطاءً إملائية حقيقية مفيدة مثل 'والأنترت' بدلاً من 'والأنترنت'"
    ],
    "نقاط_الضعف": [
      "حجم البيانات ضئيل للغاية (331 عينة) ولا يكفي لأي استخدام عملي في التعلم الآلي",
      "خلط بين كلمات عربية وإنجليزية ورموز غير ذات معنى في مجموعة بيانات عربية",
      "اقتراحات التصحيح تبدو مولّدة آلياً وكثير منها غير صحيح لغوياً",
      "غياب تام للتوثيق: لا ورقة بحثية، لا وصف للمنهجية، لا تفسير لحقول البيانات",
      "عدم وجود سياق نصي (جمل) يجعل البيانات محدودة الفائدة لمهمة اكتشاف الأخطاء",
      "الترخيص غير واضح: ملف GitHub يذكر AGPL-3.0 لكن البيانات الوصفية تقول 'غير معروف'",
      "المشروع متوقف منذ 2019 بدون أي تحديثات (3 عمليات إيداع فقط)",
      "لا يوجد تقسيم للبيانات (تدريب/اختبار) مما يصعّب عملية التقييم"
    ],
    "الاستخدامات_الموصى_بها": [
      "يمكن استخدامها كنقطة انطلاق أولية لبناء مجموعة بيانات أكبر للأخطاء الإملائية العربية بعد تنظيفها",
      "مرجع بسيط لفهم أنماط الأخطاء الإملائية الشائعة في النصوص العربية",
      "لا يُنصح باستخدامها مباشرة لتدريب نماذج اكتشاف أو تصحيح الأخطاء الإملائية بسبب صغر حجمها ومشاكل الجودة"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 75,
      "التوثيق": 10,
      "السلامة_الأخلاقية": 80,
      "الترخيص": 35,
      "قابلية_إعادة_الإنتاج": 15,
      "المراجعة_العلمية": 0,
      "جودة_البيانات": 25
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/aghlat",
      "https://github.com/linuxscout/aghlat",
      "https://github.com/linuxscout/aghlat/blob/master/README.md",
      "https://github.com/linuxscout/aghlat/tree/master/resources",
      "https://github.com/linuxscout/aghlat/tree/master/samples"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2019,
    "Tasks": [
      "misspelling detection"
    ],
    "Form": "text",
    "Volume": 331.0,
    "Unit": "tokens",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/arbml/aghlat",
    "Paper Link": "",
    "Domain": [
      "other"
    ],
    "Authors": [],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": ""
  },
  {
    "slug": "arabic_document_classification_dataset",
    "الاسم": "مجموعة بيانات تصنيف الوثائق العربية",
    "الاسم_الأصلي": "Arabic Document Classification Dataset",
    "درجة_الجودة": 25,
    "تقدير_الجودة": "ضعيف",
    "الملخص": "مجموعة بيانات تصنيف الوثائق العربية الأصلية تتكون من 2700 وثيقة موزعة على 9 تصنيفات (فنون، أدب، دين، سياسة، قانون، اقتصاد، رياضة، صحة، تكنولوجيا) باستخدام تمثيل TF-IDF. إلا أن النسخة المرفوعة على HuggingFace مشوهة بشكل كبير، حيث تحتوي على 603,454 صف عبارة عن كلمات مفردة مجزأة ومجذّرة بدلاً من وثائق كاملة، مع نسبة تكرار تتجاوز 94%. الرابط المباشر الأصلي للبيانات لم يعد متاحاً، مما يجعل الوصول إلى البيانات بشكلها الأصلي غير ممكن عبر المصادر المعلنة. الورقة البحثية المرتبطة نُشرت عام 2014 في مجلة IJCA وتركز على أثر خصائص مجموعة البيانات على نتائج خوارزميات التصنيف.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "datasets_lib",
      "عدد_العينات_المفحوصة": 603454,
      "معاينة_العينات": [
        "{'Text': 'منع', 'label': 4} — كلمة مفردة مجذّرة بتصنيف 4 (دين)",
        "{'Text': 'اجئ', 'label': 4} — كلمة مفردة ناقصة (لاجئ؟) بتصنيف 4 (دين)",
        "{'Text': 'صومال', 'label': 4} — كلمة مفردة مجذّرة بتصنيف 4 (دين)"
      ],
      "مشاكل_مكتشفة": [
        "البيانات عبارة عن كلمات مفردة مجزأة وليست وثائق كاملة كما يدّعي الوصف",
        "متوسط طول النص 3.8 حرف فقط، والحد الأقصى 20 حرفاً — لا توجد وثائق أو جمل",
        "نسبة التكرار 94.8% — فقط 31,180 كلمة فريدة من أصل 603,454 صف",
        "2,700 نص فارغ تماماً (ربما فواصل بين الوثائق الأصلية)",
        "الكلمات تبدو مجذّرة (stemmed) ومقطّعة، مثل: 'اجئ' بدلاً من 'لاجئ'، 'ابتدائ' بدلاً من 'ابتدائي'",
        "لا يمكن إعادة بناء الوثائق الأصلية من هذه الكلمات المفردة",
        "لا يوجد ملف README أو توثيق على صفحة HuggingFace",
        "الرابط المباشر الأصلي للبيانات (edublogs) لم يعد يعمل — يحيل إلى صفحة خطأ"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "البيانات متاحة مجاناً ويمكن تحميلها عبر مكتبة datasets على HuggingFace",
      "التوزيع بين التصنيفات التسعة متوازن نسبياً (64,000-70,000 كلمة لكل تصنيف)",
      "الورقة البحثية منشورة في مجلة علمية محكّمة (IJCA) ومُستشهد بها في أبحاث لاحقة",
      "الفكرة الأصلية للمجموعة قيّمة — تغطي 9 مجالات متنوعة في العربية الفصحى"
    ],
    "نقاط_الضعف": [
      "البيانات المرفوعة على HuggingFace مشوهة تماماً — كلمات مجزأة بدلاً من وثائق كاملة",
      "لا يمكن استخدام البيانات بشكلها الحالي لمهمة تصنيف الوثائق أو أي مهمة NLP ذات معنى",
      "الرابط الأصلي للبيانات معطل ولا يمكن الوصول للوثائق الكاملة",
      "نسبة تكرار عالية جداً (94.8%) تجعل البيانات غير مفيدة",
      "لا يوجد توثيق أو ملف README على HuggingFace يشرح بنية البيانات",
      "الترخيص غير معروف",
      "لا يوجد تقسيم للبيانات (تدريب/اختبار) — قسم واحد فقط",
      "مجموعة البيانات قديمة (2014) ولم تُحدّث",
      "الكلمات المجذّرة فقدت سياقها اللغوي ولا يمكن إعادتها إلى شكلها الأصلي"
    ],
    "الاستخدامات_الموصى_بها": [
      "لا يُنصح باستخدام النسخة الحالية على HuggingFace لأي غرض عملي",
      "يمكن استخدام قائمة الكلمات المجذّرة كمعجم بسيط للتحقق من تغطية المفردات العربية",
      "إذا أمكن الحصول على البيانات الأصلية من مصدر آخر، يمكن استخدامها لتصنيف الوثائق العربية",
      "يُنصح باستخدام بدائل أفضل مثل مجموعة OSAC أو NADA لمهام تصنيف النصوص العربية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 55,
      "التوثيق": 10,
      "السلامة_الأخلاقية": 70,
      "الترخيص": 15,
      "قابلية_إعادة_الإنتاج": 10,
      "المراجعة_العلمية": 50,
      "جودة_البيانات": 8
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/arbml/Document_Classification",
      "https://huggingface.co/datasets/arbml/Document_Classification/tree/main",
      "https://www.ijcaonline.org/archives/volume101/number7/17701-8680/",
      "https://diab.edublogs.org/dataset-for-arabic-document-classification/"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2014,
    "Tasks": [
      "topic classification"
    ],
    "Form": "text",
    "Volume": 2700.0,
    "Unit": "documents",
    "License": "unknown",
    "HF Link": "https://hf.co/datasets/arbml/Document_Classification",
    "Paper Link": "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.800.5666&rep=rep1&type=pdf",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Diab Abuaiadah",
      "Jihad El Sana",
      "Walid Abusalah"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "journal"
  }
]