[
  {
    "slug": "aslad_190k",
    "الاسم": "مجموعة بيانات أبجدية لغة الإشارة العربية ASLAD-190K",
    "الاسم_الأصلي": "ASLAD-190K: Arabic Sign Language Alphabet Dataset",
    "درجة_الجودة": 72,
    "تقدير_الجودة": "جيد",
    "الملخص": "مجموعة بيانات شاملة تضم 190,000 صورة RGB مصنّفة تمثل 32 حرفاً وإشارة من أبجدية لغة الإشارة العربية. جُمعت الصور بواسطة شخصين مستخدمين كاميرتي ويب (HP HD وHP TrueVision HD) في ظروف متنوعة من حيث الإضاءة والمسافة والخلفية. تشمل المجموعة أيضاً مجموعة فرعية متوازنة (96,000 صورة) مع ملف CSV يحتوي على إحداثيات 21 نقطة مرجعية لليد و26 زاوية هندسية مستخلصة. البيانات متاحة مجاناً بترخيص CC BY 4.0 وتهدف لدعم تطوير تقنيات التعرف على لغة الإشارة العربية لخدمة مجتمع الصم وضعاف السمع الناطقين بالعربية.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "hf_viewer",
      "عدد_العينات_المفحوصة": 15,
      "معاينة_العينات": [
        "{'letter': 'ain', 'file_name': 'ain (1).jpg'} - صورة لحرف العين في لغة الإشارة العربية",
        "{'letter': 'aleff', 'file_name': 'aleff (1).jpg'} - صورة لحرف الألف في لغة الإشارة العربية",
        "ASLAD-96K landmarks: التصنيف=0, الصورة=ain (5191).jpg, إحداثيات landmarks: [0.146, 0.644, 0.0, 0.216, 0.463, 0.034], زوايا: [141.75, 63.83, 145.09, ...]"
      ],
      "مشاكل_مكتشفة": [
        "أسماء أعمدة ملف CSV للـ landmarks رقمية وغير وصفية (4096، 4097، ...) بدلاً من أسماء دالة مثل x_wrist, y_wrist مما يصعّب فهم البيانات واستخدامها",
        "الصور الفعلية مضغوطة في ملف ZIP كبير ولا يمكن معاينتها مباشرة من HuggingFace بسبب خطأ في فك تشفير UTF-8",
        "عدد الموقّعين محدود جداً (شخصان فقط) مما قد يحدّ من تنوع أساليب الإشارة وتعميم النماذج المدربة عليها",
        "عدم توازن طفيف في التوزيع بين الفئات في المجموعة الأصلية (من 5,108 إلى 7,092 صورة لكل حرف)",
        "لا يوجد تقسيم رسمي للبيانات إلى مجموعات تدريب واختبار وتحقق"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "حجم كبير ومميز: 190,000 صورة تجعلها من أكبر مجموعات بيانات لغة الإشارة العربية المتاحة",
      "تنوع في ظروف التصوير: إضاءة متباينة، مسافات مختلفة، خلفيات بسيطة ومعقدة، تصوير نهاري وليلي",
      "توفر مجموعة فرعية متوازنة (96,000 صورة بواقع 3,000 لكل فئة) مما يسهّل التدريب العادل",
      "استخلاص سمات إضافية: إحداثيات landmarks و26 زاوية هندسية متوفرة في ملف CSV جاهز",
      "لا توجد أسماء ملفات مكررة ولا قيم مفقودة في بيانات landmarks مما يدل على عناية في إعداد البيانات",
      "ترخيص مفتوح CC BY 4.0 يسمح بالاستخدام الحر",
      "ورقة بحثية منشورة في مجلة علمية محكّمة (Neural Computing and Applications - Springer)",
      "تم التحقق من البيانات بمساعدة مدرسة الصم والبكم في المنصورة، قسنطينة، الجزائر"
    ],
    "نقاط_الضعف": [
      "عدد الموقّعين محدود جداً (شخصان فقط) مما يقلل من تنوع أنماط الإشارة ويضعف قابلية التعميم",
      "أسماء أعمدة ملف CSV للسمات رقمية وغير واضحة وتفتقر للتوثيق المباشر",
      "لا يوجد تقسيم رسمي للبيانات (تدريب/اختبار/تحقق) مما يصعّب المقارنة المعيارية",
      "البيانات مضغوطة في ملف ZIP كبير مما يعيق التحميل التدفقي والمعاينة السريعة من HuggingFace",
      "الورقة البحثية الوصفية (preprint) لا تتضمن نتائج تجريبية مباشرة بل تحيل إلى الورقة الأصلية المنشورة في Springer",
      "تغطية محدودة لتنوع الموقّعين ديموغرافياً (عمر، جنس، حجم اليد) مما قد يؤدي لتحيّز في النماذج",
      "البيانات ثابتة (صور) ولا تشمل إشارات حركية أو فيديو"
    ],
    "الاستخدامات_الموصى_بها": [
      "تدريب نماذج تصنيف صور حروف لغة الإشارة العربية باستخدام التعلم العميق",
      "تطوير أنظمة التعرف الآلي على لغة الإشارة العربية في الوقت الفعلي",
      "البحث في استخلاص سمات اليد (landmarks والزوايا الهندسية) للتعرف على الإيماءات",
      "المقارنة المعيارية بين خوارزميات الرؤية الحاسوبية على بيانات لغة الإشارة العربية",
      "تطوير تقنيات مساعدة للصم وضعاف السمع في المجتمعات الناطقة بالعربية",
      "دراسات نقل التعلم من مجموعات بيانات لغات الإشارة الأخرى إلى العربية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 65,
      "التوثيق": 62,
      "السلامة_الأخلاقية": 80,
      "الترخيص": 95,
      "قابلية_إعادة_الإنتاج": 60,
      "المراجعة_العلمية": 75,
      "جودة_البيانات": 70
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/aboulesnane/ASLAD-190K",
      "https://data.mendeley.com/datasets/2fgpn5dwgc/2",
      "https://hal.science/hal-04822778v1/file/ASLAD-190Kv2.pdf",
      "https://link.springer.com/article/10.1007/s00521-024-10729-7"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2024,
    "Tasks": [
      "sign language recognition"
    ],
    "Form": "images",
    "Volume": 190000.0,
    "Unit": "images",
    "License": "CC BY 4.0",
    "HF Link": "https://huggingface.co/datasets/aboulesnane/ASLAD-190K",
    "Paper Link": "https://osf.io/preprints/osf/n236q_v2",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Abdennour Boulesnane",
      "Lyna Bellil",
      "Maissoun Ghouzlen Ghiri"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "preprint"
  },
  {
    "slug": "wikimatrix",
    "الاسم": "ويكي ماتريكس",
    "الاسم_الأصلي": "WikiMatrix",
    "درجة_الجودة": 58,
    "تقدير_الجودة": "مقبول",
    "الملخص": "WikiMatrix هي مجموعة بيانات ضخمة للجمل المتوازية مُستخرجة تلقائياً من ويكيبيديا باستخدام تضمينات الجمل متعددة اللغات (LASER). تحتوي على حوالي 4435 جملة عربية-إنجليزية كجزء من 135 مليون جملة متوازية عبر 1620 زوج لغوي. الجودة متفاوتة بشكل ملحوظ: فبينما توجد أزواج ترجمة جيدة ودقيقة، لوحظت أيضاً أخطاء ترجمة دلالية خطيرة وضوضاء ناتجة عن مراجع ويكيبيديا ونصوص إنجليزية مختلطة في الجانب العربي. البيانات مفيدة للترجمة الآلية لكنها تحتاج تنقية إضافية قبل الاستخدام خاصة لرفع عتبة درجة التطابق.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "direct_link",
      "عدد_العينات_المفحوصة": 200,
      "معاينة_العينات": [
        "Score: 1.20 | AR: في البداية حققوا بعض المكاسب بما في ذلك الاستيلاء على تلة استراتيجية. | EN: Initially, they made some gains, including capturing a strategic hill.",
        "Score: 1.19 | AR: اطلع عليه بتاريخ 24 أبريل 2011. Yemen deal may be done within week: officials. | EN: Yemen deal may be done within week: officials.",
        "Score: 1.19 | AR: عن \"رب العالمين\" سبحانه وتعالى. | EN: Opsaridium ubangiense."
      ],
      "مشاكل_مكتشفة": [
        "أخطاء ترجمة دلالية خطيرة: بعض الأزواج غير مترابطة معنوياً إطلاقاً (مثال: 'عن رب العالمين سبحانه وتعالى' مقابل 'Opsaridium ubangiense' وهو اسم نوع سمكي)",
        "خطأ في العينة الأولى: 'إلى ربها ناظرة: أي منتظرة لرحمته ودخول جنته' ترجمت إلى 'He is sometimes seen having arguments with his lord' وهي ترجمة خاطئة تماماً",
        "نسبة 11.5% من العينات تحتوي على نصوص إنجليزية مختلطة في حقل المصدر العربي، ناتجة عن مراجع ويكيبيديا وعناوين أجنبية",
        "نسبة 5.5% من العينات تحتوي على ضوضاء مراجع ويكيبيديا مثل 'اطلع عليه بتاريخ' متبوعة بنص إنجليزي",
        "بعض الأزواج هي نسخ متطابقة عربي-عربي وليست ترجمات فعلية (مثل: 'ماذا تعرف عن تركستان الشرقية' في كلا الجانبين)",
        "رابط HuggingFace المسجّل في البيانات الوصفية (Tyler/wikimatrix_collapsed) يشير إلى مجموعة فارغة لا تحتوي على أي بيانات"
      ],
      "البيانات_تطابق_الوصف": true
    },
    "نقاط_القوة": [
      "حجم كبير من الجمل المتوازية العربية-الإنجليزية المستخرجة تلقائياً",
      "البيانات متاحة مجاناً للتحميل المباشر من خوادم Facebook/Meta",
      "كل زوج جمل مرفق بدرجة تطابق رقمية تسمح بالترشيح حسب الجودة المطلوبة",
      "منهجية علمية موثقة ومنشورة في مؤتمر EACL المرموق",
      "تغطية واسعة لأزواج اللغات (1620 زوج) مما يتيح الترجمة المحورية",
      "حوالي 86.5% من العينات المفحوصة ذات جودة مقبولة على الأقل من حيث عدم وجود ضوضاء واضحة"
    ],
    "نقاط_الضعف": [
      "وجود أخطاء ترجمة دلالية خطيرة في بعض الأزواج عالية الدرجة، مما يعني أن درجة التطابق ليست مؤشراً موثوقاً بالكامل",
      "تلوث بنصوص إنجليزية في حقل المصدر العربي بنسبة ملحوظة (11.5%)",
      "ضوضاء ناتجة عن مراجع ويكيبيديا وبيانات وصفية غير مفيدة للترجمة",
      "لا يوجد تقسيم اختبار رسمي في مجموعة البيانات",
      "رابط HuggingFace في البيانات الوصفية معطّل (المجموعة فارغة)",
      "الترخيص المسجّل في البيانات الوصفية (Apache-1.0) يختلف عن الترخيص الفعلي لمحتوى ويكيبيديا (CC-BY-SA)",
      "حجم البيانات العربية صغير نسبياً (4435 جملة) مقارنة بالحجم الكلي للمشروع (135 مليون)"
    ],
    "الاستخدامات_الموصى_بها": [
      "تدريب نماذج الترجمة الآلية العربية-الإنجليزية كمصدر بيانات تكميلي بعد ترشيح العتبة",
      "بحوث استخراج النصوص المتوازية وتقييم طرق التعدين التلقائي",
      "إثراء بيانات التدريب للغات منخفضة الموارد عبر الترجمة المحورية",
      "تجارب مقارنة لتقييم جودة الاستخراج التلقائي مقابل الترجمة البشرية"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 55,
      "التوثيق": 65,
      "السلامة_الأخلاقية": 75,
      "الترخيص": 55,
      "قابلية_إعادة_الإنتاج": 70,
      "المراجعة_العلمية": 80,
      "جودة_البيانات": 45
    },
    "المصادر_المفتوحة": [
      "https://dl.fbaipublicfiles.com/laser/WikiMatrix/v1/WikiMatrix.ar-en.tsv.gz",
      "https://huggingface.co/datasets/Tyler/wikimatrix_collapsed",
      "https://github.com/facebookresearch/LASER/tree/master/tasks/WikiMatrix",
      "https://aclanthology.org/2021.eacl-main.115/"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2021,
    "Tasks": [
      "machine translation"
    ],
    "Form": "text",
    "Volume": 4435.0,
    "Unit": "sentences",
    "License": "Apache-1.0",
    "HF Link": "https://hf.co/datasets/Tyler/wikimatrix_collapsed",
    "Paper Link": "https://github.com/facebookresearch/LASER/tree/master/tasks/WikiMatrix",
    "Domain": [
      "wikipedia"
    ],
    "Authors": [
      "Holger Schwenk",
      "Vishrav Chaudhary",
      "Shuo Sun",
      "Hongyu Gong",
      "Francisco Guzmán"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  },
  {
    "slug": "kde4",
    "الاسم": "مجموعة بيانات KDE4 المتوازية",
    "الاسم_الأصلي": "KDE4",
    "درجة_الجودة": 38,
    "تقدير_الجودة": "ضعيف",
    "الملخص": "مجموعة بيانات متوازية عربية-إنجليزية مستخرجة من ملفات توطين برنامج KDE4، تحتوي على 116,239 زوج جمل. معظم المحتوى عبارة عن عناصر واجهة مستخدم قصيرة (أزرار، قوائم، رسائل خطأ) وليس جملاً طبيعية كاملة، مما يحدّ بشدة من فائدتها للترجمة الآلية العامة. تعاني المجموعة من نسبة تكرار عالية جداً تبلغ 38% من الأسطر، ونحو 13% من الأسطر في العمود العربي لا تحتوي أي حروف عربية أصلاً، بالإضافة إلى أخطاء محاذاة واضحة بين الجمل العربية والإنجليزية. رغم أنها مورد مجاني ومتاح، إلا أن جودة البيانات الفعلية لا ترقى للاستخدام المباشر دون تنظيف وتصفية مكثفين.",
    "فحص_البيانات": {
      "الطريقة_المستخدمة": "direct_link",
      "عدد_العينات_المفحوصة": 116239,
      "معاينة_العينات": [
        "AR: مانع الإعلانات | EN: Adblock",
        "AR: اضبط... | EN: Configure Filters...",
        "AR: ترويسة التوقيع المعيارية: | EN: Standard signature header:"
      ],
      "مشاكل_مكتشفة": [
        "15,120 سطر (13%) في العمود العربي لا تحتوي أي حروف عربية — بل أسماء تقنية إنجليزية وأرقام وعلامات metadata مثل @action:inmenu",
        "44,609 سطر مكرر (38.4% من المجموعة) — أكثرها كلمة Name المكررة 1,217 مرة وComment المكررة 638 مرة",
        "أخطاء محاذاة واضحة: مثال 'لا يستطيع فتح لـ القراءة' مقابل 'Singapore'، و'صحيح' مقابل 'Substract'",
        "نصوص عربية مشوهة أو ركيكة مثل 'رشح هذا العنصرِّح' و'تفقّد الحالة من وصلات من الكميّات'",
        "معظم الجمل قصيرة جداً (متوسط 27 حرف) وهي عناصر واجهة مستخدم وليست جملاً لغوية طبيعية",
        "وجود علامات تقنية غير منظفة مثل 'صانع المشاهدName' و'أيرلانداworld. kgm' حيث اختلطت النصوص العربية بالإنجليزية",
        "بعض الأسطر تحتوي رموز XML أو KDE غير محذوفة مثل '& تجاهل النوافذ المصغرة'"
      ],
      "البيانات_تطابق_الوصف": false
    },
    "نقاط_القوة": [
      "المجموعة متاحة مجاناً ويمكن تحميلها مباشرة من خوادم OPUS",
      "حجم معقول يبلغ 116,239 زوج جمل متوازية",
      "تغطي مجالاً تقنياً محدداً (واجهات البرمجيات) قد يكون مفيداً لتوطين البرمجيات",
      "جزء من مشروع OPUS الموثوق والمنشور في مؤتمر LREC",
      "لا توجد أسطر فارغة في البيانات"
    ],
    "نقاط_الضعف": [
      "نسبة عالية جداً من التكرار (38.4%) تقلل الحجم الفعلي المفيد بشكل كبير",
      "13% من الأسطر العربية لا تحتوي أي نص عربي فعلي",
      "أخطاء محاذاة خطيرة بين الجمل العربية والإنجليزية في عدد غير قليل من الأزواج",
      "المحتوى مقتصر على عناصر واجهة مستخدم قصيرة وليس نصوصاً لغوية طبيعية",
      "جودة الترجمة العربية متفاوتة — بعض الترجمات ركيكة أو غير مكتملة أو مشوهة",
      "الترخيص مخصص (custom) وغير واضح المعالم",
      "لا يوجد تقسيم للاختبار (test split)",
      "الوصف يدّعي 700,000 جملة لكن البيانات الفعلية للعربية-الإنجليزية تحتوي 116,239 فقط"
    ],
    "الاستخدامات_الموصى_بها": [
      "توطين واجهات البرمجيات من الإنجليزية إلى العربية بعد تنظيف البيانات",
      "استخدامها كبيانات تدريب مساعدة (ضمن مجموعات أكبر) للترجمة الآلية في المجال التقني فقط",
      "بناء قواميس مصطلحات تقنية عربية-إنجليزية متخصصة في البرمجيات",
      "لا يُنصح باستخدامها للترجمة الآلية العامة دون تنظيف وتصفية مكثفين"
    ],
    "تفصيل_الجودة": {
      "سهولة_الوصول": 75,
      "التوثيق": 40,
      "السلامة_الأخلاقية": 85,
      "الترخيص": 35,
      "قابلية_إعادة_الإنتاج": 65,
      "المراجعة_العلمية": 55,
      "جودة_البيانات": 25
    },
    "المصادر_المفتوحة": [
      "https://huggingface.co/datasets/Helsinki-NLP/kde4",
      "https://huggingface.co/datasets/Helsinki-NLP/kde4/viewer/ar-en",
      "https://object.pouta.csc.fi/OPUS-KDE4/v2/moses/ar-en.txt.zip"
    ],
    "تم_تحميل_البيانات": true,
    "Year": 2012,
    "Tasks": [
      "machine translation"
    ],
    "Form": "text",
    "Volume": 700000.0,
    "Unit": "sentences",
    "License": "custom",
    "HF Link": "https://hf.co/datasets/Helsinki-NLP/kde4",
    "Paper Link": "http://www.lrec-conf.org/proceedings/lrec2012/pdf/463_Paper.pdf",
    "Domain": [
      "other"
    ],
    "Authors": [
      "Jorg Tiedemann"
    ],
    "Dialect": "Modern Standard Arabic",
    "Access": "Free",
    "Venue Type": "conference"
  }
]